Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_dma2d.h
// FGCLUT10 Configuration

#define DMA2D_FGCLUT10_ALPHA        (0xFFu<<24)
#define DMA2D_FGCLUT10_ALPHA_0      (0x1u<<24)
#define DMA2D_FGCLUT10_RED          (0xFFu<<16)
#define DMA2D_FGCLUT10_RED_0        (0x1u<<16)
#define DMA2D_FGCLUT10_GREEN        (0xFFu<<8)
#define DMA2D_FGCLUT10_GREEN_0      (0x1u<<8)
#define DMA2D_FGCLUT10_BLUE         (0xFFu<<0)
#define DMA2D_FGCLUT10_BLUE_0       (0x1u<<0)

// FGCLUT11 Configuration

#define DMA2D_FGCLUT11_ALPHA        (0xFFu<<24)
#define DMA2D_FGCLUT11_ALPHA_0      (0x1u<<24)
#define DMA2D_FGCLUT11_RED          (0xFFu<<16)
#define DMA2D_FGCLUT11_RED_0        (0x1u<<16)
#define DMA2D_FGCLUT11_GREEN        (0xFFu<<8)
#define DMA2D_FGCLUT11_GREEN_0      (0x1u<<8)
#define DMA2D_FGCLUT11_BLUE         (0xFFu<<0)
#define DMA2D_FGCLUT11_BLUE_0       (0x1u<<0)

// FGCLUT12 Configuration

#define DMA2D_FGCLUT12_ALPHA        (0xFFu<<24)
#define DMA2D_FGCLUT12_ALPHA_0      (0x1u<<24)
#define DMA2D_FGCLUT12_RED          (0xFFu<<16)
#define DMA2D_FGCLUT12_RED_0        (0x1u<<16)
#define DMA2D_FGCLUT12_GREEN        (0xFFu<<8)
#define DMA2D_FGCLUT12_GREEN_0      (0x1u<<8)
#define DMA2D_FGCLUT12_BLUE         (0xFFu<<0)
#define DMA2D_FGCLUT12_BLUE_0       (0x1u<<0)

// FGCLUT13 Configuration

#define DMA2D_FGCLUT13_ALPHA        (0xFFu<<24)
#define DMA2D_FGCLUT13_ALPHA_0      (0x1u<<24)
#define DMA2D_FGCLUT13_RED          (0xFFu<<16)
#define DMA2D_FGCLUT13_RED_0        (0x1u<<16)
#define DMA2D_FGCLUT13_GREEN        (0xFFu<<8)
#define DMA2D_FGCLUT13_GREEN_0      (0x1u<<8)
#define DMA2D_FGCLUT13_BLUE         (0xFFu<<0)
#define DMA2D_FGCLUT13_BLUE_0       (0x1u<<0)

// FGCLUT14 Configuration

#define DMA2D_FGCLUT14_ALPHA        (0xFFu<<24)
#define DMA2D_FGCLUT14_ALPHA_0      (0x1u<<24)
#define DMA2D_FGCLUT14_RED          (0xFFu<<16)
#define DMA2D_FGCLUT14_RED_0        (0x1u<<16)
#define DMA2D_FGCLUT14_GREEN        (0xFFu<<8)
#define DMA2D_FGCLUT14_GREEN_0      (0x1u<<8)
#define DMA2D_FGCLUT14_BLUE         (0xFFu<<0)
#define DMA2D_FGCLUT14_BLUE_0       (0x1u<<0)

// FGCLUT15 Configuration

#define DMA2D_FGCLUT15_ALPHA        (0xFFu<<24)
#define DMA2D_FGCLUT15_ALPHA_0      (0x1u<<24)
#define DMA2D_FGCLUT15_RED          (0xFFu<<16)
#define DMA2D_FGCLUT15_RED_0        (0x1u<<16)
#define DMA2D_FGCLUT15_GREEN        (0xFFu<<8)
#define DMA2D_FGCLUT15_GREEN_0      (0x1u<<8)
#define DMA2D_FGCLUT15_BLUE         (0xFFu<<0)
#define DMA2D_FGCLUT15_BLUE_0       (0x1u<<0)

// FGCLUT16 Configuration

#define DMA2D_FGCLUT16_ALPHA        (0xFFu<<24)
#define DMA2D_FGCLUT16_ALPHA_0      (0x1u<<24)
#define DMA2D_FGCLUT16_RED          (0xFFu<<16)
#define DMA2D_FGCLUT16_RED_0        (0x1u<<16)
#define DMA2D_FGCLUT16_GREEN        (0xFFu<<8)
#define DMA2D_FGCLUT16_GREEN_0      (0x1u<<8)
#define DMA2D_FGCLUT16_BLUE         (0xFFu<<0)
#define DMA2D_FGCLUT16_BLUE_0       (0x1u<<0)

// FGCLUT17 Configuration

#define DMA2D_FGCLUT17_ALPHA        (0xFFu<<24)
#define DMA2D_FGCLUT17_ALPHA_0      (0x1u<<24)
#define DMA2D_FGCLUT17_RED          (0xFFu<<16)
#define DMA2D_FGCLUT17_RED_0        (0x1u<<16)
#define DMA2D_FGCLUT17_GREEN        (0xFFu<<8)
#define DMA2D_FGCLUT17_GREEN_0      (0x1u<<8)
#define DMA2D_FGCLUT17_BLUE         (0xFFu<<0)
#define DMA2D_FGCLUT17_BLUE_0       (0x1u<<0)

// FGCLUT18 Configuration

#define DMA2D_FGCLUT18_ALPHA        (0xFFu<<24)
#define DMA2D_FGCLUT18_ALPHA_0      (0x1u<<24)
#define DMA2D_FGCLUT18_RED          (0xFFu<<16)
#define DMA2D_FGCLUT18_RED_0        (0x1u<<16)
#define DMA2D_FGCLUT18_GREEN        (0xFFu<<8)
#define DMA2D_FGCLUT18_GREEN_0      (0x1u<<8)
#define DMA2D_FGCLUT18_BLUE         (0xFFu<<0)
#define DMA2D_FGCLUT18_BLUE_0       (0x1u<<0)

// FGCLUT19 Configuration

#define DMA2D_FGCLUT19_ALPHA        (0xFFu<<24)
#define DMA2D_FGCLUT19_ALPHA_0      (0x1u<<24)
#define DMA2D_FGCLUT19_RED          (0xFFu<<16)
#define DMA2D_FGCLUT19_RED_0        (0x1u<<16)
#define DMA2D_FGCLUT19_GREEN        (0xFFu<<8)
#define DMA2D_FGCLUT19_GREEN_0      (0x1u<<8)
#define DMA2D_FGCLUT19_BLUE         (0xFFu<<0)
#define DMA2D_FGCLUT19_BLUE_0       (0x1u<<0)

// FGCLUT20 Configuration

#define DMA2D_FGCLUT20_ALPHA        (0xFFu<<24)
#define DMA2D_FGCLUT20_ALPHA_0      (0x1u<<24)
#define DMA2D_FGCLUT20_RED          (0xFFu<<16)
#define DMA2D_FGCLUT20_RED_0        (0x1u<<16)
#define DMA2D_FGCLUT20_GREEN        (0xFFu<<8)
#define DMA2D_FGCLUT20_GREEN_0      (0x1u<<8)
#define DMA2D_FGCLUT20_BLUE         (0xFFu<<0)
#define DMA2D_FGCLUT20_BLUE_0       (0x1u<<0)

// FGCLUT21 Configuration

#define DMA2D_FGCLUT21_ALPHA        (0xFFu<<24)
#define DMA2D_FGCLUT21_ALPHA_0      (0x1u<<24)
#define DMA2D_FGCLUT21_RED          (0xFFu<<16)
#define DMA2D_FGCLUT21_RED_0        (0x1u<<16)
#define DMA2D_FGCLUT21_GREEN        (0xFFu<<8)
#define DMA2D_FGCLUT21_GREEN_0      (0x1u<<8)
#define DMA2D_FGCLUT21_BLUE         (0xFFu<<0)
#define DMA2D_FGCLUT21_BLUE_0       (0x1u<<0)

// FGCLUT22 Configuration

#define DMA2D_FGCLUT22_ALPHA        (0xFFu<<24)
#define DMA2D_FGCLUT22_ALPHA_0      (0x1u<<24)
#define DMA2D_FGCLUT22_RED          (0xFFu<<16)
#define DMA2D_FGCLUT22_RED_0        (0x1u<<16)
#define DMA2D_FGCLUT22_GREEN        (0xFFu<<8)
#define DMA2D_FGCLUT22_GREEN_0      (0x1u<<8)
#define DMA2D_FGCLUT22_BLUE         (0xFFu<<0)
#define DMA2D_FGCLUT22_BLUE_0       (0x1u<<0)

// FGCLUT23 Configuration

#define DMA2D_FGCLUT23_ALPHA        (0xFFu<<24)
#define DMA2D_FGCLUT23_ALPHA_0      (0x1u<<24)
#define DMA2D_FGCLUT23_RED          (0xFFu<<16)
#define DMA2D_FGCLUT23_RED_0        (0x1u<<16)
#define DMA2D_FGCLUT23_GREEN        (0xFFu<<8)
#define DMA2D_FGCLUT23_GREEN_0      (0x1u<<8)
#define DMA2D_FGCLUT23_BLUE         (0xFFu<<0)
#define DMA2D_FGCLUT23_BLUE_0       (0x1u<<0)

// FGCLUT24 Configuration

#define DMA2D_FGCLUT24_ALPHA        (0xFFu<<24)
#define DMA2D_FGCLUT24_ALPHA_0      (0x1u<<24)
#define DMA2D_FGCLUT24_RED          (0xFFu<<16)
#define DMA2D_FGCLUT24_RED_0        (0x1u<<16)
#define DMA2D_FGCLUT24_GREEN        (0xFFu<<8)
#define DMA2D_FGCLUT24_GREEN_0      (0x1u<<8)
#define DMA2D_FGCLUT24_BLUE         (0xFFu<<0)
#define DMA2D_FGCLUT24_BLUE_0       (0x1u<<0)

// FGCLUT25 Configuration

