Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_dma2d.h
#define DMA2D_FGCLUT25_ALPHA        (0xFFu<<24)
#define DMA2D_FGCLUT25_ALPHA_0      (0x1u<<24)
#define DMA2D_FGCLUT25_RED          (0xFFu<<16)
#define DMA2D_FGCLUT25_RED_0        (0x1u<<16)
#define DMA2D_FGCLUT25_GREEN        (0xFFu<<8)
#define DMA2D_FGCLUT25_GREEN_0      (0x1u<<8)
#define DMA2D_FGCLUT25_BLUE         (0xFFu<<0)
#define DMA2D_FGCLUT25_BLUE_0       (0x1u<<0)

// FGCLUT26 Configuration

#define DMA2D_FGCLUT26_ALPHA        (0xFFu<<24)
#define DMA2D_FGCLUT26_ALPHA_0      (0x1u<<24)
#define DMA2D_FGCLUT26_RED          (0xFFu<<16)
#define DMA2D_FGCLUT26_RED_0        (0x1u<<16)
#define DMA2D_FGCLUT26_GREEN        (0xFFu<<8)
#define DMA2D_FGCLUT26_GREEN_0      (0x1u<<8)
#define DMA2D_FGCLUT26_BLUE         (0xFFu<<0)
#define DMA2D_FGCLUT26_BLUE_0       (0x1u<<0)

// FGCLUT27 Configuration

#define DMA2D_FGCLUT27_ALPHA        (0xFFu<<24)
#define DMA2D_FGCLUT27_ALPHA_0      (0x1u<<24)
#define DMA2D_FGCLUT27_RED          (0xFFu<<16)
#define DMA2D_FGCLUT27_RED_0        (0x1u<<16)
#define DMA2D_FGCLUT27_GREEN        (0xFFu<<8)
#define DMA2D_FGCLUT27_GREEN_0      (0x1u<<8)
#define DMA2D_FGCLUT27_BLUE         (0xFFu<<0)
#define DMA2D_FGCLUT27_BLUE_0       (0x1u<<0)

// FGCLUT28 Configuration

#define DMA2D_FGCLUT28_ALPHA        (0xFFu<<24)
#define DMA2D_FGCLUT28_ALPHA_0      (0x1u<<24)
#define DMA2D_FGCLUT28_RED          (0xFFu<<16)
#define DMA2D_FGCLUT28_RED_0        (0x1u<<16)
#define DMA2D_FGCLUT28_GREEN        (0xFFu<<8)
#define DMA2D_FGCLUT28_GREEN_0      (0x1u<<8)
#define DMA2D_FGCLUT28_BLUE         (0xFFu<<0)
#define DMA2D_FGCLUT28_BLUE_0       (0x1u<<0)

// FGCLUT29 Configuration

#define DMA2D_FGCLUT29_ALPHA        (0xFFu<<24)
#define DMA2D_FGCLUT29_ALPHA_0      (0x1u<<24)
#define DMA2D_FGCLUT29_RED          (0xFFu<<16)
#define DMA2D_FGCLUT29_RED_0        (0x1u<<16)
#define DMA2D_FGCLUT29_GREEN        (0xFFu<<8)
#define DMA2D_FGCLUT29_GREEN_0      (0x1u<<8)
#define DMA2D_FGCLUT29_BLUE         (0xFFu<<0)
#define DMA2D_FGCLUT29_BLUE_0       (0x1u<<0)

// FGCLUT30 Configuration

#define DMA2D_FGCLUT30_ALPHA        (0xFFu<<24)
#define DMA2D_FGCLUT30_ALPHA_0      (0x1u<<24)
#define DMA2D_FGCLUT30_RED          (0xFFu<<16)
#define DMA2D_FGCLUT30_RED_0        (0x1u<<16)
#define DMA2D_FGCLUT30_GREEN        (0xFFu<<8)
#define DMA2D_FGCLUT30_GREEN_0      (0x1u<<8)
#define DMA2D_FGCLUT30_BLUE         (0xFFu<<0)
#define DMA2D_FGCLUT30_BLUE_0       (0x1u<<0)

// FGCLUT31 Configuration

#define DMA2D_FGCLUT31_ALPHA        (0xFFu<<24)
#define DMA2D_FGCLUT31_ALPHA_0      (0x1u<<24)
#define DMA2D_FGCLUT31_RED          (0xFFu<<16)
#define DMA2D_FGCLUT31_RED_0        (0x1u<<16)
#define DMA2D_FGCLUT31_GREEN        (0xFFu<<8)
#define DMA2D_FGCLUT31_GREEN_0      (0x1u<<8)
#define DMA2D_FGCLUT31_BLUE         (0xFFu<<0)
#define DMA2D_FGCLUT31_BLUE_0       (0x1u<<0)

// FGCLUT32 Configuration

#define DMA2D_FGCLUT32_ALPHA        (0xFFu<<24)
#define DMA2D_FGCLUT32_ALPHA_0      (0x1u<<24)
#define DMA2D_FGCLUT32_RED          (0xFFu<<16)
#define DMA2D_FGCLUT32_RED_0        (0x1u<<16)
#define DMA2D_FGCLUT32_GREEN        (0xFFu<<8)
#define DMA2D_FGCLUT32_GREEN_0      (0x1u<<8)
#define DMA2D_FGCLUT32_BLUE         (0xFFu<<0)
#define DMA2D_FGCLUT32_BLUE_0       (0x1u<<0)

// FGCLUT33 Configuration

#define DMA2D_FGCLUT33_ALPHA        (0xFFu<<24)
#define DMA2D_FGCLUT33_ALPHA_0      (0x1u<<24)
#define DMA2D_FGCLUT33_RED          (0xFFu<<16)
#define DMA2D_FGCLUT33_RED_0        (0x1u<<16)
#define DMA2D_FGCLUT33_GREEN        (0xFFu<<8)
#define DMA2D_FGCLUT33_GREEN_0      (0x1u<<8)
#define DMA2D_FGCLUT33_BLUE         (0xFFu<<0)
#define DMA2D_FGCLUT33_BLUE_0       (0x1u<<0)

// FGCLUT34 Configuration

#define DMA2D_FGCLUT34_ALPHA        (0xFFu<<24)
#define DMA2D_FGCLUT34_ALPHA_0      (0x1u<<24)
#define DMA2D_FGCLUT34_RED          (0xFFu<<16)
#define DMA2D_FGCLUT34_RED_0        (0x1u<<16)
#define DMA2D_FGCLUT34_GREEN        (0xFFu<<8)
#define DMA2D_FGCLUT34_GREEN_0      (0x1u<<8)
#define DMA2D_FGCLUT34_BLUE         (0xFFu<<0)
#define DMA2D_FGCLUT34_BLUE_0       (0x1u<<0)

// FGCLUT35 Configuration

#define DMA2D_FGCLUT35_ALPHA        (0xFFu<<24)
#define DMA2D_FGCLUT35_ALPHA_0      (0x1u<<24)
#define DMA2D_FGCLUT35_RED          (0xFFu<<16)
#define DMA2D_FGCLUT35_RED_0        (0x1u<<16)
#define DMA2D_FGCLUT35_GREEN        (0xFFu<<8)
#define DMA2D_FGCLUT35_GREEN_0      (0x1u<<8)
#define DMA2D_FGCLUT35_BLUE         (0xFFu<<0)
#define DMA2D_FGCLUT35_BLUE_0       (0x1u<<0)

// FGCLUT36 Configuration

#define DMA2D_FGCLUT36_ALPHA        (0xFFu<<24)
#define DMA2D_FGCLUT36_ALPHA_0      (0x1u<<24)
#define DMA2D_FGCLUT36_RED          (0xFFu<<16)
#define DMA2D_FGCLUT36_RED_0        (0x1u<<16)
#define DMA2D_FGCLUT36_GREEN        (0xFFu<<8)
#define DMA2D_FGCLUT36_GREEN_0      (0x1u<<8)
#define DMA2D_FGCLUT36_BLUE         (0xFFu<<0)
#define DMA2D_FGCLUT36_BLUE_0       (0x1u<<0)

// FGCLUT37 Configuration

#define DMA2D_FGCLUT37_ALPHA        (0xFFu<<24)
#define DMA2D_FGCLUT37_ALPHA_0      (0x1u<<24)
#define DMA2D_FGCLUT37_RED          (0xFFu<<16)
#define DMA2D_FGCLUT37_RED_0        (0x1u<<16)
#define DMA2D_FGCLUT37_GREEN        (0xFFu<<8)
#define DMA2D_FGCLUT37_GREEN_0      (0x1u<<8)
#define DMA2D_FGCLUT37_BLUE         (0xFFu<<0)
#define DMA2D_FGCLUT37_BLUE_0       (0x1u<<0)

// FGCLUT38 Configuration

#define DMA2D_FGCLUT38_ALPHA        (0xFFu<<24)
#define DMA2D_FGCLUT38_ALPHA_0      (0x1u<<24)
#define DMA2D_FGCLUT38_RED          (0xFFu<<16)
#define DMA2D_FGCLUT38_RED_0        (0x1u<<16)
#define DMA2D_FGCLUT38_GREEN        (0xFFu<<8)
#define DMA2D_FGCLUT38_GREEN_0      (0x1u<<8)
#define DMA2D_FGCLUT38_BLUE         (0xFFu<<0)
#define DMA2D_FGCLUT38_BLUE_0       (0x1u<<0)

// FGCLUT39 Configuration

#define DMA2D_FGCLUT39_ALPHA        (0xFFu<<24)
#define DMA2D_FGCLUT39_ALPHA_0      (0x1u<<24)
#define DMA2D_FGCLUT39_RED          (0xFFu<<16)
#define DMA2D_FGCLUT39_RED_0        (0x1u<<16)
#define DMA2D_FGCLUT39_GREEN        (0xFFu<<8)
#define DMA2D_FGCLUT39_GREEN_0      (0x1u<<8)
#define DMA2D_FGCLUT39_BLUE         (0xFFu<<0)
#define DMA2D_FGCLUT39_BLUE_0       (0x1u<<0)

// FGCLUT40 Configuration

#define DMA2D_FGCLUT40_ALPHA        (0xFFu<<24)
#define DMA2D_FGCLUT40_ALPHA_0      (0x1u<<24)
#define DMA2D_FGCLUT40_RED          (0xFFu<<16)
#define DMA2D_FGCLUT40_RED_0        (0x1u<<16)
#define DMA2D_FGCLUT40_GREEN        (0xFFu<<8)
#define DMA2D_FGCLUT40_GREEN_0      (0x1u<<8)
#define DMA2D_FGCLUT40_BLUE         (0xFFu<<0)
#define DMA2D_FGCLUT40_BLUE_0       (0x1u<<0)

// FGCLUT41 Configuration

#define DMA2D_FGCLUT41_ALPHA        (0xFFu<<24)
#define DMA2D_FGCLUT41_ALPHA_0      (0x1u<<24)
#define DMA2D_FGCLUT41_RED          (0xFFu<<16)
#define DMA2D_FGCLUT41_RED_0        (0x1u<<16)
#define DMA2D_FGCLUT41_GREEN        (0xFFu<<8)
#define DMA2D_FGCLUT41_GREEN_0      (0x1u<<8)
#define DMA2D_FGCLUT41_BLUE         (0xFFu<<0)
#define DMA2D_FGCLUT41_BLUE_0       (0x1u<<0)

// FGCLUT42 Configuration

#define DMA2D_FGCLUT42_ALPHA        (0xFFu<<24)
#define DMA2D_FGCLUT42_ALPHA_0      (0x1u<<24)
#define DMA2D_FGCLUT42_RED          (0xFFu<<16)
#define DMA2D_FGCLUT42_RED_0        (0x1u<<16)
#define DMA2D_FGCLUT42_GREEN        (0xFFu<<8)
#define DMA2D_FGCLUT42_GREEN_0      (0x1u<<8)
#define DMA2D_FGCLUT42_BLUE         (0xFFu<<0)
#define DMA2D_FGCLUT42_BLUE_0       (0x1u<<0)

// FGCLUT43 Configuration

#define DMA2D_FGCLUT43_ALPHA        (0xFFu<<24)
#define DMA2D_FGCLUT43_ALPHA_0      (0x1u<<24)
#define DMA2D_FGCLUT43_RED          (0xFFu<<16)
#define DMA2D_FGCLUT43_RED_0        (0x1u<<16)
#define DMA2D_FGCLUT43_GREEN        (0xFFu<<8)
#define DMA2D_FGCLUT43_GREEN_0      (0x1u<<8)
#define DMA2D_FGCLUT43_BLUE         (0xFFu<<0)
#define DMA2D_FGCLUT43_BLUE_0       (0x1u<<0)

// FGCLUT44 Configuration

