Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_dma2d.h
#define DMA2D_FGCLUT44_ALPHA        (0xFFu<<24)
#define DMA2D_FGCLUT44_ALPHA_0      (0x1u<<24)
#define DMA2D_FGCLUT44_RED          (0xFFu<<16)
#define DMA2D_FGCLUT44_RED_0        (0x1u<<16)
#define DMA2D_FGCLUT44_GREEN        (0xFFu<<8)
#define DMA2D_FGCLUT44_GREEN_0      (0x1u<<8)
#define DMA2D_FGCLUT44_BLUE         (0xFFu<<0)
#define DMA2D_FGCLUT44_BLUE_0       (0x1u<<0)

// FGCLUT45 Configuration

#define DMA2D_FGCLUT45_ALPHA        (0xFFu<<24)
#define DMA2D_FGCLUT45_ALPHA_0      (0x1u<<24)
#define DMA2D_FGCLUT45_RED          (0xFFu<<16)
#define DMA2D_FGCLUT45_RED_0        (0x1u<<16)
#define DMA2D_FGCLUT45_GREEN        (0xFFu<<8)
#define DMA2D_FGCLUT45_GREEN_0      (0x1u<<8)
#define DMA2D_FGCLUT45_BLUE         (0xFFu<<0)
#define DMA2D_FGCLUT45_BLUE_0       (0x1u<<0)

// FGCLUT46 Configuration

#define DMA2D_FGCLUT46_ALPHA        (0xFFu<<24)
#define DMA2D_FGCLUT46_ALPHA_0      (0x1u<<24)
#define DMA2D_FGCLUT46_RED          (0xFFu<<16)
#define DMA2D_FGCLUT46_RED_0        (0x1u<<16)
#define DMA2D_FGCLUT46_GREEN        (0xFFu<<8)
#define DMA2D_FGCLUT46_GREEN_0      (0x1u<<8)
#define DMA2D_FGCLUT46_BLUE         (0xFFu<<0)
#define DMA2D_FGCLUT46_BLUE_0       (0x1u<<0)

// FGCLUT47 Configuration

#define DMA2D_FGCLUT47_ALPHA        (0xFFu<<24)
#define DMA2D_FGCLUT47_ALPHA_0      (0x1u<<24)
#define DMA2D_FGCLUT47_RED          (0xFFu<<16)
#define DMA2D_FGCLUT47_RED_0        (0x1u<<16)
#define DMA2D_FGCLUT47_GREEN        (0xFFu<<8)
#define DMA2D_FGCLUT47_GREEN_0      (0x1u<<8)
#define DMA2D_FGCLUT47_BLUE         (0xFFu<<0)
#define DMA2D_FGCLUT47_BLUE_0       (0x1u<<0)

// FGCLUT48 Configuration

#define DMA2D_FGCLUT48_ALPHA        (0xFFu<<24)
#define DMA2D_FGCLUT48_ALPHA_0      (0x1u<<24)
#define DMA2D_FGCLUT48_RED          (0xFFu<<16)
#define DMA2D_FGCLUT48_RED_0        (0x1u<<16)
#define DMA2D_FGCLUT48_GREEN        (0xFFu<<8)
#define DMA2D_FGCLUT48_GREEN_0      (0x1u<<8)
#define DMA2D_FGCLUT48_BLUE         (0xFFu<<0)
#define DMA2D_FGCLUT48_BLUE_0       (0x1u<<0)

// FGCLUT49 Configuration

#define DMA2D_FGCLUT49_ALPHA        (0xFFu<<24)
#define DMA2D_FGCLUT49_ALPHA_0      (0x1u<<24)
#define DMA2D_FGCLUT49_RED          (0xFFu<<16)
#define DMA2D_FGCLUT49_RED_0        (0x1u<<16)
#define DMA2D_FGCLUT49_GREEN        (0xFFu<<8)
#define DMA2D_FGCLUT49_GREEN_0      (0x1u<<8)
#define DMA2D_FGCLUT49_BLUE         (0xFFu<<0)
#define DMA2D_FGCLUT49_BLUE_0       (0x1u<<0)

// FGCLUT50 Configuration

#define DMA2D_FGCLUT50_ALPHA        (0xFFu<<24)
#define DMA2D_FGCLUT50_ALPHA_0      (0x1u<<24)
#define DMA2D_FGCLUT50_RED          (0xFFu<<16)
#define DMA2D_FGCLUT50_RED_0        (0x1u<<16)
#define DMA2D_FGCLUT50_GREEN        (0xFFu<<8)
#define DMA2D_FGCLUT50_GREEN_0      (0x1u<<8)
#define DMA2D_FGCLUT50_BLUE         (0xFFu<<0)
#define DMA2D_FGCLUT50_BLUE_0       (0x1u<<0)

// FGCLUT51 Configuration

#define DMA2D_FGCLUT51_ALPHA        (0xFFu<<24)
#define DMA2D_FGCLUT51_ALPHA_0      (0x1u<<24)
#define DMA2D_FGCLUT51_RED          (0xFFu<<16)
#define DMA2D_FGCLUT51_RED_0        (0x1u<<16)
#define DMA2D_FGCLUT51_GREEN        (0xFFu<<8)
#define DMA2D_FGCLUT51_GREEN_0      (0x1u<<8)
#define DMA2D_FGCLUT51_BLUE         (0xFFu<<0)
#define DMA2D_FGCLUT51_BLUE_0       (0x1u<<0)

// FGCLUT52 Configuration

#define DMA2D_FGCLUT52_ALPHA        (0xFFu<<24)
#define DMA2D_FGCLUT52_ALPHA_0      (0x1u<<24)
#define DMA2D_FGCLUT52_RED          (0xFFu<<16)
#define DMA2D_FGCLUT52_RED_0        (0x1u<<16)
#define DMA2D_FGCLUT52_GREEN        (0xFFu<<8)
#define DMA2D_FGCLUT52_GREEN_0      (0x1u<<8)
#define DMA2D_FGCLUT52_BLUE         (0xFFu<<0)
#define DMA2D_FGCLUT52_BLUE_0       (0x1u<<0)

// FGCLUT53 Configuration

#define DMA2D_FGCLUT53_ALPHA        (0xFFu<<24)
#define DMA2D_FGCLUT53_ALPHA_0      (0x1u<<24)
#define DMA2D_FGCLUT53_RED          (0xFFu<<16)
#define DMA2D_FGCLUT53_RED_0        (0x1u<<16)
#define DMA2D_FGCLUT53_GREEN        (0xFFu<<8)
#define DMA2D_FGCLUT53_GREEN_0      (0x1u<<8)
#define DMA2D_FGCLUT53_BLUE         (0xFFu<<0)
#define DMA2D_FGCLUT53_BLUE_0       (0x1u<<0)

// FGCLUT54 Configuration

#define DMA2D_FGCLUT54_ALPHA        (0xFFu<<24)
#define DMA2D_FGCLUT54_ALPHA_0      (0x1u<<24)
#define DMA2D_FGCLUT54_RED          (0xFFu<<16)
#define DMA2D_FGCLUT54_RED_0        (0x1u<<16)
#define DMA2D_FGCLUT54_GREEN        (0xFFu<<8)
#define DMA2D_FGCLUT54_GREEN_0      (0x1u<<8)
#define DMA2D_FGCLUT54_BLUE         (0xFFu<<0)
#define DMA2D_FGCLUT54_BLUE_0       (0x1u<<0)

// FGCLUT55 Configuration

#define DMA2D_FGCLUT55_ALPHA        (0xFFu<<24)
#define DMA2D_FGCLUT55_ALPHA_0      (0x1u<<24)
#define DMA2D_FGCLUT55_RED          (0xFFu<<16)
#define DMA2D_FGCLUT55_RED_0        (0x1u<<16)
#define DMA2D_FGCLUT55_GREEN        (0xFFu<<8)
#define DMA2D_FGCLUT55_GREEN_0      (0x1u<<8)
#define DMA2D_FGCLUT55_BLUE         (0xFFu<<0)
#define DMA2D_FGCLUT55_BLUE_0       (0x1u<<0)

// FGCLUT56 Configuration

#define DMA2D_FGCLUT56_ALPHA        (0xFFu<<24)
#define DMA2D_FGCLUT56_ALPHA_0      (0x1u<<24)
#define DMA2D_FGCLUT56_RED          (0xFFu<<16)
#define DMA2D_FGCLUT56_RED_0        (0x1u<<16)
#define DMA2D_FGCLUT56_GREEN        (0xFFu<<8)
#define DMA2D_FGCLUT56_GREEN_0      (0x1u<<8)
#define DMA2D_FGCLUT56_BLUE         (0xFFu<<0)
#define DMA2D_FGCLUT56_BLUE_0       (0x1u<<0)

// FGCLUT57 Configuration

#define DMA2D_FGCLUT57_ALPHA        (0xFFu<<24)
#define DMA2D_FGCLUT57_ALPHA_0      (0x1u<<24)
#define DMA2D_FGCLUT57_RED          (0xFFu<<16)
#define DMA2D_FGCLUT57_RED_0        (0x1u<<16)
#define DMA2D_FGCLUT57_GREEN        (0xFFu<<8)
#define DMA2D_FGCLUT57_GREEN_0      (0x1u<<8)
#define DMA2D_FGCLUT57_BLUE         (0xFFu<<0)
#define DMA2D_FGCLUT57_BLUE_0       (0x1u<<0)

// FGCLUT58 Configuration

#define DMA2D_FGCLUT58_ALPHA        (0xFFu<<24)
#define DMA2D_FGCLUT58_ALPHA_0      (0x1u<<24)
#define DMA2D_FGCLUT58_RED          (0xFFu<<16)
#define DMA2D_FGCLUT58_RED_0        (0x1u<<16)
#define DMA2D_FGCLUT58_GREEN        (0xFFu<<8)
#define DMA2D_FGCLUT58_GREEN_0      (0x1u<<8)
#define DMA2D_FGCLUT58_BLUE         (0xFFu<<0)
#define DMA2D_FGCLUT58_BLUE_0       (0x1u<<0)

