Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_dma2d.h
// FGCLUT59 Configuration

#define DMA2D_FGCLUT59_ALPHA        (0xFFu<<24)
#define DMA2D_FGCLUT59_ALPHA_0      (0x1u<<24)
#define DMA2D_FGCLUT59_RED          (0xFFu<<16)
#define DMA2D_FGCLUT59_RED_0        (0x1u<<16)
#define DMA2D_FGCLUT59_GREEN        (0xFFu<<8)
#define DMA2D_FGCLUT59_GREEN_0      (0x1u<<8)
#define DMA2D_FGCLUT59_BLUE         (0xFFu<<0)
#define DMA2D_FGCLUT59_BLUE_0       (0x1u<<0)

// FGCLUT60 Configuration

#define DMA2D_FGCLUT60_ALPHA        (0xFFu<<24)
#define DMA2D_FGCLUT60_ALPHA_0      (0x1u<<24)
#define DMA2D_FGCLUT60_RED          (0xFFu<<16)
#define DMA2D_FGCLUT60_RED_0        (0x1u<<16)
#define DMA2D_FGCLUT60_GREEN        (0xFFu<<8)
#define DMA2D_FGCLUT60_GREEN_0      (0x1u<<8)
#define DMA2D_FGCLUT60_BLUE         (0xFFu<<0)
#define DMA2D_FGCLUT60_BLUE_0       (0x1u<<0)

// FGCLUT61 Configuration

#define DMA2D_FGCLUT61_ALPHA        (0xFFu<<24)
#define DMA2D_FGCLUT61_ALPHA_0      (0x1u<<24)
#define DMA2D_FGCLUT61_RED          (0xFFu<<16)
#define DMA2D_FGCLUT61_RED_0        (0x1u<<16)
#define DMA2D_FGCLUT61_GREEN        (0xFFu<<8)
#define DMA2D_FGCLUT61_GREEN_0      (0x1u<<8)
#define DMA2D_FGCLUT61_BLUE         (0xFFu<<0)
#define DMA2D_FGCLUT61_BLUE_0       (0x1u<<0)

// FGCLUT62 Configuration

#define DMA2D_FGCLUT62_ALPHA        (0xFFu<<24)
#define DMA2D_FGCLUT62_ALPHA_0      (0x1u<<24)
#define DMA2D_FGCLUT62_RED          (0xFFu<<16)
#define DMA2D_FGCLUT62_RED_0        (0x1u<<16)
#define DMA2D_FGCLUT62_GREEN        (0xFFu<<8)
#define DMA2D_FGCLUT62_GREEN_0      (0x1u<<8)
#define DMA2D_FGCLUT62_BLUE         (0xFFu<<0)
#define DMA2D_FGCLUT62_BLUE_0       (0x1u<<0)

// FGCLUT63 Configuration

#define DMA2D_FGCLUT63_ALPHA        (0xFFu<<24)
#define DMA2D_FGCLUT63_ALPHA_0      (0x1u<<24)
#define DMA2D_FGCLUT63_RED          (0xFFu<<16)
#define DMA2D_FGCLUT63_RED_0        (0x1u<<16)
#define DMA2D_FGCLUT63_GREEN        (0xFFu<<8)
#define DMA2D_FGCLUT63_GREEN_0      (0x1u<<8)
#define DMA2D_FGCLUT63_BLUE         (0xFFu<<0)
#define DMA2D_FGCLUT63_BLUE_0       (0x1u<<0)

// FGCLUT64 Configuration

#define DMA2D_FGCLUT64_ALPHA        (0xFFu<<24)
#define DMA2D_FGCLUT64_ALPHA_0      (0x1u<<24)
#define DMA2D_FGCLUT64_RED          (0xFFu<<16)
#define DMA2D_FGCLUT64_RED_0        (0x1u<<16)
#define DMA2D_FGCLUT64_GREEN        (0xFFu<<8)
#define DMA2D_FGCLUT64_GREEN_0      (0x1u<<8)
#define DMA2D_FGCLUT64_BLUE         (0xFFu<<0)
#define DMA2D_FGCLUT64_BLUE_0       (0x1u<<0)

// FGCLUT65 Configuration

#define DMA2D_FGCLUT65_ALPHA        (0xFFu<<24)
#define DMA2D_FGCLUT65_ALPHA_0      (0x1u<<24)
#define DMA2D_FGCLUT65_RED          (0xFFu<<16)
#define DMA2D_FGCLUT65_RED_0        (0x1u<<16)
#define DMA2D_FGCLUT65_GREEN        (0xFFu<<8)
#define DMA2D_FGCLUT65_GREEN_0      (0x1u<<8)
#define DMA2D_FGCLUT65_BLUE         (0xFFu<<0)
#define DMA2D_FGCLUT65_BLUE_0       (0x1u<<0)

// FGCLUT66 Configuration

#define DMA2D_FGCLUT66_ALPHA        (0xFFu<<24)
#define DMA2D_FGCLUT66_ALPHA_0      (0x1u<<24)
#define DMA2D_FGCLUT66_RED          (0xFFu<<16)
#define DMA2D_FGCLUT66_RED_0        (0x1u<<16)
#define DMA2D_FGCLUT66_GREEN        (0xFFu<<8)
#define DMA2D_FGCLUT66_GREEN_0      (0x1u<<8)
#define DMA2D_FGCLUT66_BLUE         (0xFFu<<0)
#define DMA2D_FGCLUT66_BLUE_0       (0x1u<<0)

// FGCLUT67 Configuration

#define DMA2D_FGCLUT67_ALPHA        (0xFFu<<24)
#define DMA2D_FGCLUT67_ALPHA_0      (0x1u<<24)
#define DMA2D_FGCLUT67_RED          (0xFFu<<16)
#define DMA2D_FGCLUT67_RED_0        (0x1u<<16)
#define DMA2D_FGCLUT67_GREEN        (0xFFu<<8)
#define DMA2D_FGCLUT67_GREEN_0      (0x1u<<8)
#define DMA2D_FGCLUT67_BLUE         (0xFFu<<0)
#define DMA2D_FGCLUT67_BLUE_0       (0x1u<<0)

// FGCLUT68 Configuration

#define DMA2D_FGCLUT68_ALPHA        (0xFFu<<24)
#define DMA2D_FGCLUT68_ALPHA_0      (0x1u<<24)
#define DMA2D_FGCLUT68_RED          (0xFFu<<16)
#define DMA2D_FGCLUT68_RED_0        (0x1u<<16)
#define DMA2D_FGCLUT68_GREEN        (0xFFu<<8)
#define DMA2D_FGCLUT68_GREEN_0      (0x1u<<8)
#define DMA2D_FGCLUT68_BLUE         (0xFFu<<0)
#define DMA2D_FGCLUT68_BLUE_0       (0x1u<<0)

// FGCLUT69 Configuration

#define DMA2D_FGCLUT69_ALPHA        (0xFFu<<24)
#define DMA2D_FGCLUT69_ALPHA_0      (0x1u<<24)
#define DMA2D_FGCLUT69_RED          (0xFFu<<16)
#define DMA2D_FGCLUT69_RED_0        (0x1u<<16)
#define DMA2D_FGCLUT69_GREEN        (0xFFu<<8)
#define DMA2D_FGCLUT69_GREEN_0      (0x1u<<8)
#define DMA2D_FGCLUT69_BLUE         (0xFFu<<0)
#define DMA2D_FGCLUT69_BLUE_0       (0x1u<<0)

// FGCLUT70 Configuration

#define DMA2D_FGCLUT70_ALPHA        (0xFFu<<24)
#define DMA2D_FGCLUT70_ALPHA_0      (0x1u<<24)
#define DMA2D_FGCLUT70_RED          (0xFFu<<16)
#define DMA2D_FGCLUT70_RED_0        (0x1u<<16)
#define DMA2D_FGCLUT70_GREEN        (0xFFu<<8)
#define DMA2D_FGCLUT70_GREEN_0      (0x1u<<8)
#define DMA2D_FGCLUT70_BLUE         (0xFFu<<0)
#define DMA2D_FGCLUT70_BLUE_0       (0x1u<<0)

// FGCLUT71 Configuration

#define DMA2D_FGCLUT71_ALPHA        (0xFFu<<24)
#define DMA2D_FGCLUT71_ALPHA_0      (0x1u<<24)
#define DMA2D_FGCLUT71_RED          (0xFFu<<16)
#define DMA2D_FGCLUT71_RED_0        (0x1u<<16)
#define DMA2D_FGCLUT71_GREEN        (0xFFu<<8)
#define DMA2D_FGCLUT71_GREEN_0      (0x1u<<8)
#define DMA2D_FGCLUT71_BLUE         (0xFFu<<0)
#define DMA2D_FGCLUT71_BLUE_0       (0x1u<<0)

// FGCLUT72 Configuration

#define DMA2D_FGCLUT72_ALPHA        (0xFFu<<24)
#define DMA2D_FGCLUT72_ALPHA_0      (0x1u<<24)
#define DMA2D_FGCLUT72_RED          (0xFFu<<16)
#define DMA2D_FGCLUT72_RED_0        (0x1u<<16)
#define DMA2D_FGCLUT72_GREEN        (0xFFu<<8)
#define DMA2D_FGCLUT72_GREEN_0      (0x1u<<8)
#define DMA2D_FGCLUT72_BLUE         (0xFFu<<0)
#define DMA2D_FGCLUT72_BLUE_0       (0x1u<<0)

// FGCLUT73 Configuration

#define DMA2D_FGCLUT73_ALPHA        (0xFFu<<24)
#define DMA2D_FGCLUT73_ALPHA_0      (0x1u<<24)
#define DMA2D_FGCLUT73_RED          (0xFFu<<16)
#define DMA2D_FGCLUT73_RED_0        (0x1u<<16)
#define DMA2D_FGCLUT73_GREEN        (0xFFu<<8)
#define DMA2D_FGCLUT73_GREEN_0      (0x1u<<8)
#define DMA2D_FGCLUT73_BLUE         (0xFFu<<0)
#define DMA2D_FGCLUT73_BLUE_0       (0x1u<<0)

// FGCLUT74 Configuration

#define DMA2D_FGCLUT74_ALPHA        (0xFFu<<24)
#define DMA2D_FGCLUT74_ALPHA_0      (0x1u<<24)
#define DMA2D_FGCLUT74_RED          (0xFFu<<16)
#define DMA2D_FGCLUT74_RED_0        (0x1u<<16)
#define DMA2D_FGCLUT74_GREEN        (0xFFu<<8)
#define DMA2D_FGCLUT74_GREEN_0      (0x1u<<8)
#define DMA2D_FGCLUT74_BLUE         (0xFFu<<0)
#define DMA2D_FGCLUT74_BLUE_0       (0x1u<<0)

// FGCLUT75 Configuration

