Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_dma2d.h
#define DMA2D_FGCLUT75_ALPHA        (0xFFu<<24)
#define DMA2D_FGCLUT75_ALPHA_0      (0x1u<<24)
#define DMA2D_FGCLUT75_RED          (0xFFu<<16)
#define DMA2D_FGCLUT75_RED_0        (0x1u<<16)
#define DMA2D_FGCLUT75_GREEN        (0xFFu<<8)
#define DMA2D_FGCLUT75_GREEN_0      (0x1u<<8)
#define DMA2D_FGCLUT75_BLUE         (0xFFu<<0)
#define DMA2D_FGCLUT75_BLUE_0       (0x1u<<0)

// FGCLUT76 Configuration

#define DMA2D_FGCLUT76_ALPHA        (0xFFu<<24)
#define DMA2D_FGCLUT76_ALPHA_0      (0x1u<<24)
#define DMA2D_FGCLUT76_RED          (0xFFu<<16)
#define DMA2D_FGCLUT76_RED_0        (0x1u<<16)
#define DMA2D_FGCLUT76_GREEN        (0xFFu<<8)
#define DMA2D_FGCLUT76_GREEN_0      (0x1u<<8)
#define DMA2D_FGCLUT76_BLUE         (0xFFu<<0)
#define DMA2D_FGCLUT76_BLUE_0       (0x1u<<0)

// FGCLUT77 Configuration

#define DMA2D_FGCLUT77_ALPHA        (0xFFu<<24)
#define DMA2D_FGCLUT77_ALPHA_0      (0x1u<<24)
#define DMA2D_FGCLUT77_RED          (0xFFu<<16)
#define DMA2D_FGCLUT77_RED_0        (0x1u<<16)
#define DMA2D_FGCLUT77_GREEN        (0xFFu<<8)
#define DMA2D_FGCLUT77_GREEN_0      (0x1u<<8)
#define DMA2D_FGCLUT77_BLUE         (0xFFu<<0)
#define DMA2D_FGCLUT77_BLUE_0       (0x1u<<0)

// FGCLUT78 Configuration

#define DMA2D_FGCLUT78_ALPHA        (0xFFu<<24)
#define DMA2D_FGCLUT78_ALPHA_0      (0x1u<<24)
#define DMA2D_FGCLUT78_RED          (0xFFu<<16)
#define DMA2D_FGCLUT78_RED_0        (0x1u<<16)
#define DMA2D_FGCLUT78_GREEN        (0xFFu<<8)
#define DMA2D_FGCLUT78_GREEN_0      (0x1u<<8)
#define DMA2D_FGCLUT78_BLUE         (0xFFu<<0)
#define DMA2D_FGCLUT78_BLUE_0       (0x1u<<0)

// FGCLUT79 Configuration

#define DMA2D_FGCLUT79_ALPHA        (0xFFu<<24)
#define DMA2D_FGCLUT79_ALPHA_0      (0x1u<<24)
#define DMA2D_FGCLUT79_RED          (0xFFu<<16)
#define DMA2D_FGCLUT79_RED_0        (0x1u<<16)
#define DMA2D_FGCLUT79_GREEN        (0xFFu<<8)
#define DMA2D_FGCLUT79_GREEN_0      (0x1u<<8)
#define DMA2D_FGCLUT79_BLUE         (0xFFu<<0)
#define DMA2D_FGCLUT79_BLUE_0       (0x1u<<0)

// FGCLUT80 Configuration

#define DMA2D_FGCLUT80_ALPHA        (0xFFu<<24)
#define DMA2D_FGCLUT80_ALPHA_0      (0x1u<<24)
#define DMA2D_FGCLUT80_RED          (0xFFu<<16)
#define DMA2D_FGCLUT80_RED_0        (0x1u<<16)
#define DMA2D_FGCLUT80_GREEN        (0xFFu<<8)
#define DMA2D_FGCLUT80_GREEN_0      (0x1u<<8)
#define DMA2D_FGCLUT80_BLUE         (0xFFu<<0)
#define DMA2D_FGCLUT80_BLUE_0       (0x1u<<0)

// FGCLUT81 Configuration

#define DMA2D_FGCLUT81_ALPHA        (0xFFu<<24)
#define DMA2D_FGCLUT81_ALPHA_0      (0x1u<<24)
#define DMA2D_FGCLUT81_RED          (0xFFu<<16)
#define DMA2D_FGCLUT81_RED_0        (0x1u<<16)
#define DMA2D_FGCLUT81_GREEN        (0xFFu<<8)
#define DMA2D_FGCLUT81_GREEN_0      (0x1u<<8)
#define DMA2D_FGCLUT81_BLUE         (0xFFu<<0)
#define DMA2D_FGCLUT81_BLUE_0       (0x1u<<0)

// FGCLUT82 Configuration

#define DMA2D_FGCLUT82_ALPHA        (0xFFu<<24)
#define DMA2D_FGCLUT82_ALPHA_0      (0x1u<<24)
#define DMA2D_FGCLUT82_RED          (0xFFu<<16)
#define DMA2D_FGCLUT82_RED_0        (0x1u<<16)
#define DMA2D_FGCLUT82_GREEN        (0xFFu<<8)
#define DMA2D_FGCLUT82_GREEN_0      (0x1u<<8)
#define DMA2D_FGCLUT82_BLUE         (0xFFu<<0)
#define DMA2D_FGCLUT82_BLUE_0       (0x1u<<0)

// FGCLUT83 Configuration

#define DMA2D_FGCLUT83_ALPHA        (0xFFu<<24)
#define DMA2D_FGCLUT83_ALPHA_0      (0x1u<<24)
#define DMA2D_FGCLUT83_RED          (0xFFu<<16)
#define DMA2D_FGCLUT83_RED_0        (0x1u<<16)
#define DMA2D_FGCLUT83_GREEN        (0xFFu<<8)
#define DMA2D_FGCLUT83_GREEN_0      (0x1u<<8)
#define DMA2D_FGCLUT83_BLUE         (0xFFu<<0)
#define DMA2D_FGCLUT83_BLUE_0       (0x1u<<0)

// FGCLUT84 Configuration

#define DMA2D_FGCLUT84_ALPHA        (0xFFu<<24)
#define DMA2D_FGCLUT84_ALPHA_0      (0x1u<<24)
#define DMA2D_FGCLUT84_RED          (0xFFu<<16)
#define DMA2D_FGCLUT84_RED_0        (0x1u<<16)
#define DMA2D_FGCLUT84_GREEN        (0xFFu<<8)
#define DMA2D_FGCLUT84_GREEN_0      (0x1u<<8)
#define DMA2D_FGCLUT84_BLUE         (0xFFu<<0)
#define DMA2D_FGCLUT84_BLUE_0       (0x1u<<0)

// FGCLUT85 Configuration

#define DMA2D_FGCLUT85_ALPHA        (0xFFu<<24)
#define DMA2D_FGCLUT85_ALPHA_0      (0x1u<<24)
#define DMA2D_FGCLUT85_RED          (0xFFu<<16)
#define DMA2D_FGCLUT85_RED_0        (0x1u<<16)
#define DMA2D_FGCLUT85_GREEN        (0xFFu<<8)
#define DMA2D_FGCLUT85_GREEN_0      (0x1u<<8)
#define DMA2D_FGCLUT85_BLUE         (0xFFu<<0)
#define DMA2D_FGCLUT85_BLUE_0       (0x1u<<0)

// FGCLUT86 Configuration

#define DMA2D_FGCLUT86_ALPHA        (0xFFu<<24)
#define DMA2D_FGCLUT86_ALPHA_0      (0x1u<<24)
#define DMA2D_FGCLUT86_RED          (0xFFu<<16)
#define DMA2D_FGCLUT86_RED_0        (0x1u<<16)
#define DMA2D_FGCLUT86_GREEN        (0xFFu<<8)
#define DMA2D_FGCLUT86_GREEN_0      (0x1u<<8)
#define DMA2D_FGCLUT86_BLUE         (0xFFu<<0)
#define DMA2D_FGCLUT86_BLUE_0       (0x1u<<0)

// FGCLUT87 Configuration

#define DMA2D_FGCLUT87_ALPHA        (0xFFu<<24)
#define DMA2D_FGCLUT87_ALPHA_0      (0x1u<<24)
#define DMA2D_FGCLUT87_RED          (0xFFu<<16)
#define DMA2D_FGCLUT87_RED_0        (0x1u<<16)
#define DMA2D_FGCLUT87_GREEN        (0xFFu<<8)
#define DMA2D_FGCLUT87_GREEN_0      (0x1u<<8)
#define DMA2D_FGCLUT87_BLUE         (0xFFu<<0)
#define DMA2D_FGCLUT87_BLUE_0       (0x1u<<0)

// FGCLUT88 Configuration

#define DMA2D_FGCLUT88_ALPHA        (0xFFu<<24)
#define DMA2D_FGCLUT88_ALPHA_0      (0x1u<<24)
#define DMA2D_FGCLUT88_RED          (0xFFu<<16)
#define DMA2D_FGCLUT88_RED_0        (0x1u<<16)
#define DMA2D_FGCLUT88_GREEN        (0xFFu<<8)
#define DMA2D_FGCLUT88_GREEN_0      (0x1u<<8)
#define DMA2D_FGCLUT88_BLUE         (0xFFu<<0)
#define DMA2D_FGCLUT88_BLUE_0       (0x1u<<0)

// FGCLUT89 Configuration

#define DMA2D_FGCLUT89_ALPHA        (0xFFu<<24)
#define DMA2D_FGCLUT89_ALPHA_0      (0x1u<<24)
#define DMA2D_FGCLUT89_RED          (0xFFu<<16)
#define DMA2D_FGCLUT89_RED_0        (0x1u<<16)
#define DMA2D_FGCLUT89_GREEN        (0xFFu<<8)
#define DMA2D_FGCLUT89_GREEN_0      (0x1u<<8)
#define DMA2D_FGCLUT89_BLUE         (0xFFu<<0)
#define DMA2D_FGCLUT89_BLUE_0       (0x1u<<0)

// FGCLUT90 Configuration

