Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_dma2d.h
#define DMA2D_FGCLUT105_ALPHA       (0xFFu<<24)
#define DMA2D_FGCLUT105_ALPHA_0     (0x1u<<24)
#define DMA2D_FGCLUT105_RED         (0xFFu<<16)
#define DMA2D_FGCLUT105_RED_0       (0x1u<<16)
#define DMA2D_FGCLUT105_GREEN       (0xFFu<<8)
#define DMA2D_FGCLUT105_GREEN_0     (0x1u<<8)
#define DMA2D_FGCLUT105_BLUE        (0xFFu<<0)
#define DMA2D_FGCLUT105_BLUE_0      (0x1u<<0)

// FGCLUT106 Configuration

#define DMA2D_FGCLUT106_ALPHA       (0xFFu<<24)
#define DMA2D_FGCLUT106_ALPHA_0     (0x1u<<24)
#define DMA2D_FGCLUT106_RED         (0xFFu<<16)
#define DMA2D_FGCLUT106_RED_0       (0x1u<<16)
#define DMA2D_FGCLUT106_GREEN       (0xFFu<<8)
#define DMA2D_FGCLUT106_GREEN_0     (0x1u<<8)
#define DMA2D_FGCLUT106_BLUE        (0xFFu<<0)
#define DMA2D_FGCLUT106_BLUE_0      (0x1u<<0)

// FGCLUT107 Configuration

#define DMA2D_FGCLUT107_ALPHA       (0xFFu<<24)
#define DMA2D_FGCLUT107_ALPHA_0     (0x1u<<24)
#define DMA2D_FGCLUT107_RED         (0xFFu<<16)
#define DMA2D_FGCLUT107_RED_0       (0x1u<<16)
#define DMA2D_FGCLUT107_GREEN       (0xFFu<<8)
#define DMA2D_FGCLUT107_GREEN_0     (0x1u<<8)
#define DMA2D_FGCLUT107_BLUE        (0xFFu<<0)
#define DMA2D_FGCLUT107_BLUE_0      (0x1u<<0)

// FGCLUT108 Configuration

#define DMA2D_FGCLUT108_ALPHA       (0xFFu<<24)
#define DMA2D_FGCLUT108_ALPHA_0     (0x1u<<24)
#define DMA2D_FGCLUT108_RED         (0xFFu<<16)
#define DMA2D_FGCLUT108_RED_0       (0x1u<<16)
#define DMA2D_FGCLUT108_GREEN       (0xFFu<<8)
#define DMA2D_FGCLUT108_GREEN_0     (0x1u<<8)
#define DMA2D_FGCLUT108_BLUE        (0xFFu<<0)
#define DMA2D_FGCLUT108_BLUE_0      (0x1u<<0)

// FGCLUT109 Configuration

#define DMA2D_FGCLUT109_ALPHA       (0xFFu<<24)
#define DMA2D_FGCLUT109_ALPHA_0     (0x1u<<24)
#define DMA2D_FGCLUT109_RED         (0xFFu<<16)
#define DMA2D_FGCLUT109_RED_0       (0x1u<<16)
#define DMA2D_FGCLUT109_GREEN       (0xFFu<<8)
#define DMA2D_FGCLUT109_GREEN_0     (0x1u<<8)
#define DMA2D_FGCLUT109_BLUE        (0xFFu<<0)
#define DMA2D_FGCLUT109_BLUE_0      (0x1u<<0)

// FGCLUT110 Configuration

#define DMA2D_FGCLUT110_ALPHA       (0xFFu<<24)
#define DMA2D_FGCLUT110_ALPHA_0     (0x1u<<24)
#define DMA2D_FGCLUT110_RED         (0xFFu<<16)
#define DMA2D_FGCLUT110_RED_0       (0x1u<<16)
#define DMA2D_FGCLUT110_GREEN       (0xFFu<<8)
#define DMA2D_FGCLUT110_GREEN_0     (0x1u<<8)
#define DMA2D_FGCLUT110_BLUE        (0xFFu<<0)
#define DMA2D_FGCLUT110_BLUE_0      (0x1u<<0)

// FGCLUT111 Configuration

#define DMA2D_FGCLUT111_ALPHA       (0xFFu<<24)
#define DMA2D_FGCLUT111_ALPHA_0     (0x1u<<24)
#define DMA2D_FGCLUT111_RED         (0xFFu<<16)
#define DMA2D_FGCLUT111_RED_0       (0x1u<<16)
#define DMA2D_FGCLUT111_GREEN       (0xFFu<<8)
#define DMA2D_FGCLUT111_GREEN_0     (0x1u<<8)
#define DMA2D_FGCLUT111_BLUE        (0xFFu<<0)
#define DMA2D_FGCLUT111_BLUE_0      (0x1u<<0)

// FGCLUT112 Configuration

#define DMA2D_FGCLUT112_ALPHA       (0xFFu<<24)
#define DMA2D_FGCLUT112_ALPHA_0     (0x1u<<24)
#define DMA2D_FGCLUT112_RED         (0xFFu<<16)
#define DMA2D_FGCLUT112_RED_0       (0x1u<<16)
#define DMA2D_FGCLUT112_GREEN       (0xFFu<<8)
#define DMA2D_FGCLUT112_GREEN_0     (0x1u<<8)
#define DMA2D_FGCLUT112_BLUE        (0xFFu<<0)
#define DMA2D_FGCLUT112_BLUE_0      (0x1u<<0)

// FGCLUT113 Configuration

#define DMA2D_FGCLUT113_ALPHA       (0xFFu<<24)
#define DMA2D_FGCLUT113_ALPHA_0     (0x1u<<24)
#define DMA2D_FGCLUT113_RED         (0xFFu<<16)
#define DMA2D_FGCLUT113_RED_0       (0x1u<<16)
#define DMA2D_FGCLUT113_GREEN       (0xFFu<<8)
#define DMA2D_FGCLUT113_GREEN_0     (0x1u<<8)
#define DMA2D_FGCLUT113_BLUE        (0xFFu<<0)
#define DMA2D_FGCLUT113_BLUE_0      (0x1u<<0)

// FGCLUT114 Configuration

#define DMA2D_FGCLUT114_ALPHA       (0xFFu<<24)
#define DMA2D_FGCLUT114_ALPHA_0     (0x1u<<24)
#define DMA2D_FGCLUT114_RED         (0xFFu<<16)
#define DMA2D_FGCLUT114_RED_0       (0x1u<<16)
#define DMA2D_FGCLUT114_GREEN       (0xFFu<<8)
#define DMA2D_FGCLUT114_GREEN_0     (0x1u<<8)
#define DMA2D_FGCLUT114_BLUE        (0xFFu<<0)
#define DMA2D_FGCLUT114_BLUE_0      (0x1u<<0)

// FGCLUT115 Configuration

#define DMA2D_FGCLUT115_ALPHA       (0xFFu<<24)
#define DMA2D_FGCLUT115_ALPHA_0     (0x1u<<24)
#define DMA2D_FGCLUT115_RED         (0xFFu<<16)
#define DMA2D_FGCLUT115_RED_0       (0x1u<<16)
#define DMA2D_FGCLUT115_GREEN       (0xFFu<<8)
#define DMA2D_FGCLUT115_GREEN_0     (0x1u<<8)
#define DMA2D_FGCLUT115_BLUE        (0xFFu<<0)
#define DMA2D_FGCLUT115_BLUE_0      (0x1u<<0)

// FGCLUT116 Configuration

#define DMA2D_FGCLUT116_ALPHA       (0xFFu<<24)
#define DMA2D_FGCLUT116_ALPHA_0     (0x1u<<24)
#define DMA2D_FGCLUT116_RED         (0xFFu<<16)
#define DMA2D_FGCLUT116_RED_0       (0x1u<<16)
#define DMA2D_FGCLUT116_GREEN       (0xFFu<<8)
#define DMA2D_FGCLUT116_GREEN_0     (0x1u<<8)
#define DMA2D_FGCLUT116_BLUE        (0xFFu<<0)
#define DMA2D_FGCLUT116_BLUE_0      (0x1u<<0)

// FGCLUT117 Configuration

#define DMA2D_FGCLUT117_ALPHA       (0xFFu<<24)
#define DMA2D_FGCLUT117_ALPHA_0     (0x1u<<24)
#define DMA2D_FGCLUT117_RED         (0xFFu<<16)
#define DMA2D_FGCLUT117_RED_0       (0x1u<<16)
#define DMA2D_FGCLUT117_GREEN       (0xFFu<<8)
#define DMA2D_FGCLUT117_GREEN_0     (0x1u<<8)
#define DMA2D_FGCLUT117_BLUE        (0xFFu<<0)
#define DMA2D_FGCLUT117_BLUE_0      (0x1u<<0)

// FGCLUT118 Configuration

#define DMA2D_FGCLUT118_ALPHA       (0xFFu<<24)
#define DMA2D_FGCLUT118_ALPHA_0     (0x1u<<24)
#define DMA2D_FGCLUT118_RED         (0xFFu<<16)
#define DMA2D_FGCLUT118_RED_0       (0x1u<<16)
#define DMA2D_FGCLUT118_GREEN       (0xFFu<<8)
#define DMA2D_FGCLUT118_GREEN_0     (0x1u<<8)
#define DMA2D_FGCLUT118_BLUE        (0xFFu<<0)
#define DMA2D_FGCLUT118_BLUE_0      (0x1u<<0)

// FGCLUT119 Configuration

#define DMA2D_FGCLUT119_ALPHA       (0xFFu<<24)
#define DMA2D_FGCLUT119_ALPHA_0     (0x1u<<24)
#define DMA2D_FGCLUT119_RED         (0xFFu<<16)
#define DMA2D_FGCLUT119_RED_0       (0x1u<<16)
#define DMA2D_FGCLUT119_GREEN       (0xFFu<<8)
#define DMA2D_FGCLUT119_GREEN_0     (0x1u<<8)
#define DMA2D_FGCLUT119_BLUE        (0xFFu<<0)
#define DMA2D_FGCLUT119_BLUE_0      (0x1u<<0)

// FGCLUT120 Configuration

#define DMA2D_FGCLUT120_ALPHA       (0xFFu<<24)
#define DMA2D_FGCLUT120_ALPHA_0     (0x1u<<24)
#define DMA2D_FGCLUT120_RED         (0xFFu<<16)
#define DMA2D_FGCLUT120_RED_0       (0x1u<<16)
#define DMA2D_FGCLUT120_GREEN       (0xFFu<<8)
#define DMA2D_FGCLUT120_GREEN_0     (0x1u<<8)
#define DMA2D_FGCLUT120_BLUE        (0xFFu<<0)
#define DMA2D_FGCLUT120_BLUE_0      (0x1u<<0)

// FGCLUT121 Configuration

