Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_dma2d.h
#define DMA2D_FGCLUT121_ALPHA       (0xFFu<<24)
#define DMA2D_FGCLUT121_ALPHA_0     (0x1u<<24)
#define DMA2D_FGCLUT121_RED         (0xFFu<<16)
#define DMA2D_FGCLUT121_RED_0       (0x1u<<16)
#define DMA2D_FGCLUT121_GREEN       (0xFFu<<8)
#define DMA2D_FGCLUT121_GREEN_0     (0x1u<<8)
#define DMA2D_FGCLUT121_BLUE        (0xFFu<<0)
#define DMA2D_FGCLUT121_BLUE_0      (0x1u<<0)

// FGCLUT122 Configuration

#define DMA2D_FGCLUT122_ALPHA       (0xFFu<<24)
#define DMA2D_FGCLUT122_ALPHA_0     (0x1u<<24)
#define DMA2D_FGCLUT122_RED         (0xFFu<<16)
#define DMA2D_FGCLUT122_RED_0       (0x1u<<16)
#define DMA2D_FGCLUT122_GREEN       (0xFFu<<8)
#define DMA2D_FGCLUT122_GREEN_0     (0x1u<<8)
#define DMA2D_FGCLUT122_BLUE        (0xFFu<<0)
#define DMA2D_FGCLUT122_BLUE_0      (0x1u<<0)

// FGCLUT123 Configuration

#define DMA2D_FGCLUT123_ALPHA       (0xFFu<<24)
#define DMA2D_FGCLUT123_ALPHA_0     (0x1u<<24)
#define DMA2D_FGCLUT123_RED         (0xFFu<<16)
#define DMA2D_FGCLUT123_RED_0       (0x1u<<16)
#define DMA2D_FGCLUT123_GREEN       (0xFFu<<8)
#define DMA2D_FGCLUT123_GREEN_0     (0x1u<<8)
#define DMA2D_FGCLUT123_BLUE        (0xFFu<<0)
#define DMA2D_FGCLUT123_BLUE_0      (0x1u<<0)

// FGCLUT124 Configuration

#define DMA2D_FGCLUT124_ALPHA       (0xFFu<<24)
#define DMA2D_FGCLUT124_ALPHA_0     (0x1u<<24)
#define DMA2D_FGCLUT124_RED         (0xFFu<<16)
#define DMA2D_FGCLUT124_RED_0       (0x1u<<16)
#define DMA2D_FGCLUT124_GREEN       (0xFFu<<8)
#define DMA2D_FGCLUT124_GREEN_0     (0x1u<<8)
#define DMA2D_FGCLUT124_BLUE        (0xFFu<<0)
#define DMA2D_FGCLUT124_BLUE_0      (0x1u<<0)

// FGCLUT125 Configuration

#define DMA2D_FGCLUT125_ALPHA       (0xFFu<<24)
#define DMA2D_FGCLUT125_ALPHA_0     (0x1u<<24)
#define DMA2D_FGCLUT125_RED         (0xFFu<<16)
#define DMA2D_FGCLUT125_RED_0       (0x1u<<16)
#define DMA2D_FGCLUT125_GREEN       (0xFFu<<8)
#define DMA2D_FGCLUT125_GREEN_0     (0x1u<<8)
#define DMA2D_FGCLUT125_BLUE        (0xFFu<<0)
#define DMA2D_FGCLUT125_BLUE_0      (0x1u<<0)

// FGCLUT126 Configuration

#define DMA2D_FGCLUT126_ALPHA       (0xFFu<<24)
#define DMA2D_FGCLUT126_ALPHA_0     (0x1u<<24)
#define DMA2D_FGCLUT126_RED         (0xFFu<<16)
#define DMA2D_FGCLUT126_RED_0       (0x1u<<16)
#define DMA2D_FGCLUT126_GREEN       (0xFFu<<8)
#define DMA2D_FGCLUT126_GREEN_0     (0x1u<<8)
#define DMA2D_FGCLUT126_BLUE        (0xFFu<<0)
#define DMA2D_FGCLUT126_BLUE_0      (0x1u<<0)

// FGCLUT127 Configuration

#define DMA2D_FGCLUT127_ALPHA       (0xFFu<<24)
#define DMA2D_FGCLUT127_ALPHA_0     (0x1u<<24)
#define DMA2D_FGCLUT127_RED         (0xFFu<<16)
#define DMA2D_FGCLUT127_RED_0       (0x1u<<16)
#define DMA2D_FGCLUT127_GREEN       (0xFFu<<8)
#define DMA2D_FGCLUT127_GREEN_0     (0x1u<<8)
#define DMA2D_FGCLUT127_BLUE        (0xFFu<<0)
#define DMA2D_FGCLUT127_BLUE_0      (0x1u<<0)

// FGCLUT128 Configuration

#define DMA2D_FGCLUT128_ALPHA       (0xFFu<<24)
#define DMA2D_FGCLUT128_ALPHA_0     (0x1u<<24)
#define DMA2D_FGCLUT128_RED         (0xFFu<<16)
#define DMA2D_FGCLUT128_RED_0       (0x1u<<16)
#define DMA2D_FGCLUT128_GREEN       (0xFFu<<8)
#define DMA2D_FGCLUT128_GREEN_0     (0x1u<<8)
#define DMA2D_FGCLUT128_BLUE        (0xFFu<<0)
#define DMA2D_FGCLUT128_BLUE_0      (0x1u<<0)

// FGCLUT129 Configuration

#define DMA2D_FGCLUT129_ALPHA       (0xFFu<<24)
#define DMA2D_FGCLUT129_ALPHA_0     (0x1u<<24)
#define DMA2D_FGCLUT129_RED         (0xFFu<<16)
#define DMA2D_FGCLUT129_RED_0       (0x1u<<16)
#define DMA2D_FGCLUT129_GREEN       (0xFFu<<8)
#define DMA2D_FGCLUT129_GREEN_0     (0x1u<<8)
#define DMA2D_FGCLUT129_BLUE        (0xFFu<<0)
#define DMA2D_FGCLUT129_BLUE_0      (0x1u<<0)

// FGCLUT130 Configuration

#define DMA2D_FGCLUT130_ALPHA       (0xFFu<<24)
#define DMA2D_FGCLUT130_ALPHA_0     (0x1u<<24)
#define DMA2D_FGCLUT130_RED         (0xFFu<<16)
#define DMA2D_FGCLUT130_RED_0       (0x1u<<16)
#define DMA2D_FGCLUT130_GREEN       (0xFFu<<8)
#define DMA2D_FGCLUT130_GREEN_0     (0x1u<<8)
#define DMA2D_FGCLUT130_BLUE        (0xFFu<<0)
#define DMA2D_FGCLUT130_BLUE_0      (0x1u<<0)

// FGCLUT131 Configuration

#define DMA2D_FGCLUT131_ALPHA       (0xFFu<<24)
#define DMA2D_FGCLUT131_ALPHA_0     (0x1u<<24)
#define DMA2D_FGCLUT131_RED         (0xFFu<<16)
#define DMA2D_FGCLUT131_RED_0       (0x1u<<16)
#define DMA2D_FGCLUT131_GREEN       (0xFFu<<8)
#define DMA2D_FGCLUT131_GREEN_0     (0x1u<<8)
#define DMA2D_FGCLUT131_BLUE        (0xFFu<<0)
#define DMA2D_FGCLUT131_BLUE_0      (0x1u<<0)

// FGCLUT132 Configuration

#define DMA2D_FGCLUT132_ALPHA       (0xFFu<<24)
#define DMA2D_FGCLUT132_ALPHA_0     (0x1u<<24)
#define DMA2D_FGCLUT132_RED         (0xFFu<<16)
#define DMA2D_FGCLUT132_RED_0       (0x1u<<16)
#define DMA2D_FGCLUT132_GREEN       (0xFFu<<8)
#define DMA2D_FGCLUT132_GREEN_0     (0x1u<<8)
#define DMA2D_FGCLUT132_BLUE        (0xFFu<<0)
#define DMA2D_FGCLUT132_BLUE_0      (0x1u<<0)

// FGCLUT133 Configuration

#define DMA2D_FGCLUT133_ALPHA       (0xFFu<<24)
#define DMA2D_FGCLUT133_ALPHA_0     (0x1u<<24)
#define DMA2D_FGCLUT133_RED         (0xFFu<<16)
#define DMA2D_FGCLUT133_RED_0       (0x1u<<16)
#define DMA2D_FGCLUT133_GREEN       (0xFFu<<8)
#define DMA2D_FGCLUT133_GREEN_0     (0x1u<<8)
#define DMA2D_FGCLUT133_BLUE        (0xFFu<<0)
#define DMA2D_FGCLUT133_BLUE_0      (0x1u<<0)

// FGCLUT134 Configuration

#define DMA2D_FGCLUT134_ALPHA       (0xFFu<<24)
#define DMA2D_FGCLUT134_ALPHA_0     (0x1u<<24)
#define DMA2D_FGCLUT134_RED         (0xFFu<<16)
#define DMA2D_FGCLUT134_RED_0       (0x1u<<16)
#define DMA2D_FGCLUT134_GREEN       (0xFFu<<8)
#define DMA2D_FGCLUT134_GREEN_0     (0x1u<<8)
#define DMA2D_FGCLUT134_BLUE        (0xFFu<<0)
#define DMA2D_FGCLUT134_BLUE_0      (0x1u<<0)

// FGCLUT135 Configuration

#define DMA2D_FGCLUT135_ALPHA       (0xFFu<<24)
#define DMA2D_FGCLUT135_ALPHA_0     (0x1u<<24)
#define DMA2D_FGCLUT135_RED         (0xFFu<<16)
#define DMA2D_FGCLUT135_RED_0       (0x1u<<16)
#define DMA2D_FGCLUT135_GREEN       (0xFFu<<8)
#define DMA2D_FGCLUT135_GREEN_0     (0x1u<<8)
#define DMA2D_FGCLUT135_BLUE        (0xFFu<<0)
#define DMA2D_FGCLUT135_BLUE_0      (0x1u<<0)

// FGCLUT136 Configuration

#define DMA2D_FGCLUT136_ALPHA       (0xFFu<<24)
#define DMA2D_FGCLUT136_ALPHA_0     (0x1u<<24)
#define DMA2D_FGCLUT136_RED         (0xFFu<<16)
#define DMA2D_FGCLUT136_RED_0       (0x1u<<16)
#define DMA2D_FGCLUT136_GREEN       (0xFFu<<8)
#define DMA2D_FGCLUT136_GREEN_0     (0x1u<<8)
#define DMA2D_FGCLUT136_BLUE        (0xFFu<<0)
#define DMA2D_FGCLUT136_BLUE_0      (0x1u<<0)

// FGCLUT137 Configuration

#define DMA2D_FGCLUT137_ALPHA       (0xFFu<<24)
#define DMA2D_FGCLUT137_ALPHA_0     (0x1u<<24)
#define DMA2D_FGCLUT137_RED         (0xFFu<<16)
#define DMA2D_FGCLUT137_RED_0       (0x1u<<16)
#define DMA2D_FGCLUT137_GREEN       (0xFFu<<8)
#define DMA2D_FGCLUT137_GREEN_0     (0x1u<<8)
#define DMA2D_FGCLUT137_BLUE        (0xFFu<<0)
#define DMA2D_FGCLUT137_BLUE_0      (0x1u<<0)

// FGCLUT138 Configuration

#define DMA2D_FGCLUT138_ALPHA       (0xFFu<<24)
#define DMA2D_FGCLUT138_ALPHA_0     (0x1u<<24)
#define DMA2D_FGCLUT138_RED         (0xFFu<<16)
#define DMA2D_FGCLUT138_RED_0       (0x1u<<16)
#define DMA2D_FGCLUT138_GREEN       (0xFFu<<8)
#define DMA2D_FGCLUT138_GREEN_0     (0x1u<<8)
#define DMA2D_FGCLUT138_BLUE        (0xFFu<<0)
#define DMA2D_FGCLUT138_BLUE_0      (0x1u<<0)

// FGCLUT139 Configuration

