Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_dma2d.h
#define DMA2D_FGCLUT157_ALPHA       (0xFFu<<24)
#define DMA2D_FGCLUT157_ALPHA_0     (0x1u<<24)
#define DMA2D_FGCLUT157_RED         (0xFFu<<16)
#define DMA2D_FGCLUT157_RED_0       (0x1u<<16)
#define DMA2D_FGCLUT157_GREEN       (0xFFu<<8)
#define DMA2D_FGCLUT157_GREEN_0     (0x1u<<8)
#define DMA2D_FGCLUT157_BLUE        (0xFFu<<0)
#define DMA2D_FGCLUT157_BLUE_0      (0x1u<<0)

// FGCLUT158 Configuration

#define DMA2D_FGCLUT158_ALPHA       (0xFFu<<24)
#define DMA2D_FGCLUT158_ALPHA_0     (0x1u<<24)
#define DMA2D_FGCLUT158_RED         (0xFFu<<16)
#define DMA2D_FGCLUT158_RED_0       (0x1u<<16)
#define DMA2D_FGCLUT158_GREEN       (0xFFu<<8)
#define DMA2D_FGCLUT158_GREEN_0     (0x1u<<8)
#define DMA2D_FGCLUT158_BLUE        (0xFFu<<0)
#define DMA2D_FGCLUT158_BLUE_0      (0x1u<<0)

// FGCLUT159 Configuration

#define DMA2D_FGCLUT159_ALPHA       (0xFFu<<24)
#define DMA2D_FGCLUT159_ALPHA_0     (0x1u<<24)
#define DMA2D_FGCLUT159_RED         (0xFFu<<16)
#define DMA2D_FGCLUT159_RED_0       (0x1u<<16)
#define DMA2D_FGCLUT159_GREEN       (0xFFu<<8)
#define DMA2D_FGCLUT159_GREEN_0     (0x1u<<8)
#define DMA2D_FGCLUT159_BLUE        (0xFFu<<0)
#define DMA2D_FGCLUT159_BLUE_0      (0x1u<<0)

// FGCLUT160 Configuration

#define DMA2D_FGCLUT160_ALPHA       (0xFFu<<24)
#define DMA2D_FGCLUT160_ALPHA_0     (0x1u<<24)
#define DMA2D_FGCLUT160_RED         (0xFFu<<16)
#define DMA2D_FGCLUT160_RED_0       (0x1u<<16)
#define DMA2D_FGCLUT160_GREEN       (0xFFu<<8)
#define DMA2D_FGCLUT160_GREEN_0     (0x1u<<8)
#define DMA2D_FGCLUT160_BLUE        (0xFFu<<0)
#define DMA2D_FGCLUT160_BLUE_0      (0x1u<<0)

// FGCLUT161 Configuration

#define DMA2D_FGCLUT161_ALPHA       (0xFFu<<24)
#define DMA2D_FGCLUT161_ALPHA_0     (0x1u<<24)
#define DMA2D_FGCLUT161_RED         (0xFFu<<16)
#define DMA2D_FGCLUT161_RED_0       (0x1u<<16)
#define DMA2D_FGCLUT161_GREEN       (0xFFu<<8)
#define DMA2D_FGCLUT161_GREEN_0     (0x1u<<8)
#define DMA2D_FGCLUT161_BLUE        (0xFFu<<0)
#define DMA2D_FGCLUT161_BLUE_0      (0x1u<<0)

// FGCLUT162 Configuration

#define DMA2D_FGCLUT162_ALPHA       (0xFFu<<24)
#define DMA2D_FGCLUT162_ALPHA_0     (0x1u<<24)
#define DMA2D_FGCLUT162_RED         (0xFFu<<16)
#define DMA2D_FGCLUT162_RED_0       (0x1u<<16)
#define DMA2D_FGCLUT162_GREEN       (0xFFu<<8)
#define DMA2D_FGCLUT162_GREEN_0     (0x1u<<8)
#define DMA2D_FGCLUT162_BLUE        (0xFFu<<0)
#define DMA2D_FGCLUT162_BLUE_0      (0x1u<<0)

// FGCLUT163 Configuration

#define DMA2D_FGCLUT163_ALPHA       (0xFFu<<24)
#define DMA2D_FGCLUT163_ALPHA_0     (0x1u<<24)
#define DMA2D_FGCLUT163_RED         (0xFFu<<16)
#define DMA2D_FGCLUT163_RED_0       (0x1u<<16)
#define DMA2D_FGCLUT163_GREEN       (0xFFu<<8)
#define DMA2D_FGCLUT163_GREEN_0     (0x1u<<8)
#define DMA2D_FGCLUT163_BLUE        (0xFFu<<0)
#define DMA2D_FGCLUT163_BLUE_0      (0x1u<<0)

// FGCLUT164 Configuration

#define DMA2D_FGCLUT164_ALPHA       (0xFFu<<24)
#define DMA2D_FGCLUT164_ALPHA_0     (0x1u<<24)
#define DMA2D_FGCLUT164_RED         (0xFFu<<16)
#define DMA2D_FGCLUT164_RED_0       (0x1u<<16)
#define DMA2D_FGCLUT164_GREEN       (0xFFu<<8)
#define DMA2D_FGCLUT164_GREEN_0     (0x1u<<8)
#define DMA2D_FGCLUT164_BLUE        (0xFFu<<0)
#define DMA2D_FGCLUT164_BLUE_0      (0x1u<<0)

// FGCLUT165 Configuration

#define DMA2D_FGCLUT165_ALPHA       (0xFFu<<24)
#define DMA2D_FGCLUT165_ALPHA_0     (0x1u<<24)
#define DMA2D_FGCLUT165_RED         (0xFFu<<16)
#define DMA2D_FGCLUT165_RED_0       (0x1u<<16)
#define DMA2D_FGCLUT165_GREEN       (0xFFu<<8)
#define DMA2D_FGCLUT165_GREEN_0     (0x1u<<8)
#define DMA2D_FGCLUT165_BLUE        (0xFFu<<0)
#define DMA2D_FGCLUT165_BLUE_0      (0x1u<<0)

// FGCLUT166 Configuration

#define DMA2D_FGCLUT166_ALPHA       (0xFFu<<24)
#define DMA2D_FGCLUT166_ALPHA_0     (0x1u<<24)
#define DMA2D_FGCLUT166_RED         (0xFFu<<16)
#define DMA2D_FGCLUT166_RED_0       (0x1u<<16)
#define DMA2D_FGCLUT166_GREEN       (0xFFu<<8)
#define DMA2D_FGCLUT166_GREEN_0     (0x1u<<8)
#define DMA2D_FGCLUT166_BLUE        (0xFFu<<0)
#define DMA2D_FGCLUT166_BLUE_0      (0x1u<<0)

// FGCLUT167 Configuration

#define DMA2D_FGCLUT167_ALPHA       (0xFFu<<24)
#define DMA2D_FGCLUT167_ALPHA_0     (0x1u<<24)
#define DMA2D_FGCLUT167_RED         (0xFFu<<16)
#define DMA2D_FGCLUT167_RED_0       (0x1u<<16)
#define DMA2D_FGCLUT167_GREEN       (0xFFu<<8)
#define DMA2D_FGCLUT167_GREEN_0     (0x1u<<8)
#define DMA2D_FGCLUT167_BLUE        (0xFFu<<0)
#define DMA2D_FGCLUT167_BLUE_0      (0x1u<<0)

// FGCLUT168 Configuration

#define DMA2D_FGCLUT168_ALPHA       (0xFFu<<24)
#define DMA2D_FGCLUT168_ALPHA_0     (0x1u<<24)
#define DMA2D_FGCLUT168_RED         (0xFFu<<16)
#define DMA2D_FGCLUT168_RED_0       (0x1u<<16)
#define DMA2D_FGCLUT168_GREEN       (0xFFu<<8)
#define DMA2D_FGCLUT168_GREEN_0     (0x1u<<8)
#define DMA2D_FGCLUT168_BLUE        (0xFFu<<0)
#define DMA2D_FGCLUT168_BLUE_0      (0x1u<<0)

// FGCLUT169 Configuration

#define DMA2D_FGCLUT169_ALPHA       (0xFFu<<24)
#define DMA2D_FGCLUT169_ALPHA_0     (0x1u<<24)
#define DMA2D_FGCLUT169_RED         (0xFFu<<16)
#define DMA2D_FGCLUT169_RED_0       (0x1u<<16)
#define DMA2D_FGCLUT169_GREEN       (0xFFu<<8)
#define DMA2D_FGCLUT169_GREEN_0     (0x1u<<8)
#define DMA2D_FGCLUT169_BLUE        (0xFFu<<0)
#define DMA2D_FGCLUT169_BLUE_0      (0x1u<<0)

// FGCLUT170 Configuration

#define DMA2D_FGCLUT170_ALPHA       (0xFFu<<24)
#define DMA2D_FGCLUT170_ALPHA_0     (0x1u<<24)
#define DMA2D_FGCLUT170_RED         (0xFFu<<16)
#define DMA2D_FGCLUT170_RED_0       (0x1u<<16)
#define DMA2D_FGCLUT170_GREEN       (0xFFu<<8)
#define DMA2D_FGCLUT170_GREEN_0     (0x1u<<8)
#define DMA2D_FGCLUT170_BLUE        (0xFFu<<0)
#define DMA2D_FGCLUT170_BLUE_0      (0x1u<<0)

// FGCLUT171 Configuration

#define DMA2D_FGCLUT171_ALPHA       (0xFFu<<24)
#define DMA2D_FGCLUT171_ALPHA_0     (0x1u<<24)
#define DMA2D_FGCLUT171_RED         (0xFFu<<16)
#define DMA2D_FGCLUT171_RED_0       (0x1u<<16)
#define DMA2D_FGCLUT171_GREEN       (0xFFu<<8)
#define DMA2D_FGCLUT171_GREEN_0     (0x1u<<8)
#define DMA2D_FGCLUT171_BLUE        (0xFFu<<0)
#define DMA2D_FGCLUT171_BLUE_0      (0x1u<<0)

// FGCLUT172 Configuration

#define DMA2D_FGCLUT172_ALPHA       (0xFFu<<24)
#define DMA2D_FGCLUT172_ALPHA_0     (0x1u<<24)
#define DMA2D_FGCLUT172_RED         (0xFFu<<16)
#define DMA2D_FGCLUT172_RED_0       (0x1u<<16)
#define DMA2D_FGCLUT172_GREEN       (0xFFu<<8)
#define DMA2D_FGCLUT172_GREEN_0     (0x1u<<8)
#define DMA2D_FGCLUT172_BLUE        (0xFFu<<0)
#define DMA2D_FGCLUT172_BLUE_0      (0x1u<<0)

// FGCLUT173 Configuration

