Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_dma2d.h
#define DMA2D_FGCLUT173_ALPHA       (0xFFu<<24)
#define DMA2D_FGCLUT173_ALPHA_0     (0x1u<<24)
#define DMA2D_FGCLUT173_RED         (0xFFu<<16)
#define DMA2D_FGCLUT173_RED_0       (0x1u<<16)
#define DMA2D_FGCLUT173_GREEN       (0xFFu<<8)
#define DMA2D_FGCLUT173_GREEN_0     (0x1u<<8)
#define DMA2D_FGCLUT173_BLUE        (0xFFu<<0)
#define DMA2D_FGCLUT173_BLUE_0      (0x1u<<0)

// FGCLUT174 Configuration

#define DMA2D_FGCLUT174_ALPHA       (0xFFu<<24)
#define DMA2D_FGCLUT174_ALPHA_0     (0x1u<<24)
#define DMA2D_FGCLUT174_RED         (0xFFu<<16)
#define DMA2D_FGCLUT174_RED_0       (0x1u<<16)
#define DMA2D_FGCLUT174_GREEN       (0xFFu<<8)
#define DMA2D_FGCLUT174_GREEN_0     (0x1u<<8)
#define DMA2D_FGCLUT174_BLUE        (0xFFu<<0)
#define DMA2D_FGCLUT174_BLUE_0      (0x1u<<0)

// FGCLUT175 Configuration

#define DMA2D_FGCLUT175_ALPHA       (0xFFu<<24)
#define DMA2D_FGCLUT175_ALPHA_0     (0x1u<<24)
#define DMA2D_FGCLUT175_RED         (0xFFu<<16)
#define DMA2D_FGCLUT175_RED_0       (0x1u<<16)
#define DMA2D_FGCLUT175_GREEN       (0xFFu<<8)
#define DMA2D_FGCLUT175_GREEN_0     (0x1u<<8)
#define DMA2D_FGCLUT175_BLUE        (0xFFu<<0)
#define DMA2D_FGCLUT175_BLUE_0      (0x1u<<0)

// FGCLUT176 Configuration

#define DMA2D_FGCLUT176_ALPHA       (0xFFu<<24)
#define DMA2D_FGCLUT176_ALPHA_0     (0x1u<<24)
#define DMA2D_FGCLUT176_RED         (0xFFu<<16)
#define DMA2D_FGCLUT176_RED_0       (0x1u<<16)
#define DMA2D_FGCLUT176_GREEN       (0xFFu<<8)
#define DMA2D_FGCLUT176_GREEN_0     (0x1u<<8)
#define DMA2D_FGCLUT176_BLUE        (0xFFu<<0)
#define DMA2D_FGCLUT176_BLUE_0      (0x1u<<0)

// FGCLUT177 Configuration

#define DMA2D_FGCLUT177_ALPHA       (0xFFu<<24)
#define DMA2D_FGCLUT177_ALPHA_0     (0x1u<<24)
#define DMA2D_FGCLUT177_RED         (0xFFu<<16)
#define DMA2D_FGCLUT177_RED_0       (0x1u<<16)
#define DMA2D_FGCLUT177_GREEN       (0xFFu<<8)
#define DMA2D_FGCLUT177_GREEN_0     (0x1u<<8)
#define DMA2D_FGCLUT177_BLUE        (0xFFu<<0)
#define DMA2D_FGCLUT177_BLUE_0      (0x1u<<0)

// FGCLUT178 Configuration

#define DMA2D_FGCLUT178_ALPHA       (0xFFu<<24)
#define DMA2D_FGCLUT178_ALPHA_0     (0x1u<<24)
#define DMA2D_FGCLUT178_RED         (0xFFu<<16)
#define DMA2D_FGCLUT178_RED_0       (0x1u<<16)
#define DMA2D_FGCLUT178_GREEN       (0xFFu<<8)
#define DMA2D_FGCLUT178_GREEN_0     (0x1u<<8)
#define DMA2D_FGCLUT178_BLUE        (0xFFu<<0)
#define DMA2D_FGCLUT178_BLUE_0      (0x1u<<0)

// FGCLUT179 Configuration

#define DMA2D_FGCLUT179_ALPHA       (0xFFu<<24)
#define DMA2D_FGCLUT179_ALPHA_0     (0x1u<<24)
#define DMA2D_FGCLUT179_RED         (0xFFu<<16)
#define DMA2D_FGCLUT179_RED_0       (0x1u<<16)
#define DMA2D_FGCLUT179_GREEN       (0xFFu<<8)
#define DMA2D_FGCLUT179_GREEN_0     (0x1u<<8)
#define DMA2D_FGCLUT179_BLUE        (0xFFu<<0)
#define DMA2D_FGCLUT179_BLUE_0      (0x1u<<0)

// FGCLUT180 Configuration

#define DMA2D_FGCLUT180_ALPHA       (0xFFu<<24)
#define DMA2D_FGCLUT180_ALPHA_0     (0x1u<<24)
#define DMA2D_FGCLUT180_RED         (0xFFu<<16)
#define DMA2D_FGCLUT180_RED_0       (0x1u<<16)
#define DMA2D_FGCLUT180_GREEN       (0xFFu<<8)
#define DMA2D_FGCLUT180_GREEN_0     (0x1u<<8)
#define DMA2D_FGCLUT180_BLUE        (0xFFu<<0)
#define DMA2D_FGCLUT180_BLUE_0      (0x1u<<0)

// FGCLUT181 Configuration

#define DMA2D_FGCLUT181_ALPHA       (0xFFu<<24)
#define DMA2D_FGCLUT181_ALPHA_0     (0x1u<<24)
#define DMA2D_FGCLUT181_RED         (0xFFu<<16)
#define DMA2D_FGCLUT181_RED_0       (0x1u<<16)
#define DMA2D_FGCLUT181_GREEN       (0xFFu<<8)
#define DMA2D_FGCLUT181_GREEN_0     (0x1u<<8)
#define DMA2D_FGCLUT181_BLUE        (0xFFu<<0)
#define DMA2D_FGCLUT181_BLUE_0      (0x1u<<0)

// FGCLUT182 Configuration

#define DMA2D_FGCLUT182_ALPHA       (0xFFu<<24)
#define DMA2D_FGCLUT182_ALPHA_0     (0x1u<<24)
#define DMA2D_FGCLUT182_RED         (0xFFu<<16)
#define DMA2D_FGCLUT182_RED_0       (0x1u<<16)
#define DMA2D_FGCLUT182_GREEN       (0xFFu<<8)
#define DMA2D_FGCLUT182_GREEN_0     (0x1u<<8)
#define DMA2D_FGCLUT182_BLUE        (0xFFu<<0)
#define DMA2D_FGCLUT182_BLUE_0      (0x1u<<0)

// FGCLUT183 Configuration

#define DMA2D_FGCLUT183_ALPHA       (0xFFu<<24)
#define DMA2D_FGCLUT183_ALPHA_0     (0x1u<<24)
#define DMA2D_FGCLUT183_RED         (0xFFu<<16)
#define DMA2D_FGCLUT183_RED_0       (0x1u<<16)
#define DMA2D_FGCLUT183_GREEN       (0xFFu<<8)
#define DMA2D_FGCLUT183_GREEN_0     (0x1u<<8)
#define DMA2D_FGCLUT183_BLUE        (0xFFu<<0)
#define DMA2D_FGCLUT183_BLUE_0      (0x1u<<0)

// FGCLUT184 Configuration

#define DMA2D_FGCLUT184_ALPHA       (0xFFu<<24)
#define DMA2D_FGCLUT184_ALPHA_0     (0x1u<<24)
#define DMA2D_FGCLUT184_RED         (0xFFu<<16)
#define DMA2D_FGCLUT184_RED_0       (0x1u<<16)
#define DMA2D_FGCLUT184_GREEN       (0xFFu<<8)
#define DMA2D_FGCLUT184_GREEN_0     (0x1u<<8)
#define DMA2D_FGCLUT184_BLUE        (0xFFu<<0)
#define DMA2D_FGCLUT184_BLUE_0      (0x1u<<0)

// FGCLUT185 Configuration

#define DMA2D_FGCLUT185_ALPHA       (0xFFu<<24)
#define DMA2D_FGCLUT185_ALPHA_0     (0x1u<<24)
#define DMA2D_FGCLUT185_RED         (0xFFu<<16)
#define DMA2D_FGCLUT185_RED_0       (0x1u<<16)
#define DMA2D_FGCLUT185_GREEN       (0xFFu<<8)
#define DMA2D_FGCLUT185_GREEN_0     (0x1u<<8)
#define DMA2D_FGCLUT185_BLUE        (0xFFu<<0)
#define DMA2D_FGCLUT185_BLUE_0      (0x1u<<0)

// FGCLUT186 Configuration

#define DMA2D_FGCLUT186_ALPHA       (0xFFu<<24)
#define DMA2D_FGCLUT186_ALPHA_0     (0x1u<<24)
#define DMA2D_FGCLUT186_RED         (0xFFu<<16)
#define DMA2D_FGCLUT186_RED_0       (0x1u<<16)
#define DMA2D_FGCLUT186_GREEN       (0xFFu<<8)
#define DMA2D_FGCLUT186_GREEN_0     (0x1u<<8)
#define DMA2D_FGCLUT186_BLUE        (0xFFu<<0)
#define DMA2D_FGCLUT186_BLUE_0      (0x1u<<0)

// FGCLUT187 Configuration

#define DMA2D_FGCLUT187_ALPHA       (0xFFu<<24)
#define DMA2D_FGCLUT187_ALPHA_0     (0x1u<<24)
#define DMA2D_FGCLUT187_RED         (0xFFu<<16)
#define DMA2D_FGCLUT187_RED_0       (0x1u<<16)
#define DMA2D_FGCLUT187_GREEN       (0xFFu<<8)
#define DMA2D_FGCLUT187_GREEN_0     (0x1u<<8)
#define DMA2D_FGCLUT187_BLUE        (0xFFu<<0)
#define DMA2D_FGCLUT187_BLUE_0      (0x1u<<0)

// FGCLUT188 Configuration

#define DMA2D_FGCLUT188_ALPHA       (0xFFu<<24)
#define DMA2D_FGCLUT188_ALPHA_0     (0x1u<<24)
#define DMA2D_FGCLUT188_RED         (0xFFu<<16)
#define DMA2D_FGCLUT188_RED_0       (0x1u<<16)
#define DMA2D_FGCLUT188_GREEN       (0xFFu<<8)
#define DMA2D_FGCLUT188_GREEN_0     (0x1u<<8)
#define DMA2D_FGCLUT188_BLUE        (0xFFu<<0)
#define DMA2D_FGCLUT188_BLUE_0      (0x1u<<0)

// FGCLUT189 Configuration

