Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_dma2d.h
#define DMA2D_FGCLUT189_ALPHA       (0xFFu<<24)
#define DMA2D_FGCLUT189_ALPHA_0     (0x1u<<24)
#define DMA2D_FGCLUT189_RED         (0xFFu<<16)
#define DMA2D_FGCLUT189_RED_0       (0x1u<<16)
#define DMA2D_FGCLUT189_GREEN       (0xFFu<<8)
#define DMA2D_FGCLUT189_GREEN_0     (0x1u<<8)
#define DMA2D_FGCLUT189_BLUE        (0xFFu<<0)
#define DMA2D_FGCLUT189_BLUE_0      (0x1u<<0)

// FGCLUT190 Configuration

#define DMA2D_FGCLUT190_ALPHA       (0xFFu<<24)
#define DMA2D_FGCLUT190_ALPHA_0     (0x1u<<24)
#define DMA2D_FGCLUT190_RED         (0xFFu<<16)
#define DMA2D_FGCLUT190_RED_0       (0x1u<<16)
#define DMA2D_FGCLUT190_GREEN       (0xFFu<<8)
#define DMA2D_FGCLUT190_GREEN_0     (0x1u<<8)
#define DMA2D_FGCLUT190_BLUE        (0xFFu<<0)
#define DMA2D_FGCLUT190_BLUE_0      (0x1u<<0)

// FGCLUT191 Configuration

#define DMA2D_FGCLUT191_ALPHA       (0xFFu<<24)
#define DMA2D_FGCLUT191_ALPHA_0     (0x1u<<24)
#define DMA2D_FGCLUT191_RED         (0xFFu<<16)
#define DMA2D_FGCLUT191_RED_0       (0x1u<<16)
#define DMA2D_FGCLUT191_GREEN       (0xFFu<<8)
#define DMA2D_FGCLUT191_GREEN_0     (0x1u<<8)
#define DMA2D_FGCLUT191_BLUE        (0xFFu<<0)
#define DMA2D_FGCLUT191_BLUE_0      (0x1u<<0)

// FGCLUT192 Configuration

#define DMA2D_FGCLUT192_ALPHA       (0xFFu<<24)
#define DMA2D_FGCLUT192_ALPHA_0     (0x1u<<24)
#define DMA2D_FGCLUT192_RED         (0xFFu<<16)
#define DMA2D_FGCLUT192_RED_0       (0x1u<<16)
#define DMA2D_FGCLUT192_GREEN       (0xFFu<<8)
#define DMA2D_FGCLUT192_GREEN_0     (0x1u<<8)
#define DMA2D_FGCLUT192_BLUE        (0xFFu<<0)
#define DMA2D_FGCLUT192_BLUE_0      (0x1u<<0)

// FGCLUT193 Configuration

#define DMA2D_FGCLUT193_ALPHA       (0xFFu<<24)
#define DMA2D_FGCLUT193_ALPHA_0     (0x1u<<24)
#define DMA2D_FGCLUT193_RED         (0xFFu<<16)
#define DMA2D_FGCLUT193_RED_0       (0x1u<<16)
#define DMA2D_FGCLUT193_GREEN       (0xFFu<<8)
#define DMA2D_FGCLUT193_GREEN_0     (0x1u<<8)
#define DMA2D_FGCLUT193_BLUE        (0xFFu<<0)
#define DMA2D_FGCLUT193_BLUE_0      (0x1u<<0)

// FGCLUT194 Configuration

#define DMA2D_FGCLUT194_ALPHA       (0xFFu<<24)
#define DMA2D_FGCLUT194_ALPHA_0     (0x1u<<24)
#define DMA2D_FGCLUT194_RED         (0xFFu<<16)
#define DMA2D_FGCLUT194_RED_0       (0x1u<<16)
#define DMA2D_FGCLUT194_GREEN       (0xFFu<<8)
#define DMA2D_FGCLUT194_GREEN_0     (0x1u<<8)
#define DMA2D_FGCLUT194_BLUE        (0xFFu<<0)
#define DMA2D_FGCLUT194_BLUE_0      (0x1u<<0)

// FGCLUT195 Configuration

#define DMA2D_FGCLUT195_ALPHA       (0xFFu<<24)
#define DMA2D_FGCLUT195_ALPHA_0     (0x1u<<24)
#define DMA2D_FGCLUT195_RED         (0xFFu<<16)
#define DMA2D_FGCLUT195_RED_0       (0x1u<<16)
#define DMA2D_FGCLUT195_GREEN       (0xFFu<<8)
#define DMA2D_FGCLUT195_GREEN_0     (0x1u<<8)
#define DMA2D_FGCLUT195_BLUE        (0xFFu<<0)
#define DMA2D_FGCLUT195_BLUE_0      (0x1u<<0)

// FGCLUT196 Configuration

#define DMA2D_FGCLUT196_ALPHA       (0xFFu<<24)
#define DMA2D_FGCLUT196_ALPHA_0     (0x1u<<24)
#define DMA2D_FGCLUT196_RED         (0xFFu<<16)
#define DMA2D_FGCLUT196_RED_0       (0x1u<<16)
#define DMA2D_FGCLUT196_GREEN       (0xFFu<<8)
#define DMA2D_FGCLUT196_GREEN_0     (0x1u<<8)
#define DMA2D_FGCLUT196_BLUE        (0xFFu<<0)
#define DMA2D_FGCLUT196_BLUE_0      (0x1u<<0)

// FGCLUT197 Configuration

#define DMA2D_FGCLUT197_ALPHA       (0xFFu<<24)
#define DMA2D_FGCLUT197_ALPHA_0     (0x1u<<24)
#define DMA2D_FGCLUT197_RED         (0xFFu<<16)
#define DMA2D_FGCLUT197_RED_0       (0x1u<<16)
#define DMA2D_FGCLUT197_GREEN       (0xFFu<<8)
#define DMA2D_FGCLUT197_GREEN_0     (0x1u<<8)
#define DMA2D_FGCLUT197_BLUE        (0xFFu<<0)
#define DMA2D_FGCLUT197_BLUE_0      (0x1u<<0)

// FGCLUT198 Configuration

#define DMA2D_FGCLUT198_ALPHA       (0xFFu<<24)
#define DMA2D_FGCLUT198_ALPHA_0     (0x1u<<24)
#define DMA2D_FGCLUT198_RED         (0xFFu<<16)
#define DMA2D_FGCLUT198_RED_0       (0x1u<<16)
#define DMA2D_FGCLUT198_GREEN       (0xFFu<<8)
#define DMA2D_FGCLUT198_GREEN_0     (0x1u<<8)
#define DMA2D_FGCLUT198_BLUE        (0xFFu<<0)
#define DMA2D_FGCLUT198_BLUE_0      (0x1u<<0)

// FGCLUT199 Configuration

#define DMA2D_FGCLUT199_ALPHA       (0xFFu<<24)
#define DMA2D_FGCLUT199_ALPHA_0     (0x1u<<24)
#define DMA2D_FGCLUT199_RED         (0xFFu<<16)
#define DMA2D_FGCLUT199_RED_0       (0x1u<<16)
#define DMA2D_FGCLUT199_GREEN       (0xFFu<<8)
#define DMA2D_FGCLUT199_GREEN_0     (0x1u<<8)
#define DMA2D_FGCLUT199_BLUE        (0xFFu<<0)
#define DMA2D_FGCLUT199_BLUE_0      (0x1u<<0)

// FGCLUT200 Configuration

#define DMA2D_FGCLUT200_ALPHA       (0xFFu<<24)
#define DMA2D_FGCLUT200_ALPHA_0     (0x1u<<24)
#define DMA2D_FGCLUT200_RED         (0xFFu<<16)
#define DMA2D_FGCLUT200_RED_0       (0x1u<<16)
#define DMA2D_FGCLUT200_GREEN       (0xFFu<<8)
#define DMA2D_FGCLUT200_GREEN_0     (0x1u<<8)
#define DMA2D_FGCLUT200_BLUE        (0xFFu<<0)
#define DMA2D_FGCLUT200_BLUE_0      (0x1u<<0)

// FGCLUT201 Configuration

#define DMA2D_FGCLUT201_ALPHA       (0xFFu<<24)
#define DMA2D_FGCLUT201_ALPHA_0     (0x1u<<24)
#define DMA2D_FGCLUT201_RED         (0xFFu<<16)
#define DMA2D_FGCLUT201_RED_0       (0x1u<<16)
#define DMA2D_FGCLUT201_GREEN       (0xFFu<<8)
#define DMA2D_FGCLUT201_GREEN_0     (0x1u<<8)
#define DMA2D_FGCLUT201_BLUE        (0xFFu<<0)
#define DMA2D_FGCLUT201_BLUE_0      (0x1u<<0)

// FGCLUT202 Configuration

#define DMA2D_FGCLUT202_ALPHA       (0xFFu<<24)
#define DMA2D_FGCLUT202_ALPHA_0     (0x1u<<24)
#define DMA2D_FGCLUT202_RED         (0xFFu<<16)
#define DMA2D_FGCLUT202_RED_0       (0x1u<<16)
#define DMA2D_FGCLUT202_GREEN       (0xFFu<<8)
#define DMA2D_FGCLUT202_GREEN_0     (0x1u<<8)
#define DMA2D_FGCLUT202_BLUE        (0xFFu<<0)
#define DMA2D_FGCLUT202_BLUE_0      (0x1u<<0)

// FGCLUT203 Configuration

#define DMA2D_FGCLUT203_ALPHA       (0xFFu<<24)
#define DMA2D_FGCLUT203_ALPHA_0     (0x1u<<24)
#define DMA2D_FGCLUT203_RED         (0xFFu<<16)
#define DMA2D_FGCLUT203_RED_0       (0x1u<<16)
#define DMA2D_FGCLUT203_GREEN       (0xFFu<<8)
#define DMA2D_FGCLUT203_GREEN_0     (0x1u<<8)
#define DMA2D_FGCLUT203_BLUE        (0xFFu<<0)
#define DMA2D_FGCLUT203_BLUE_0      (0x1u<<0)

// FGCLUT204 Configuration

#define DMA2D_FGCLUT204_ALPHA       (0xFFu<<24)
#define DMA2D_FGCLUT204_ALPHA_0     (0x1u<<24)
#define DMA2D_FGCLUT204_RED         (0xFFu<<16)
#define DMA2D_FGCLUT204_RED_0       (0x1u<<16)
#define DMA2D_FGCLUT204_GREEN       (0xFFu<<8)
#define DMA2D_FGCLUT204_GREEN_0     (0x1u<<8)
#define DMA2D_FGCLUT204_BLUE        (0xFFu<<0)
#define DMA2D_FGCLUT204_BLUE_0      (0x1u<<0)

// FGCLUT205 Configuration

#define DMA2D_FGCLUT205_ALPHA       (0xFFu<<24)
#define DMA2D_FGCLUT205_ALPHA_0     (0x1u<<24)
#define DMA2D_FGCLUT205_RED         (0xFFu<<16)
#define DMA2D_FGCLUT205_RED_0       (0x1u<<16)
#define DMA2D_FGCLUT205_GREEN       (0xFFu<<8)
#define DMA2D_FGCLUT205_GREEN_0     (0x1u<<8)
#define DMA2D_FGCLUT205_BLUE        (0xFFu<<0)
#define DMA2D_FGCLUT205_BLUE_0      (0x1u<<0)

