Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_dma2d.h
// FGCLUT206 Configuration

#define DMA2D_FGCLUT206_ALPHA       (0xFFu<<24)
#define DMA2D_FGCLUT206_ALPHA_0     (0x1u<<24)
#define DMA2D_FGCLUT206_RED         (0xFFu<<16)
#define DMA2D_FGCLUT206_RED_0       (0x1u<<16)
#define DMA2D_FGCLUT206_GREEN       (0xFFu<<8)
#define DMA2D_FGCLUT206_GREEN_0     (0x1u<<8)
#define DMA2D_FGCLUT206_BLUE        (0xFFu<<0)
#define DMA2D_FGCLUT206_BLUE_0      (0x1u<<0)

// FGCLUT207 Configuration

#define DMA2D_FGCLUT207_ALPHA       (0xFFu<<24)
#define DMA2D_FGCLUT207_ALPHA_0     (0x1u<<24)
#define DMA2D_FGCLUT207_RED         (0xFFu<<16)
#define DMA2D_FGCLUT207_RED_0       (0x1u<<16)
#define DMA2D_FGCLUT207_GREEN       (0xFFu<<8)
#define DMA2D_FGCLUT207_GREEN_0     (0x1u<<8)
#define DMA2D_FGCLUT207_BLUE        (0xFFu<<0)
#define DMA2D_FGCLUT207_BLUE_0      (0x1u<<0)

// FGCLUT208 Configuration

#define DMA2D_FGCLUT208_ALPHA       (0xFFu<<24)
#define DMA2D_FGCLUT208_ALPHA_0     (0x1u<<24)
#define DMA2D_FGCLUT208_RED         (0xFFu<<16)
#define DMA2D_FGCLUT208_RED_0       (0x1u<<16)
#define DMA2D_FGCLUT208_GREEN       (0xFFu<<8)
#define DMA2D_FGCLUT208_GREEN_0     (0x1u<<8)
#define DMA2D_FGCLUT208_BLUE        (0xFFu<<0)
#define DMA2D_FGCLUT208_BLUE_0      (0x1u<<0)

// FGCLUT209 Configuration

#define DMA2D_FGCLUT209_ALPHA       (0xFFu<<24)
#define DMA2D_FGCLUT209_ALPHA_0     (0x1u<<24)
#define DMA2D_FGCLUT209_RED         (0xFFu<<16)
#define DMA2D_FGCLUT209_RED_0       (0x1u<<16)
#define DMA2D_FGCLUT209_GREEN       (0xFFu<<8)
#define DMA2D_FGCLUT209_GREEN_0     (0x1u<<8)
#define DMA2D_FGCLUT209_BLUE        (0xFFu<<0)
#define DMA2D_FGCLUT209_BLUE_0      (0x1u<<0)

// FGCLUT210 Configuration

#define DMA2D_FGCLUT210_ALPHA       (0xFFu<<24)
#define DMA2D_FGCLUT210_ALPHA_0     (0x1u<<24)
#define DMA2D_FGCLUT210_RED         (0xFFu<<16)
#define DMA2D_FGCLUT210_RED_0       (0x1u<<16)
#define DMA2D_FGCLUT210_GREEN       (0xFFu<<8)
#define DMA2D_FGCLUT210_GREEN_0     (0x1u<<8)
#define DMA2D_FGCLUT210_BLUE        (0xFFu<<0)
#define DMA2D_FGCLUT210_BLUE_0      (0x1u<<0)

// FGCLUT211 Configuration

#define DMA2D_FGCLUT211_ALPHA       (0xFFu<<24)
#define DMA2D_FGCLUT211_ALPHA_0     (0x1u<<24)
#define DMA2D_FGCLUT211_RED         (0xFFu<<16)
#define DMA2D_FGCLUT211_RED_0       (0x1u<<16)
#define DMA2D_FGCLUT211_GREEN       (0xFFu<<8)
#define DMA2D_FGCLUT211_GREEN_0     (0x1u<<8)
#define DMA2D_FGCLUT211_BLUE        (0xFFu<<0)
#define DMA2D_FGCLUT211_BLUE_0      (0x1u<<0)

// FGCLUT212 Configuration

#define DMA2D_FGCLUT212_ALPHA       (0xFFu<<24)
#define DMA2D_FGCLUT212_ALPHA_0     (0x1u<<24)
#define DMA2D_FGCLUT212_RED         (0xFFu<<16)
#define DMA2D_FGCLUT212_RED_0       (0x1u<<16)
#define DMA2D_FGCLUT212_GREEN       (0xFFu<<8)
#define DMA2D_FGCLUT212_GREEN_0     (0x1u<<8)
#define DMA2D_FGCLUT212_BLUE        (0xFFu<<0)
#define DMA2D_FGCLUT212_BLUE_0      (0x1u<<0)

// FGCLUT213 Configuration

#define DMA2D_FGCLUT213_ALPHA       (0xFFu<<24)
#define DMA2D_FGCLUT213_ALPHA_0     (0x1u<<24)
#define DMA2D_FGCLUT213_RED         (0xFFu<<16)
#define DMA2D_FGCLUT213_RED_0       (0x1u<<16)
#define DMA2D_FGCLUT213_GREEN       (0xFFu<<8)
#define DMA2D_FGCLUT213_GREEN_0     (0x1u<<8)
#define DMA2D_FGCLUT213_BLUE        (0xFFu<<0)
#define DMA2D_FGCLUT213_BLUE_0      (0x1u<<0)

// FGCLUT214 Configuration

#define DMA2D_FGCLUT214_ALPHA       (0xFFu<<24)
#define DMA2D_FGCLUT214_ALPHA_0     (0x1u<<24)
#define DMA2D_FGCLUT214_RED         (0xFFu<<16)
#define DMA2D_FGCLUT214_RED_0       (0x1u<<16)
#define DMA2D_FGCLUT214_GREEN       (0xFFu<<8)
#define DMA2D_FGCLUT214_GREEN_0     (0x1u<<8)
#define DMA2D_FGCLUT214_BLUE        (0xFFu<<0)
#define DMA2D_FGCLUT214_BLUE_0      (0x1u<<0)

// FGCLUT215 Configuration

#define DMA2D_FGCLUT215_ALPHA       (0xFFu<<24)
#define DMA2D_FGCLUT215_ALPHA_0     (0x1u<<24)
#define DMA2D_FGCLUT215_RED         (0xFFu<<16)
#define DMA2D_FGCLUT215_RED_0       (0x1u<<16)
#define DMA2D_FGCLUT215_GREEN       (0xFFu<<8)
#define DMA2D_FGCLUT215_GREEN_0     (0x1u<<8)
#define DMA2D_FGCLUT215_BLUE        (0xFFu<<0)
#define DMA2D_FGCLUT215_BLUE_0      (0x1u<<0)

// FGCLUT216 Configuration

#define DMA2D_FGCLUT216_ALPHA       (0xFFu<<24)
#define DMA2D_FGCLUT216_ALPHA_0     (0x1u<<24)
#define DMA2D_FGCLUT216_RED         (0xFFu<<16)
#define DMA2D_FGCLUT216_RED_0       (0x1u<<16)
#define DMA2D_FGCLUT216_GREEN       (0xFFu<<8)
#define DMA2D_FGCLUT216_GREEN_0     (0x1u<<8)
#define DMA2D_FGCLUT216_BLUE        (0xFFu<<0)
#define DMA2D_FGCLUT216_BLUE_0      (0x1u<<0)

// FGCLUT217 Configuration

#define DMA2D_FGCLUT217_ALPHA       (0xFFu<<24)
#define DMA2D_FGCLUT217_ALPHA_0     (0x1u<<24)
#define DMA2D_FGCLUT217_RED         (0xFFu<<16)
#define DMA2D_FGCLUT217_RED_0       (0x1u<<16)
#define DMA2D_FGCLUT217_GREEN       (0xFFu<<8)
#define DMA2D_FGCLUT217_GREEN_0     (0x1u<<8)
#define DMA2D_FGCLUT217_BLUE        (0xFFu<<0)
#define DMA2D_FGCLUT217_BLUE_0      (0x1u<<0)

// FGCLUT218 Configuration

#define DMA2D_FGCLUT218_ALPHA       (0xFFu<<24)
#define DMA2D_FGCLUT218_ALPHA_0     (0x1u<<24)
#define DMA2D_FGCLUT218_RED         (0xFFu<<16)
#define DMA2D_FGCLUT218_RED_0       (0x1u<<16)
#define DMA2D_FGCLUT218_GREEN       (0xFFu<<8)
#define DMA2D_FGCLUT218_GREEN_0     (0x1u<<8)
#define DMA2D_FGCLUT218_BLUE        (0xFFu<<0)
#define DMA2D_FGCLUT218_BLUE_0      (0x1u<<0)

// FGCLUT219 Configuration

#define DMA2D_FGCLUT219_ALPHA       (0xFFu<<24)
#define DMA2D_FGCLUT219_ALPHA_0     (0x1u<<24)
#define DMA2D_FGCLUT219_RED         (0xFFu<<16)
#define DMA2D_FGCLUT219_RED_0       (0x1u<<16)
#define DMA2D_FGCLUT219_GREEN       (0xFFu<<8)
#define DMA2D_FGCLUT219_GREEN_0     (0x1u<<8)
#define DMA2D_FGCLUT219_BLUE        (0xFFu<<0)
#define DMA2D_FGCLUT219_BLUE_0      (0x1u<<0)

// FGCLUT220 Configuration

#define DMA2D_FGCLUT220_ALPHA       (0xFFu<<24)
#define DMA2D_FGCLUT220_ALPHA_0     (0x1u<<24)
#define DMA2D_FGCLUT220_RED         (0xFFu<<16)
#define DMA2D_FGCLUT220_RED_0       (0x1u<<16)
#define DMA2D_FGCLUT220_GREEN       (0xFFu<<8)
#define DMA2D_FGCLUT220_GREEN_0     (0x1u<<8)
#define DMA2D_FGCLUT220_BLUE        (0xFFu<<0)
#define DMA2D_FGCLUT220_BLUE_0      (0x1u<<0)

// FGCLUT221 Configuration

#define DMA2D_FGCLUT221_ALPHA       (0xFFu<<24)
#define DMA2D_FGCLUT221_ALPHA_0     (0x1u<<24)
#define DMA2D_FGCLUT221_RED         (0xFFu<<16)
#define DMA2D_FGCLUT221_RED_0       (0x1u<<16)
#define DMA2D_FGCLUT221_GREEN       (0xFFu<<8)
#define DMA2D_FGCLUT221_GREEN_0     (0x1u<<8)
#define DMA2D_FGCLUT221_BLUE        (0xFFu<<0)
#define DMA2D_FGCLUT221_BLUE_0      (0x1u<<0)

