Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_dma2d.h
// FGCLUT222 Configuration

#define DMA2D_FGCLUT222_ALPHA       (0xFFu<<24)
#define DMA2D_FGCLUT222_ALPHA_0     (0x1u<<24)
#define DMA2D_FGCLUT222_RED         (0xFFu<<16)
#define DMA2D_FGCLUT222_RED_0       (0x1u<<16)
#define DMA2D_FGCLUT222_GREEN       (0xFFu<<8)
#define DMA2D_FGCLUT222_GREEN_0     (0x1u<<8)
#define DMA2D_FGCLUT222_BLUE        (0xFFu<<0)
#define DMA2D_FGCLUT222_BLUE_0      (0x1u<<0)

// FGCLUT223 Configuration

#define DMA2D_FGCLUT223_ALPHA       (0xFFu<<24)
#define DMA2D_FGCLUT223_ALPHA_0     (0x1u<<24)
#define DMA2D_FGCLUT223_RED         (0xFFu<<16)
#define DMA2D_FGCLUT223_RED_0       (0x1u<<16)
#define DMA2D_FGCLUT223_GREEN       (0xFFu<<8)
#define DMA2D_FGCLUT223_GREEN_0     (0x1u<<8)
#define DMA2D_FGCLUT223_BLUE        (0xFFu<<0)
#define DMA2D_FGCLUT223_BLUE_0      (0x1u<<0)

// FGCLUT224 Configuration

#define DMA2D_FGCLUT224_ALPHA       (0xFFu<<24)
#define DMA2D_FGCLUT224_ALPHA_0     (0x1u<<24)
#define DMA2D_FGCLUT224_RED         (0xFFu<<16)
#define DMA2D_FGCLUT224_RED_0       (0x1u<<16)
#define DMA2D_FGCLUT224_GREEN       (0xFFu<<8)
#define DMA2D_FGCLUT224_GREEN_0     (0x1u<<8)
#define DMA2D_FGCLUT224_BLUE        (0xFFu<<0)
#define DMA2D_FGCLUT224_BLUE_0      (0x1u<<0)

// FGCLUT225 Configuration

#define DMA2D_FGCLUT225_ALPHA       (0xFFu<<24)
#define DMA2D_FGCLUT225_ALPHA_0     (0x1u<<24)
#define DMA2D_FGCLUT225_RED         (0xFFu<<16)
#define DMA2D_FGCLUT225_RED_0       (0x1u<<16)
#define DMA2D_FGCLUT225_GREEN       (0xFFu<<8)
#define DMA2D_FGCLUT225_GREEN_0     (0x1u<<8)
#define DMA2D_FGCLUT225_BLUE        (0xFFu<<0)
#define DMA2D_FGCLUT225_BLUE_0      (0x1u<<0)

// FGCLUT226 Configuration

#define DMA2D_FGCLUT226_ALPHA       (0xFFu<<24)
#define DMA2D_FGCLUT226_ALPHA_0     (0x1u<<24)
#define DMA2D_FGCLUT226_RED         (0xFFu<<16)
#define DMA2D_FGCLUT226_RED_0       (0x1u<<16)
#define DMA2D_FGCLUT226_GREEN       (0xFFu<<8)
#define DMA2D_FGCLUT226_GREEN_0     (0x1u<<8)
#define DMA2D_FGCLUT226_BLUE        (0xFFu<<0)
#define DMA2D_FGCLUT226_BLUE_0      (0x1u<<0)

// FGCLUT227 Configuration

#define DMA2D_FGCLUT227_ALPHA       (0xFFu<<24)
#define DMA2D_FGCLUT227_ALPHA_0     (0x1u<<24)
#define DMA2D_FGCLUT227_RED         (0xFFu<<16)
#define DMA2D_FGCLUT227_RED_0       (0x1u<<16)
#define DMA2D_FGCLUT227_GREEN       (0xFFu<<8)
#define DMA2D_FGCLUT227_GREEN_0     (0x1u<<8)
#define DMA2D_FGCLUT227_BLUE        (0xFFu<<0)
#define DMA2D_FGCLUT227_BLUE_0      (0x1u<<0)

// FGCLUT228 Configuration

#define DMA2D_FGCLUT228_ALPHA       (0xFFu<<24)
#define DMA2D_FGCLUT228_ALPHA_0     (0x1u<<24)
#define DMA2D_FGCLUT228_RED         (0xFFu<<16)
#define DMA2D_FGCLUT228_RED_0       (0x1u<<16)
#define DMA2D_FGCLUT228_GREEN       (0xFFu<<8)
#define DMA2D_FGCLUT228_GREEN_0     (0x1u<<8)
#define DMA2D_FGCLUT228_BLUE        (0xFFu<<0)
#define DMA2D_FGCLUT228_BLUE_0      (0x1u<<0)

// FGCLUT229 Configuration

#define DMA2D_FGCLUT229_ALPHA       (0xFFu<<24)
#define DMA2D_FGCLUT229_ALPHA_0     (0x1u<<24)
#define DMA2D_FGCLUT229_RED         (0xFFu<<16)
#define DMA2D_FGCLUT229_RED_0       (0x1u<<16)
#define DMA2D_FGCLUT229_GREEN       (0xFFu<<8)
#define DMA2D_FGCLUT229_GREEN_0     (0x1u<<8)
#define DMA2D_FGCLUT229_BLUE        (0xFFu<<0)
#define DMA2D_FGCLUT229_BLUE_0      (0x1u<<0)

// FGCLUT230 Configuration

#define DMA2D_FGCLUT230_ALPHA       (0xFFu<<24)
#define DMA2D_FGCLUT230_ALPHA_0     (0x1u<<24)
#define DMA2D_FGCLUT230_RED         (0xFFu<<16)
#define DMA2D_FGCLUT230_RED_0       (0x1u<<16)
#define DMA2D_FGCLUT230_GREEN       (0xFFu<<8)
#define DMA2D_FGCLUT230_GREEN_0     (0x1u<<8)
#define DMA2D_FGCLUT230_BLUE        (0xFFu<<0)
#define DMA2D_FGCLUT230_BLUE_0      (0x1u<<0)

// FGCLUT231 Configuration

#define DMA2D_FGCLUT231_ALPHA       (0xFFu<<24)
#define DMA2D_FGCLUT231_ALPHA_0     (0x1u<<24)
#define DMA2D_FGCLUT231_RED         (0xFFu<<16)
#define DMA2D_FGCLUT231_RED_0       (0x1u<<16)
#define DMA2D_FGCLUT231_GREEN       (0xFFu<<8)
#define DMA2D_FGCLUT231_GREEN_0     (0x1u<<8)
#define DMA2D_FGCLUT231_BLUE        (0xFFu<<0)
#define DMA2D_FGCLUT231_BLUE_0      (0x1u<<0)

// FGCLUT232 Configuration

#define DMA2D_FGCLUT232_ALPHA       (0xFFu<<24)
#define DMA2D_FGCLUT232_ALPHA_0     (0x1u<<24)
#define DMA2D_FGCLUT232_RED         (0xFFu<<16)
#define DMA2D_FGCLUT232_RED_0       (0x1u<<16)
#define DMA2D_FGCLUT232_GREEN       (0xFFu<<8)
#define DMA2D_FGCLUT232_GREEN_0     (0x1u<<8)
#define DMA2D_FGCLUT232_BLUE        (0xFFu<<0)
#define DMA2D_FGCLUT232_BLUE_0      (0x1u<<0)

// FGCLUT233 Configuration

#define DMA2D_FGCLUT233_ALPHA       (0xFFu<<24)
#define DMA2D_FGCLUT233_ALPHA_0     (0x1u<<24)
#define DMA2D_FGCLUT233_RED         (0xFFu<<16)
#define DMA2D_FGCLUT233_RED_0       (0x1u<<16)
#define DMA2D_FGCLUT233_GREEN       (0xFFu<<8)
#define DMA2D_FGCLUT233_GREEN_0     (0x1u<<8)
#define DMA2D_FGCLUT233_BLUE        (0xFFu<<0)
#define DMA2D_FGCLUT233_BLUE_0      (0x1u<<0)

// FGCLUT234 Configuration

#define DMA2D_FGCLUT234_ALPHA       (0xFFu<<24)
#define DMA2D_FGCLUT234_ALPHA_0     (0x1u<<24)
#define DMA2D_FGCLUT234_RED         (0xFFu<<16)
#define DMA2D_FGCLUT234_RED_0       (0x1u<<16)
#define DMA2D_FGCLUT234_GREEN       (0xFFu<<8)
#define DMA2D_FGCLUT234_GREEN_0     (0x1u<<8)
#define DMA2D_FGCLUT234_BLUE        (0xFFu<<0)
#define DMA2D_FGCLUT234_BLUE_0      (0x1u<<0)

// FGCLUT235 Configuration

#define DMA2D_FGCLUT235_ALPHA       (0xFFu<<24)
#define DMA2D_FGCLUT235_ALPHA_0     (0x1u<<24)
#define DMA2D_FGCLUT235_RED         (0xFFu<<16)
#define DMA2D_FGCLUT235_RED_0       (0x1u<<16)
#define DMA2D_FGCLUT235_GREEN       (0xFFu<<8)
#define DMA2D_FGCLUT235_GREEN_0     (0x1u<<8)
#define DMA2D_FGCLUT235_BLUE        (0xFFu<<0)
#define DMA2D_FGCLUT235_BLUE_0      (0x1u<<0)

// FGCLUT236 Configuration

#define DMA2D_FGCLUT236_ALPHA       (0xFFu<<24)
#define DMA2D_FGCLUT236_ALPHA_0     (0x1u<<24)
#define DMA2D_FGCLUT236_RED         (0xFFu<<16)
#define DMA2D_FGCLUT236_RED_0       (0x1u<<16)
#define DMA2D_FGCLUT236_GREEN       (0xFFu<<8)
#define DMA2D_FGCLUT236_GREEN_0     (0x1u<<8)
#define DMA2D_FGCLUT236_BLUE        (0xFFu<<0)
#define DMA2D_FGCLUT236_BLUE_0      (0x1u<<0)

// FGCLUT237 Configuration

#define DMA2D_FGCLUT237_ALPHA       (0xFFu<<24)
#define DMA2D_FGCLUT237_ALPHA_0     (0x1u<<24)
#define DMA2D_FGCLUT237_RED         (0xFFu<<16)
#define DMA2D_FGCLUT237_RED_0       (0x1u<<16)
#define DMA2D_FGCLUT237_GREEN       (0xFFu<<8)
#define DMA2D_FGCLUT237_GREEN_0     (0x1u<<8)
#define DMA2D_FGCLUT237_BLUE        (0xFFu<<0)
#define DMA2D_FGCLUT237_BLUE_0      (0x1u<<0)

// FGCLUT238 Configuration

#define DMA2D_FGCLUT238_ALPHA       (0xFFu<<24)
#define DMA2D_FGCLUT238_ALPHA_0     (0x1u<<24)
#define DMA2D_FGCLUT238_RED         (0xFFu<<16)
#define DMA2D_FGCLUT238_RED_0       (0x1u<<16)
#define DMA2D_FGCLUT238_GREEN       (0xFFu<<8)
#define DMA2D_FGCLUT238_GREEN_0     (0x1u<<8)
#define DMA2D_FGCLUT238_BLUE        (0xFFu<<0)
#define DMA2D_FGCLUT238_BLUE_0      (0x1u<<0)

// FGCLUT239 Configuration

#define DMA2D_FGCLUT239_ALPHA       (0xFFu<<24)
#define DMA2D_FGCLUT239_ALPHA_0     (0x1u<<24)
#define DMA2D_FGCLUT239_RED         (0xFFu<<16)
#define DMA2D_FGCLUT239_RED_0       (0x1u<<16)
#define DMA2D_FGCLUT239_GREEN       (0xFFu<<8)
#define DMA2D_FGCLUT239_GREEN_0     (0x1u<<8)
#define DMA2D_FGCLUT239_BLUE        (0xFFu<<0)
#define DMA2D_FGCLUT239_BLUE_0      (0x1u<<0)

// FGCLUT240 Configuration

