Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_dma2d.h
#define DMA2D_FGCLUT240_ALPHA       (0xFFu<<24)
#define DMA2D_FGCLUT240_ALPHA_0     (0x1u<<24)
#define DMA2D_FGCLUT240_RED         (0xFFu<<16)
#define DMA2D_FGCLUT240_RED_0       (0x1u<<16)
#define DMA2D_FGCLUT240_GREEN       (0xFFu<<8)
#define DMA2D_FGCLUT240_GREEN_0     (0x1u<<8)
#define DMA2D_FGCLUT240_BLUE        (0xFFu<<0)
#define DMA2D_FGCLUT240_BLUE_0      (0x1u<<0)

// FGCLUT241 Configuration

#define DMA2D_FGCLUT241_ALPHA       (0xFFu<<24)
#define DMA2D_FGCLUT241_ALPHA_0     (0x1u<<24)
#define DMA2D_FGCLUT241_RED         (0xFFu<<16)
#define DMA2D_FGCLUT241_RED_0       (0x1u<<16)
#define DMA2D_FGCLUT241_GREEN       (0xFFu<<8)
#define DMA2D_FGCLUT241_GREEN_0     (0x1u<<8)
#define DMA2D_FGCLUT241_BLUE        (0xFFu<<0)
#define DMA2D_FGCLUT241_BLUE_0      (0x1u<<0)

// FGCLUT242 Configuration

#define DMA2D_FGCLUT242_ALPHA       (0xFFu<<24)
#define DMA2D_FGCLUT242_ALPHA_0     (0x1u<<24)
#define DMA2D_FGCLUT242_RED         (0xFFu<<16)
#define DMA2D_FGCLUT242_RED_0       (0x1u<<16)
#define DMA2D_FGCLUT242_GREEN       (0xFFu<<8)
#define DMA2D_FGCLUT242_GREEN_0     (0x1u<<8)
#define DMA2D_FGCLUT242_BLUE        (0xFFu<<0)
#define DMA2D_FGCLUT242_BLUE_0      (0x1u<<0)

// FGCLUT243 Configuration

#define DMA2D_FGCLUT243_ALPHA       (0xFFu<<24)
#define DMA2D_FGCLUT243_ALPHA_0     (0x1u<<24)
#define DMA2D_FGCLUT243_RED         (0xFFu<<16)
#define DMA2D_FGCLUT243_RED_0       (0x1u<<16)
#define DMA2D_FGCLUT243_GREEN       (0xFFu<<8)
#define DMA2D_FGCLUT243_GREEN_0     (0x1u<<8)
#define DMA2D_FGCLUT243_BLUE        (0xFFu<<0)
#define DMA2D_FGCLUT243_BLUE_0      (0x1u<<0)

// FGCLUT244 Configuration

#define DMA2D_FGCLUT244_ALPHA       (0xFFu<<24)
#define DMA2D_FGCLUT244_ALPHA_0     (0x1u<<24)
#define DMA2D_FGCLUT244_RED         (0xFFu<<16)
#define DMA2D_FGCLUT244_RED_0       (0x1u<<16)
#define DMA2D_FGCLUT244_GREEN       (0xFFu<<8)
#define DMA2D_FGCLUT244_GREEN_0     (0x1u<<8)
#define DMA2D_FGCLUT244_BLUE        (0xFFu<<0)
#define DMA2D_FGCLUT244_BLUE_0      (0x1u<<0)

// FGCLUT245 Configuration

#define DMA2D_FGCLUT245_ALPHA       (0xFFu<<24)
#define DMA2D_FGCLUT245_ALPHA_0     (0x1u<<24)
#define DMA2D_FGCLUT245_RED         (0xFFu<<16)
#define DMA2D_FGCLUT245_RED_0       (0x1u<<16)
#define DMA2D_FGCLUT245_GREEN       (0xFFu<<8)
#define DMA2D_FGCLUT245_GREEN_0     (0x1u<<8)
#define DMA2D_FGCLUT245_BLUE        (0xFFu<<0)
#define DMA2D_FGCLUT245_BLUE_0      (0x1u<<0)

// FGCLUT246 Configuration

#define DMA2D_FGCLUT246_ALPHA       (0xFFu<<24)
#define DMA2D_FGCLUT246_ALPHA_0     (0x1u<<24)
#define DMA2D_FGCLUT246_RED         (0xFFu<<16)
#define DMA2D_FGCLUT246_RED_0       (0x1u<<16)
#define DMA2D_FGCLUT246_GREEN       (0xFFu<<8)
#define DMA2D_FGCLUT246_GREEN_0     (0x1u<<8)
#define DMA2D_FGCLUT246_BLUE        (0xFFu<<0)
#define DMA2D_FGCLUT246_BLUE_0      (0x1u<<0)

// FGCLUT247 Configuration

#define DMA2D_FGCLUT247_ALPHA       (0xFFu<<24)
#define DMA2D_FGCLUT247_ALPHA_0     (0x1u<<24)
#define DMA2D_FGCLUT247_RED         (0xFFu<<16)
#define DMA2D_FGCLUT247_RED_0       (0x1u<<16)
#define DMA2D_FGCLUT247_GREEN       (0xFFu<<8)
#define DMA2D_FGCLUT247_GREEN_0     (0x1u<<8)
#define DMA2D_FGCLUT247_BLUE        (0xFFu<<0)
#define DMA2D_FGCLUT247_BLUE_0      (0x1u<<0)

// FGCLUT248 Configuration

#define DMA2D_FGCLUT248_ALPHA       (0xFFu<<24)
#define DMA2D_FGCLUT248_ALPHA_0     (0x1u<<24)
#define DMA2D_FGCLUT248_RED         (0xFFu<<16)
#define DMA2D_FGCLUT248_RED_0       (0x1u<<16)
#define DMA2D_FGCLUT248_GREEN       (0xFFu<<8)
#define DMA2D_FGCLUT248_GREEN_0     (0x1u<<8)
#define DMA2D_FGCLUT248_BLUE        (0xFFu<<0)
#define DMA2D_FGCLUT248_BLUE_0      (0x1u<<0)

// FGCLUT249 Configuration

#define DMA2D_FGCLUT249_ALPHA       (0xFFu<<24)
#define DMA2D_FGCLUT249_ALPHA_0     (0x1u<<24)
#define DMA2D_FGCLUT249_RED         (0xFFu<<16)
#define DMA2D_FGCLUT249_RED_0       (0x1u<<16)
#define DMA2D_FGCLUT249_GREEN       (0xFFu<<8)
#define DMA2D_FGCLUT249_GREEN_0     (0x1u<<8)
#define DMA2D_FGCLUT249_BLUE        (0xFFu<<0)
#define DMA2D_FGCLUT249_BLUE_0      (0x1u<<0)

// FGCLUT250 Configuration

#define DMA2D_FGCLUT250_ALPHA       (0xFFu<<24)
#define DMA2D_FGCLUT250_ALPHA_0     (0x1u<<24)
#define DMA2D_FGCLUT250_RED         (0xFFu<<16)
#define DMA2D_FGCLUT250_RED_0       (0x1u<<16)
#define DMA2D_FGCLUT250_GREEN       (0xFFu<<8)
#define DMA2D_FGCLUT250_GREEN_0     (0x1u<<8)
#define DMA2D_FGCLUT250_BLUE        (0xFFu<<0)
#define DMA2D_FGCLUT250_BLUE_0      (0x1u<<0)

// FGCLUT251 Configuration

#define DMA2D_FGCLUT251_ALPHA       (0xFFu<<24)
#define DMA2D_FGCLUT251_ALPHA_0     (0x1u<<24)
#define DMA2D_FGCLUT251_RED         (0xFFu<<16)
#define DMA2D_FGCLUT251_RED_0       (0x1u<<16)
#define DMA2D_FGCLUT251_GREEN       (0xFFu<<8)
#define DMA2D_FGCLUT251_GREEN_0     (0x1u<<8)
#define DMA2D_FGCLUT251_BLUE        (0xFFu<<0)
#define DMA2D_FGCLUT251_BLUE_0      (0x1u<<0)

// FGCLUT252 Configuration

#define DMA2D_FGCLUT252_ALPHA       (0xFFu<<24)
#define DMA2D_FGCLUT252_ALPHA_0     (0x1u<<24)
#define DMA2D_FGCLUT252_RED         (0xFFu<<16)
#define DMA2D_FGCLUT252_RED_0       (0x1u<<16)
#define DMA2D_FGCLUT252_GREEN       (0xFFu<<8)
#define DMA2D_FGCLUT252_GREEN_0     (0x1u<<8)
#define DMA2D_FGCLUT252_BLUE        (0xFFu<<0)
#define DMA2D_FGCLUT252_BLUE_0      (0x1u<<0)

// FGCLUT253 Configuration

#define DMA2D_FGCLUT253_ALPHA       (0xFFu<<24)
#define DMA2D_FGCLUT253_ALPHA_0     (0x1u<<24)
#define DMA2D_FGCLUT253_RED         (0xFFu<<16)
#define DMA2D_FGCLUT253_RED_0       (0x1u<<16)
#define DMA2D_FGCLUT253_GREEN       (0xFFu<<8)
#define DMA2D_FGCLUT253_GREEN_0     (0x1u<<8)
#define DMA2D_FGCLUT253_BLUE        (0xFFu<<0)
#define DMA2D_FGCLUT253_BLUE_0      (0x1u<<0)

// FGCLUT254 Configuration

#define DMA2D_FGCLUT254_ALPHA       (0xFFu<<24)
#define DMA2D_FGCLUT254_ALPHA_0     (0x1u<<24)
#define DMA2D_FGCLUT254_RED         (0xFFu<<16)
#define DMA2D_FGCLUT254_RED_0       (0x1u<<16)
#define DMA2D_FGCLUT254_GREEN       (0xFFu<<8)
#define DMA2D_FGCLUT254_GREEN_0     (0x1u<<8)
#define DMA2D_FGCLUT254_BLUE        (0xFFu<<0)
#define DMA2D_FGCLUT254_BLUE_0      (0x1u<<0)

// FGCLUT255 Configuration

#define DMA2D_FGCLUT255_ALPHA       (0xFFu<<24)
#define DMA2D_FGCLUT255_ALPHA_0     (0x1u<<24)
#define DMA2D_FGCLUT255_RED         (0xFFu<<16)
#define DMA2D_FGCLUT255_RED_0       (0x1u<<16)
#define DMA2D_FGCLUT255_GREEN       (0xFFu<<8)
#define DMA2D_FGCLUT255_GREEN_0     (0x1u<<8)
#define DMA2D_FGCLUT255_BLUE        (0xFFu<<0)
#define DMA2D_FGCLUT255_BLUE_0      (0x1u<<0)

// BGCLUT0 Configuration

#define DMA2D_BGCLUT0_ALPHA         (0xFFu<<24)
#define DMA2D_BGCLUT0_ALPHA_0       (0x1u<<24)
#define DMA2D_BGCLUT0_RED           (0xFFu<<16)
#define DMA2D_BGCLUT0_RED_0         (0x1u<<16)
#define DMA2D_BGCLUT0_GREEN         (0xFFu<<8)
#define DMA2D_BGCLUT0_GREEN_0       (0x1u<<8)
#define DMA2D_BGCLUT0_BLUE          (0xFFu<<0)
#define DMA2D_BGCLUT0_BLUE_0        (0x1u<<0)

// BGCLUT1 Configuration

