Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_dma2d.h
#define DMA2D_BGCLUT68_ALPHA        (0xFFu<<24)
#define DMA2D_BGCLUT68_ALPHA_0      (0x1u<<24)
#define DMA2D_BGCLUT68_RED          (0xFFu<<16)
#define DMA2D_BGCLUT68_RED_0        (0x1u<<16)
#define DMA2D_BGCLUT68_GREEN        (0xFFu<<8)
#define DMA2D_BGCLUT68_GREEN_0      (0x1u<<8)
#define DMA2D_BGCLUT68_BLUE         (0xFFu<<0)
#define DMA2D_BGCLUT68_BLUE_0       (0x1u<<0)

// BGCLUT69 Configuration

#define DMA2D_BGCLUT69_ALPHA        (0xFFu<<24)
#define DMA2D_BGCLUT69_ALPHA_0      (0x1u<<24)
#define DMA2D_BGCLUT69_RED          (0xFFu<<16)
#define DMA2D_BGCLUT69_RED_0        (0x1u<<16)
#define DMA2D_BGCLUT69_GREEN        (0xFFu<<8)
#define DMA2D_BGCLUT69_GREEN_0      (0x1u<<8)
#define DMA2D_BGCLUT69_BLUE         (0xFFu<<0)
#define DMA2D_BGCLUT69_BLUE_0       (0x1u<<0)

// BGCLUT70 Configuration

#define DMA2D_BGCLUT70_ALPHA        (0xFFu<<24)
#define DMA2D_BGCLUT70_ALPHA_0      (0x1u<<24)
#define DMA2D_BGCLUT70_RED          (0xFFu<<16)
#define DMA2D_BGCLUT70_RED_0        (0x1u<<16)
#define DMA2D_BGCLUT70_GREEN        (0xFFu<<8)
#define DMA2D_BGCLUT70_GREEN_0      (0x1u<<8)
#define DMA2D_BGCLUT70_BLUE         (0xFFu<<0)
#define DMA2D_BGCLUT70_BLUE_0       (0x1u<<0)

// BGCLUT71 Configuration

#define DMA2D_BGCLUT71_ALPHA        (0xFFu<<24)
#define DMA2D_BGCLUT71_ALPHA_0      (0x1u<<24)
#define DMA2D_BGCLUT71_RED          (0xFFu<<16)
#define DMA2D_BGCLUT71_RED_0        (0x1u<<16)
#define DMA2D_BGCLUT71_GREEN        (0xFFu<<8)
#define DMA2D_BGCLUT71_GREEN_0      (0x1u<<8)
#define DMA2D_BGCLUT71_BLUE         (0xFFu<<0)
#define DMA2D_BGCLUT71_BLUE_0       (0x1u<<0)

// BGCLUT72 Configuration

#define DMA2D_BGCLUT72_ALPHA        (0xFFu<<24)
#define DMA2D_BGCLUT72_ALPHA_0      (0x1u<<24)
#define DMA2D_BGCLUT72_RED          (0xFFu<<16)
#define DMA2D_BGCLUT72_RED_0        (0x1u<<16)
#define DMA2D_BGCLUT72_GREEN        (0xFFu<<8)
#define DMA2D_BGCLUT72_GREEN_0      (0x1u<<8)
#define DMA2D_BGCLUT72_BLUE         (0xFFu<<0)
#define DMA2D_BGCLUT72_BLUE_0       (0x1u<<0)

// BGCLUT73 Configuration

#define DMA2D_BGCLUT73_ALPHA        (0xFFu<<24)
#define DMA2D_BGCLUT73_ALPHA_0      (0x1u<<24)
#define DMA2D_BGCLUT73_RED          (0xFFu<<16)
#define DMA2D_BGCLUT73_RED_0        (0x1u<<16)
#define DMA2D_BGCLUT73_GREEN        (0xFFu<<8)
#define DMA2D_BGCLUT73_GREEN_0      (0x1u<<8)
#define DMA2D_BGCLUT73_BLUE         (0xFFu<<0)
#define DMA2D_BGCLUT73_BLUE_0       (0x1u<<0)

// BGCLUT74 Configuration

#define DMA2D_BGCLUT74_ALPHA        (0xFFu<<24)
#define DMA2D_BGCLUT74_ALPHA_0      (0x1u<<24)
#define DMA2D_BGCLUT74_RED          (0xFFu<<16)
#define DMA2D_BGCLUT74_RED_0        (0x1u<<16)
#define DMA2D_BGCLUT74_GREEN        (0xFFu<<8)
#define DMA2D_BGCLUT74_GREEN_0      (0x1u<<8)
#define DMA2D_BGCLUT74_BLUE         (0xFFu<<0)
#define DMA2D_BGCLUT74_BLUE_0       (0x1u<<0)

// BGCLUT75 Configuration

#define DMA2D_BGCLUT75_ALPHA        (0xFFu<<24)
#define DMA2D_BGCLUT75_ALPHA_0      (0x1u<<24)
#define DMA2D_BGCLUT75_RED          (0xFFu<<16)
#define DMA2D_BGCLUT75_RED_0        (0x1u<<16)
#define DMA2D_BGCLUT75_GREEN        (0xFFu<<8)
#define DMA2D_BGCLUT75_GREEN_0      (0x1u<<8)
#define DMA2D_BGCLUT75_BLUE         (0xFFu<<0)
#define DMA2D_BGCLUT75_BLUE_0       (0x1u<<0)

// BGCLUT76 Configuration

#define DMA2D_BGCLUT76_ALPHA        (0xFFu<<24)
#define DMA2D_BGCLUT76_ALPHA_0      (0x1u<<24)
#define DMA2D_BGCLUT76_RED          (0xFFu<<16)
#define DMA2D_BGCLUT76_RED_0        (0x1u<<16)
#define DMA2D_BGCLUT76_GREEN        (0xFFu<<8)
#define DMA2D_BGCLUT76_GREEN_0      (0x1u<<8)
#define DMA2D_BGCLUT76_BLUE         (0xFFu<<0)
#define DMA2D_BGCLUT76_BLUE_0       (0x1u<<0)

// BGCLUT77 Configuration

#define DMA2D_BGCLUT77_ALPHA        (0xFFu<<24)
#define DMA2D_BGCLUT77_ALPHA_0      (0x1u<<24)
#define DMA2D_BGCLUT77_RED          (0xFFu<<16)
#define DMA2D_BGCLUT77_RED_0        (0x1u<<16)
#define DMA2D_BGCLUT77_GREEN        (0xFFu<<8)
#define DMA2D_BGCLUT77_GREEN_0      (0x1u<<8)
#define DMA2D_BGCLUT77_BLUE         (0xFFu<<0)
#define DMA2D_BGCLUT77_BLUE_0       (0x1u<<0)

// BGCLUT78 Configuration

#define DMA2D_BGCLUT78_ALPHA        (0xFFu<<24)
#define DMA2D_BGCLUT78_ALPHA_0      (0x1u<<24)
#define DMA2D_BGCLUT78_RED          (0xFFu<<16)
#define DMA2D_BGCLUT78_RED_0        (0x1u<<16)
#define DMA2D_BGCLUT78_GREEN        (0xFFu<<8)
#define DMA2D_BGCLUT78_GREEN_0      (0x1u<<8)
#define DMA2D_BGCLUT78_BLUE         (0xFFu<<0)
#define DMA2D_BGCLUT78_BLUE_0       (0x1u<<0)

// BGCLUT79 Configuration

#define DMA2D_BGCLUT79_ALPHA        (0xFFu<<24)
#define DMA2D_BGCLUT79_ALPHA_0      (0x1u<<24)
#define DMA2D_BGCLUT79_RED          (0xFFu<<16)
#define DMA2D_BGCLUT79_RED_0        (0x1u<<16)
#define DMA2D_BGCLUT79_GREEN        (0xFFu<<8)
#define DMA2D_BGCLUT79_GREEN_0      (0x1u<<8)
#define DMA2D_BGCLUT79_BLUE         (0xFFu<<0)
#define DMA2D_BGCLUT79_BLUE_0       (0x1u<<0)

// BGCLUT80 Configuration

#define DMA2D_BGCLUT80_ALPHA        (0xFFu<<24)
#define DMA2D_BGCLUT80_ALPHA_0      (0x1u<<24)
#define DMA2D_BGCLUT80_RED          (0xFFu<<16)
#define DMA2D_BGCLUT80_RED_0        (0x1u<<16)
#define DMA2D_BGCLUT80_GREEN        (0xFFu<<8)
#define DMA2D_BGCLUT80_GREEN_0      (0x1u<<8)
#define DMA2D_BGCLUT80_BLUE         (0xFFu<<0)
#define DMA2D_BGCLUT80_BLUE_0       (0x1u<<0)

// BGCLUT81 Configuration

#define DMA2D_BGCLUT81_ALPHA        (0xFFu<<24)
#define DMA2D_BGCLUT81_ALPHA_0      (0x1u<<24)
#define DMA2D_BGCLUT81_RED          (0xFFu<<16)
#define DMA2D_BGCLUT81_RED_0        (0x1u<<16)
#define DMA2D_BGCLUT81_GREEN        (0xFFu<<8)
#define DMA2D_BGCLUT81_GREEN_0      (0x1u<<8)
#define DMA2D_BGCLUT81_BLUE         (0xFFu<<0)
#define DMA2D_BGCLUT81_BLUE_0       (0x1u<<0)

// BGCLUT82 Configuration

#define DMA2D_BGCLUT82_ALPHA        (0xFFu<<24)
#define DMA2D_BGCLUT82_ALPHA_0      (0x1u<<24)
#define DMA2D_BGCLUT82_RED          (0xFFu<<16)
#define DMA2D_BGCLUT82_RED_0        (0x1u<<16)
#define DMA2D_BGCLUT82_GREEN        (0xFFu<<8)
#define DMA2D_BGCLUT82_GREEN_0      (0x1u<<8)
#define DMA2D_BGCLUT82_BLUE         (0xFFu<<0)
#define DMA2D_BGCLUT82_BLUE_0       (0x1u<<0)

// BGCLUT83 Configuration

#define DMA2D_BGCLUT83_ALPHA        (0xFFu<<24)
#define DMA2D_BGCLUT83_ALPHA_0      (0x1u<<24)
#define DMA2D_BGCLUT83_RED          (0xFFu<<16)
#define DMA2D_BGCLUT83_RED_0        (0x1u<<16)
#define DMA2D_BGCLUT83_GREEN        (0xFFu<<8)
#define DMA2D_BGCLUT83_GREEN_0      (0x1u<<8)
#define DMA2D_BGCLUT83_BLUE         (0xFFu<<0)
#define DMA2D_BGCLUT83_BLUE_0       (0x1u<<0)

// BGCLUT84 Configuration

#define DMA2D_BGCLUT84_ALPHA        (0xFFu<<24)
#define DMA2D_BGCLUT84_ALPHA_0      (0x1u<<24)
#define DMA2D_BGCLUT84_RED          (0xFFu<<16)
#define DMA2D_BGCLUT84_RED_0        (0x1u<<16)
#define DMA2D_BGCLUT84_GREEN        (0xFFu<<8)
#define DMA2D_BGCLUT84_GREEN_0      (0x1u<<8)
#define DMA2D_BGCLUT84_BLUE         (0xFFu<<0)
#define DMA2D_BGCLUT84_BLUE_0       (0x1u<<0)

// BGCLUT85 Configuration

