Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_dma2d.h
// BGCLUT102 Configuration

#define DMA2D_BGCLUT102_ALPHA       (0xFFu<<24)
#define DMA2D_BGCLUT102_ALPHA_0     (0x1u<<24)
#define DMA2D_BGCLUT102_RED         (0xFFu<<16)
#define DMA2D_BGCLUT102_RED_0       (0x1u<<16)
#define DMA2D_BGCLUT102_GREEN       (0xFFu<<8)
#define DMA2D_BGCLUT102_GREEN_0     (0x1u<<8)
#define DMA2D_BGCLUT102_BLUE        (0xFFu<<0)
#define DMA2D_BGCLUT102_BLUE_0      (0x1u<<0)

// BGCLUT103 Configuration

#define DMA2D_BGCLUT103_ALPHA       (0xFFu<<24)
#define DMA2D_BGCLUT103_ALPHA_0     (0x1u<<24)
#define DMA2D_BGCLUT103_RED         (0xFFu<<16)
#define DMA2D_BGCLUT103_RED_0       (0x1u<<16)
#define DMA2D_BGCLUT103_GREEN       (0xFFu<<8)
#define DMA2D_BGCLUT103_GREEN_0     (0x1u<<8)
#define DMA2D_BGCLUT103_BLUE        (0xFFu<<0)
#define DMA2D_BGCLUT103_BLUE_0      (0x1u<<0)

// BGCLUT104 Configuration

#define DMA2D_BGCLUT104_ALPHA       (0xFFu<<24)
#define DMA2D_BGCLUT104_ALPHA_0     (0x1u<<24)
#define DMA2D_BGCLUT104_RED         (0xFFu<<16)
#define DMA2D_BGCLUT104_RED_0       (0x1u<<16)
#define DMA2D_BGCLUT104_GREEN       (0xFFu<<8)
#define DMA2D_BGCLUT104_GREEN_0     (0x1u<<8)
#define DMA2D_BGCLUT104_BLUE        (0xFFu<<0)
#define DMA2D_BGCLUT104_BLUE_0      (0x1u<<0)

// BGCLUT105 Configuration

#define DMA2D_BGCLUT105_ALPHA       (0xFFu<<24)
#define DMA2D_BGCLUT105_ALPHA_0     (0x1u<<24)
#define DMA2D_BGCLUT105_RED         (0xFFu<<16)
#define DMA2D_BGCLUT105_RED_0       (0x1u<<16)
#define DMA2D_BGCLUT105_GREEN       (0xFFu<<8)
#define DMA2D_BGCLUT105_GREEN_0     (0x1u<<8)
#define DMA2D_BGCLUT105_BLUE        (0xFFu<<0)
#define DMA2D_BGCLUT105_BLUE_0      (0x1u<<0)

// BGCLUT106 Configuration

#define DMA2D_BGCLUT106_ALPHA       (0xFFu<<24)
#define DMA2D_BGCLUT106_ALPHA_0     (0x1u<<24)
#define DMA2D_BGCLUT106_RED         (0xFFu<<16)
#define DMA2D_BGCLUT106_RED_0       (0x1u<<16)
#define DMA2D_BGCLUT106_GREEN       (0xFFu<<8)
#define DMA2D_BGCLUT106_GREEN_0     (0x1u<<8)
#define DMA2D_BGCLUT106_BLUE        (0xFFu<<0)
#define DMA2D_BGCLUT106_BLUE_0      (0x1u<<0)

// BGCLUT107 Configuration

#define DMA2D_BGCLUT107_ALPHA       (0xFFu<<24)
#define DMA2D_BGCLUT107_ALPHA_0     (0x1u<<24)
#define DMA2D_BGCLUT107_RED         (0xFFu<<16)
#define DMA2D_BGCLUT107_RED_0       (0x1u<<16)
#define DMA2D_BGCLUT107_GREEN       (0xFFu<<8)
#define DMA2D_BGCLUT107_GREEN_0     (0x1u<<8)
#define DMA2D_BGCLUT107_BLUE        (0xFFu<<0)
#define DMA2D_BGCLUT107_BLUE_0      (0x1u<<0)

// BGCLUT108 Configuration

#define DMA2D_BGCLUT108_ALPHA       (0xFFu<<24)
#define DMA2D_BGCLUT108_ALPHA_0     (0x1u<<24)
#define DMA2D_BGCLUT108_RED         (0xFFu<<16)
#define DMA2D_BGCLUT108_RED_0       (0x1u<<16)
#define DMA2D_BGCLUT108_GREEN       (0xFFu<<8)
#define DMA2D_BGCLUT108_GREEN_0     (0x1u<<8)
#define DMA2D_BGCLUT108_BLUE        (0xFFu<<0)
#define DMA2D_BGCLUT108_BLUE_0      (0x1u<<0)

// BGCLUT109 Configuration

#define DMA2D_BGCLUT109_ALPHA       (0xFFu<<24)
#define DMA2D_BGCLUT109_ALPHA_0     (0x1u<<24)
#define DMA2D_BGCLUT109_RED         (0xFFu<<16)
#define DMA2D_BGCLUT109_RED_0       (0x1u<<16)
#define DMA2D_BGCLUT109_GREEN       (0xFFu<<8)
#define DMA2D_BGCLUT109_GREEN_0     (0x1u<<8)
#define DMA2D_BGCLUT109_BLUE        (0xFFu<<0)
#define DMA2D_BGCLUT109_BLUE_0      (0x1u<<0)

// BGCLUT110 Configuration

#define DMA2D_BGCLUT110_ALPHA       (0xFFu<<24)
#define DMA2D_BGCLUT110_ALPHA_0     (0x1u<<24)
#define DMA2D_BGCLUT110_RED         (0xFFu<<16)
#define DMA2D_BGCLUT110_RED_0       (0x1u<<16)
#define DMA2D_BGCLUT110_GREEN       (0xFFu<<8)
#define DMA2D_BGCLUT110_GREEN_0     (0x1u<<8)
#define DMA2D_BGCLUT110_BLUE        (0xFFu<<0)
#define DMA2D_BGCLUT110_BLUE_0      (0x1u<<0)

// BGCLUT111 Configuration

#define DMA2D_BGCLUT111_ALPHA       (0xFFu<<24)
#define DMA2D_BGCLUT111_ALPHA_0     (0x1u<<24)
#define DMA2D_BGCLUT111_RED         (0xFFu<<16)
#define DMA2D_BGCLUT111_RED_0       (0x1u<<16)
#define DMA2D_BGCLUT111_GREEN       (0xFFu<<8)
#define DMA2D_BGCLUT111_GREEN_0     (0x1u<<8)
#define DMA2D_BGCLUT111_BLUE        (0xFFu<<0)
#define DMA2D_BGCLUT111_BLUE_0      (0x1u<<0)

// BGCLUT112 Configuration

#define DMA2D_BGCLUT112_ALPHA       (0xFFu<<24)
#define DMA2D_BGCLUT112_ALPHA_0     (0x1u<<24)
#define DMA2D_BGCLUT112_RED         (0xFFu<<16)
#define DMA2D_BGCLUT112_RED_0       (0x1u<<16)
#define DMA2D_BGCLUT112_GREEN       (0xFFu<<8)
#define DMA2D_BGCLUT112_GREEN_0     (0x1u<<8)
#define DMA2D_BGCLUT112_BLUE        (0xFFu<<0)
#define DMA2D_BGCLUT112_BLUE_0      (0x1u<<0)

// BGCLUT113 Configuration

#define DMA2D_BGCLUT113_ALPHA       (0xFFu<<24)
#define DMA2D_BGCLUT113_ALPHA_0     (0x1u<<24)
#define DMA2D_BGCLUT113_RED         (0xFFu<<16)
#define DMA2D_BGCLUT113_RED_0       (0x1u<<16)
#define DMA2D_BGCLUT113_GREEN       (0xFFu<<8)
#define DMA2D_BGCLUT113_GREEN_0     (0x1u<<8)
#define DMA2D_BGCLUT113_BLUE        (0xFFu<<0)
#define DMA2D_BGCLUT113_BLUE_0      (0x1u<<0)

// BGCLUT114 Configuration

#define DMA2D_BGCLUT114_ALPHA       (0xFFu<<24)
#define DMA2D_BGCLUT114_ALPHA_0     (0x1u<<24)
#define DMA2D_BGCLUT114_RED         (0xFFu<<16)
#define DMA2D_BGCLUT114_RED_0       (0x1u<<16)
#define DMA2D_BGCLUT114_GREEN       (0xFFu<<8)
#define DMA2D_BGCLUT114_GREEN_0     (0x1u<<8)
#define DMA2D_BGCLUT114_BLUE        (0xFFu<<0)
#define DMA2D_BGCLUT114_BLUE_0      (0x1u<<0)

// BGCLUT115 Configuration

#define DMA2D_BGCLUT115_ALPHA       (0xFFu<<24)
#define DMA2D_BGCLUT115_ALPHA_0     (0x1u<<24)
#define DMA2D_BGCLUT115_RED         (0xFFu<<16)
#define DMA2D_BGCLUT115_RED_0       (0x1u<<16)
#define DMA2D_BGCLUT115_GREEN       (0xFFu<<8)
#define DMA2D_BGCLUT115_GREEN_0     (0x1u<<8)
#define DMA2D_BGCLUT115_BLUE        (0xFFu<<0)
#define DMA2D_BGCLUT115_BLUE_0      (0x1u<<0)

// BGCLUT116 Configuration

#define DMA2D_BGCLUT116_ALPHA       (0xFFu<<24)
#define DMA2D_BGCLUT116_ALPHA_0     (0x1u<<24)
#define DMA2D_BGCLUT116_RED         (0xFFu<<16)
#define DMA2D_BGCLUT116_RED_0       (0x1u<<16)
#define DMA2D_BGCLUT116_GREEN       (0xFFu<<8)
#define DMA2D_BGCLUT116_GREEN_0     (0x1u<<8)
#define DMA2D_BGCLUT116_BLUE        (0xFFu<<0)
#define DMA2D_BGCLUT116_BLUE_0      (0x1u<<0)

// BGCLUT117 Configuration

#define DMA2D_BGCLUT117_ALPHA       (0xFFu<<24)
#define DMA2D_BGCLUT117_ALPHA_0     (0x1u<<24)
#define DMA2D_BGCLUT117_RED         (0xFFu<<16)
#define DMA2D_BGCLUT117_RED_0       (0x1u<<16)
#define DMA2D_BGCLUT117_GREEN       (0xFFu<<8)
#define DMA2D_BGCLUT117_GREEN_0     (0x1u<<8)
#define DMA2D_BGCLUT117_BLUE        (0xFFu<<0)
#define DMA2D_BGCLUT117_BLUE_0      (0x1u<<0)

// BGCLUT118 Configuration

#define DMA2D_BGCLUT118_ALPHA       (0xFFu<<24)
#define DMA2D_BGCLUT118_ALPHA_0     (0x1u<<24)
#define DMA2D_BGCLUT118_RED         (0xFFu<<16)
#define DMA2D_BGCLUT118_RED_0       (0x1u<<16)
#define DMA2D_BGCLUT118_GREEN       (0xFFu<<8)
#define DMA2D_BGCLUT118_GREEN_0     (0x1u<<8)
#define DMA2D_BGCLUT118_BLUE        (0xFFu<<0)
#define DMA2D_BGCLUT118_BLUE_0      (0x1u<<0)

// BGCLUT119 Configuration

#define DMA2D_BGCLUT119_ALPHA       (0xFFu<<24)
#define DMA2D_BGCLUT119_ALPHA_0     (0x1u<<24)
#define DMA2D_BGCLUT119_RED         (0xFFu<<16)
#define DMA2D_BGCLUT119_RED_0       (0x1u<<16)
#define DMA2D_BGCLUT119_GREEN       (0xFFu<<8)
#define DMA2D_BGCLUT119_GREEN_0     (0x1u<<8)
#define DMA2D_BGCLUT119_BLUE        (0xFFu<<0)
#define DMA2D_BGCLUT119_BLUE_0      (0x1u<<0)

// BGCLUT120 Configuration

#define DMA2D_BGCLUT120_ALPHA       (0xFFu<<24)
#define DMA2D_BGCLUT120_ALPHA_0     (0x1u<<24)
#define DMA2D_BGCLUT120_RED         (0xFFu<<16)
#define DMA2D_BGCLUT120_RED_0       (0x1u<<16)
#define DMA2D_BGCLUT120_GREEN       (0xFFu<<8)
#define DMA2D_BGCLUT120_GREEN_0     (0x1u<<8)
#define DMA2D_BGCLUT120_BLUE        (0xFFu<<0)
#define DMA2D_BGCLUT120_BLUE_0      (0x1u<<0)

// BGCLUT121 Configuration

