Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_dma2d.h
// BGCLUT138 Configuration

#define DMA2D_BGCLUT138_ALPHA       (0xFFu<<24)
#define DMA2D_BGCLUT138_ALPHA_0     (0x1u<<24)
#define DMA2D_BGCLUT138_RED         (0xFFu<<16)
#define DMA2D_BGCLUT138_RED_0       (0x1u<<16)
#define DMA2D_BGCLUT138_GREEN       (0xFFu<<8)
#define DMA2D_BGCLUT138_GREEN_0     (0x1u<<8)
#define DMA2D_BGCLUT138_BLUE        (0xFFu<<0)
#define DMA2D_BGCLUT138_BLUE_0      (0x1u<<0)

// BGCLUT139 Configuration

#define DMA2D_BGCLUT139_ALPHA       (0xFFu<<24)
#define DMA2D_BGCLUT139_ALPHA_0     (0x1u<<24)
#define DMA2D_BGCLUT139_RED         (0xFFu<<16)
#define DMA2D_BGCLUT139_RED_0       (0x1u<<16)
#define DMA2D_BGCLUT139_GREEN       (0xFFu<<8)
#define DMA2D_BGCLUT139_GREEN_0     (0x1u<<8)
#define DMA2D_BGCLUT139_BLUE        (0xFFu<<0)
#define DMA2D_BGCLUT139_BLUE_0      (0x1u<<0)

// BGCLUT140 Configuration

#define DMA2D_BGCLUT140_ALPHA       (0xFFu<<24)
#define DMA2D_BGCLUT140_ALPHA_0     (0x1u<<24)
#define DMA2D_BGCLUT140_RED         (0xFFu<<16)
#define DMA2D_BGCLUT140_RED_0       (0x1u<<16)
#define DMA2D_BGCLUT140_GREEN       (0xFFu<<8)
#define DMA2D_BGCLUT140_GREEN_0     (0x1u<<8)
#define DMA2D_BGCLUT140_BLUE        (0xFFu<<0)
#define DMA2D_BGCLUT140_BLUE_0      (0x1u<<0)

// BGCLUT141 Configuration

#define DMA2D_BGCLUT141_ALPHA       (0xFFu<<24)
#define DMA2D_BGCLUT141_ALPHA_0     (0x1u<<24)
#define DMA2D_BGCLUT141_RED         (0xFFu<<16)
#define DMA2D_BGCLUT141_RED_0       (0x1u<<16)
#define DMA2D_BGCLUT141_GREEN       (0xFFu<<8)
#define DMA2D_BGCLUT141_GREEN_0     (0x1u<<8)
#define DMA2D_BGCLUT141_BLUE        (0xFFu<<0)
#define DMA2D_BGCLUT141_BLUE_0      (0x1u<<0)

// BGCLUT142 Configuration

#define DMA2D_BGCLUT142_ALPHA       (0xFFu<<24)
#define DMA2D_BGCLUT142_ALPHA_0     (0x1u<<24)
#define DMA2D_BGCLUT142_RED         (0xFFu<<16)
#define DMA2D_BGCLUT142_RED_0       (0x1u<<16)
#define DMA2D_BGCLUT142_GREEN       (0xFFu<<8)
#define DMA2D_BGCLUT142_GREEN_0     (0x1u<<8)
#define DMA2D_BGCLUT142_BLUE        (0xFFu<<0)
#define DMA2D_BGCLUT142_BLUE_0      (0x1u<<0)

// BGCLUT143 Configuration

#define DMA2D_BGCLUT143_ALPHA       (0xFFu<<24)
#define DMA2D_BGCLUT143_ALPHA_0     (0x1u<<24)
#define DMA2D_BGCLUT143_RED         (0xFFu<<16)
#define DMA2D_BGCLUT143_RED_0       (0x1u<<16)
#define DMA2D_BGCLUT143_GREEN       (0xFFu<<8)
#define DMA2D_BGCLUT143_GREEN_0     (0x1u<<8)
#define DMA2D_BGCLUT143_BLUE        (0xFFu<<0)
#define DMA2D_BGCLUT143_BLUE_0      (0x1u<<0)

// BGCLUT144 Configuration

#define DMA2D_BGCLUT144_ALPHA       (0xFFu<<24)
#define DMA2D_BGCLUT144_ALPHA_0     (0x1u<<24)
#define DMA2D_BGCLUT144_RED         (0xFFu<<16)
#define DMA2D_BGCLUT144_RED_0       (0x1u<<16)
#define DMA2D_BGCLUT144_GREEN       (0xFFu<<8)
#define DMA2D_BGCLUT144_GREEN_0     (0x1u<<8)
#define DMA2D_BGCLUT144_BLUE        (0xFFu<<0)
#define DMA2D_BGCLUT144_BLUE_0      (0x1u<<0)

// BGCLUT145 Configuration

#define DMA2D_BGCLUT145_ALPHA       (0xFFu<<24)
#define DMA2D_BGCLUT145_ALPHA_0     (0x1u<<24)
#define DMA2D_BGCLUT145_RED         (0xFFu<<16)
#define DMA2D_BGCLUT145_RED_0       (0x1u<<16)
#define DMA2D_BGCLUT145_GREEN       (0xFFu<<8)
#define DMA2D_BGCLUT145_GREEN_0     (0x1u<<8)
#define DMA2D_BGCLUT145_BLUE        (0xFFu<<0)
#define DMA2D_BGCLUT145_BLUE_0      (0x1u<<0)

// BGCLUT146 Configuration

#define DMA2D_BGCLUT146_ALPHA       (0xFFu<<24)
#define DMA2D_BGCLUT146_ALPHA_0     (0x1u<<24)
#define DMA2D_BGCLUT146_RED         (0xFFu<<16)
#define DMA2D_BGCLUT146_RED_0       (0x1u<<16)
#define DMA2D_BGCLUT146_GREEN       (0xFFu<<8)
#define DMA2D_BGCLUT146_GREEN_0     (0x1u<<8)
#define DMA2D_BGCLUT146_BLUE        (0xFFu<<0)
#define DMA2D_BGCLUT146_BLUE_0      (0x1u<<0)

// BGCLUT147 Configuration

#define DMA2D_BGCLUT147_ALPHA       (0xFFu<<24)
#define DMA2D_BGCLUT147_ALPHA_0     (0x1u<<24)
#define DMA2D_BGCLUT147_RED         (0xFFu<<16)
#define DMA2D_BGCLUT147_RED_0       (0x1u<<16)
#define DMA2D_BGCLUT147_GREEN       (0xFFu<<8)
#define DMA2D_BGCLUT147_GREEN_0     (0x1u<<8)
#define DMA2D_BGCLUT147_BLUE        (0xFFu<<0)
#define DMA2D_BGCLUT147_BLUE_0      (0x1u<<0)

// BGCLUT148 Configuration

#define DMA2D_BGCLUT148_ALPHA       (0xFFu<<24)
#define DMA2D_BGCLUT148_ALPHA_0     (0x1u<<24)
#define DMA2D_BGCLUT148_RED         (0xFFu<<16)
#define DMA2D_BGCLUT148_RED_0       (0x1u<<16)
#define DMA2D_BGCLUT148_GREEN       (0xFFu<<8)
#define DMA2D_BGCLUT148_GREEN_0     (0x1u<<8)
#define DMA2D_BGCLUT148_BLUE        (0xFFu<<0)
#define DMA2D_BGCLUT148_BLUE_0      (0x1u<<0)

// BGCLUT149 Configuration

#define DMA2D_BGCLUT149_ALPHA       (0xFFu<<24)
#define DMA2D_BGCLUT149_ALPHA_0     (0x1u<<24)
#define DMA2D_BGCLUT149_RED         (0xFFu<<16)
#define DMA2D_BGCLUT149_RED_0       (0x1u<<16)
#define DMA2D_BGCLUT149_GREEN       (0xFFu<<8)
#define DMA2D_BGCLUT149_GREEN_0     (0x1u<<8)
#define DMA2D_BGCLUT149_BLUE        (0xFFu<<0)
#define DMA2D_BGCLUT149_BLUE_0      (0x1u<<0)

// BGCLUT150 Configuration

#define DMA2D_BGCLUT150_ALPHA       (0xFFu<<24)
#define DMA2D_BGCLUT150_ALPHA_0     (0x1u<<24)
#define DMA2D_BGCLUT150_RED         (0xFFu<<16)
#define DMA2D_BGCLUT150_RED_0       (0x1u<<16)
#define DMA2D_BGCLUT150_GREEN       (0xFFu<<8)
#define DMA2D_BGCLUT150_GREEN_0     (0x1u<<8)
#define DMA2D_BGCLUT150_BLUE        (0xFFu<<0)
#define DMA2D_BGCLUT150_BLUE_0      (0x1u<<0)

// BGCLUT151 Configuration

#define DMA2D_BGCLUT151_ALPHA       (0xFFu<<24)
#define DMA2D_BGCLUT151_ALPHA_0     (0x1u<<24)
#define DMA2D_BGCLUT151_RED         (0xFFu<<16)
#define DMA2D_BGCLUT151_RED_0       (0x1u<<16)
#define DMA2D_BGCLUT151_GREEN       (0xFFu<<8)
#define DMA2D_BGCLUT151_GREEN_0     (0x1u<<8)
#define DMA2D_BGCLUT151_BLUE        (0xFFu<<0)
#define DMA2D_BGCLUT151_BLUE_0      (0x1u<<0)

// BGCLUT152 Configuration

#define DMA2D_BGCLUT152_ALPHA       (0xFFu<<24)
#define DMA2D_BGCLUT152_ALPHA_0     (0x1u<<24)
#define DMA2D_BGCLUT152_RED         (0xFFu<<16)
#define DMA2D_BGCLUT152_RED_0       (0x1u<<16)
#define DMA2D_BGCLUT152_GREEN       (0xFFu<<8)
#define DMA2D_BGCLUT152_GREEN_0     (0x1u<<8)
#define DMA2D_BGCLUT152_BLUE        (0xFFu<<0)
#define DMA2D_BGCLUT152_BLUE_0      (0x1u<<0)

// BGCLUT153 Configuration

#define DMA2D_BGCLUT153_ALPHA       (0xFFu<<24)
#define DMA2D_BGCLUT153_ALPHA_0     (0x1u<<24)
#define DMA2D_BGCLUT153_RED         (0xFFu<<16)
#define DMA2D_BGCLUT153_RED_0       (0x1u<<16)
#define DMA2D_BGCLUT153_GREEN       (0xFFu<<8)
#define DMA2D_BGCLUT153_GREEN_0     (0x1u<<8)
#define DMA2D_BGCLUT153_BLUE        (0xFFu<<0)
#define DMA2D_BGCLUT153_BLUE_0      (0x1u<<0)

