Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_dma2d.h
// BGCLUT154 Configuration

#define DMA2D_BGCLUT154_ALPHA       (0xFFu<<24)
#define DMA2D_BGCLUT154_ALPHA_0     (0x1u<<24)
#define DMA2D_BGCLUT154_RED         (0xFFu<<16)
#define DMA2D_BGCLUT154_RED_0       (0x1u<<16)
#define DMA2D_BGCLUT154_GREEN       (0xFFu<<8)
#define DMA2D_BGCLUT154_GREEN_0     (0x1u<<8)
#define DMA2D_BGCLUT154_BLUE        (0xFFu<<0)
#define DMA2D_BGCLUT154_BLUE_0      (0x1u<<0)

// BGCLUT155 Configuration

#define DMA2D_BGCLUT155_ALPHA       (0xFFu<<24)
#define DMA2D_BGCLUT155_ALPHA_0     (0x1u<<24)
#define DMA2D_BGCLUT155_RED         (0xFFu<<16)
#define DMA2D_BGCLUT155_RED_0       (0x1u<<16)
#define DMA2D_BGCLUT155_GREEN       (0xFFu<<8)
#define DMA2D_BGCLUT155_GREEN_0     (0x1u<<8)
#define DMA2D_BGCLUT155_BLUE        (0xFFu<<0)
#define DMA2D_BGCLUT155_BLUE_0      (0x1u<<0)

// BGCLUT156 Configuration

#define DMA2D_BGCLUT156_ALPHA       (0xFFu<<24)
#define DMA2D_BGCLUT156_ALPHA_0     (0x1u<<24)
#define DMA2D_BGCLUT156_RED         (0xFFu<<16)
#define DMA2D_BGCLUT156_RED_0       (0x1u<<16)
#define DMA2D_BGCLUT156_GREEN       (0xFFu<<8)
#define DMA2D_BGCLUT156_GREEN_0     (0x1u<<8)
#define DMA2D_BGCLUT156_BLUE        (0xFFu<<0)
#define DMA2D_BGCLUT156_BLUE_0      (0x1u<<0)

// BGCLUT157 Configuration

#define DMA2D_BGCLUT157_ALPHA       (0xFFu<<24)
#define DMA2D_BGCLUT157_ALPHA_0     (0x1u<<24)
#define DMA2D_BGCLUT157_RED         (0xFFu<<16)
#define DMA2D_BGCLUT157_RED_0       (0x1u<<16)
#define DMA2D_BGCLUT157_GREEN       (0xFFu<<8)
#define DMA2D_BGCLUT157_GREEN_0     (0x1u<<8)
#define DMA2D_BGCLUT157_BLUE        (0xFFu<<0)
#define DMA2D_BGCLUT157_BLUE_0      (0x1u<<0)

// BGCLUT158 Configuration

#define DMA2D_BGCLUT158_ALPHA       (0xFFu<<24)
#define DMA2D_BGCLUT158_ALPHA_0     (0x1u<<24)
#define DMA2D_BGCLUT158_RED         (0xFFu<<16)
#define DMA2D_BGCLUT158_RED_0       (0x1u<<16)
#define DMA2D_BGCLUT158_GREEN       (0xFFu<<8)
#define DMA2D_BGCLUT158_GREEN_0     (0x1u<<8)
#define DMA2D_BGCLUT158_BLUE        (0xFFu<<0)
#define DMA2D_BGCLUT158_BLUE_0      (0x1u<<0)

// BGCLUT159 Configuration

#define DMA2D_BGCLUT159_ALPHA       (0xFFu<<24)
#define DMA2D_BGCLUT159_ALPHA_0     (0x1u<<24)
#define DMA2D_BGCLUT159_RED         (0xFFu<<16)
#define DMA2D_BGCLUT159_RED_0       (0x1u<<16)
#define DMA2D_BGCLUT159_GREEN       (0xFFu<<8)
#define DMA2D_BGCLUT159_GREEN_0     (0x1u<<8)
#define DMA2D_BGCLUT159_BLUE        (0xFFu<<0)
#define DMA2D_BGCLUT159_BLUE_0      (0x1u<<0)

// BGCLUT160 Configuration

#define DMA2D_BGCLUT160_ALPHA       (0xFFu<<24)
#define DMA2D_BGCLUT160_ALPHA_0     (0x1u<<24)
#define DMA2D_BGCLUT160_RED         (0xFFu<<16)
#define DMA2D_BGCLUT160_RED_0       (0x1u<<16)
#define DMA2D_BGCLUT160_GREEN       (0xFFu<<8)
#define DMA2D_BGCLUT160_GREEN_0     (0x1u<<8)
#define DMA2D_BGCLUT160_BLUE        (0xFFu<<0)
#define DMA2D_BGCLUT160_BLUE_0      (0x1u<<0)

// BGCLUT161 Configuration

#define DMA2D_BGCLUT161_ALPHA       (0xFFu<<24)
#define DMA2D_BGCLUT161_ALPHA_0     (0x1u<<24)
#define DMA2D_BGCLUT161_RED         (0xFFu<<16)
#define DMA2D_BGCLUT161_RED_0       (0x1u<<16)
#define DMA2D_BGCLUT161_GREEN       (0xFFu<<8)
#define DMA2D_BGCLUT161_GREEN_0     (0x1u<<8)
#define DMA2D_BGCLUT161_BLUE        (0xFFu<<0)
#define DMA2D_BGCLUT161_BLUE_0      (0x1u<<0)

// BGCLUT162 Configuration

#define DMA2D_BGCLUT162_ALPHA       (0xFFu<<24)
#define DMA2D_BGCLUT162_ALPHA_0     (0x1u<<24)
#define DMA2D_BGCLUT162_RED         (0xFFu<<16)
#define DMA2D_BGCLUT162_RED_0       (0x1u<<16)
#define DMA2D_BGCLUT162_GREEN       (0xFFu<<8)
#define DMA2D_BGCLUT162_GREEN_0     (0x1u<<8)
#define DMA2D_BGCLUT162_BLUE        (0xFFu<<0)
#define DMA2D_BGCLUT162_BLUE_0      (0x1u<<0)

// BGCLUT163 Configuration

#define DMA2D_BGCLUT163_ALPHA       (0xFFu<<24)
#define DMA2D_BGCLUT163_ALPHA_0     (0x1u<<24)
#define DMA2D_BGCLUT163_RED         (0xFFu<<16)
#define DMA2D_BGCLUT163_RED_0       (0x1u<<16)
#define DMA2D_BGCLUT163_GREEN       (0xFFu<<8)
#define DMA2D_BGCLUT163_GREEN_0     (0x1u<<8)
#define DMA2D_BGCLUT163_BLUE        (0xFFu<<0)
#define DMA2D_BGCLUT163_BLUE_0      (0x1u<<0)

// BGCLUT164 Configuration

#define DMA2D_BGCLUT164_ALPHA       (0xFFu<<24)
#define DMA2D_BGCLUT164_ALPHA_0     (0x1u<<24)
#define DMA2D_BGCLUT164_RED         (0xFFu<<16)
#define DMA2D_BGCLUT164_RED_0       (0x1u<<16)
#define DMA2D_BGCLUT164_GREEN       (0xFFu<<8)
#define DMA2D_BGCLUT164_GREEN_0     (0x1u<<8)
#define DMA2D_BGCLUT164_BLUE        (0xFFu<<0)
#define DMA2D_BGCLUT164_BLUE_0      (0x1u<<0)

// BGCLUT165 Configuration

#define DMA2D_BGCLUT165_ALPHA       (0xFFu<<24)
#define DMA2D_BGCLUT165_ALPHA_0     (0x1u<<24)
#define DMA2D_BGCLUT165_RED         (0xFFu<<16)
#define DMA2D_BGCLUT165_RED_0       (0x1u<<16)
#define DMA2D_BGCLUT165_GREEN       (0xFFu<<8)
#define DMA2D_BGCLUT165_GREEN_0     (0x1u<<8)
#define DMA2D_BGCLUT165_BLUE        (0xFFu<<0)
#define DMA2D_BGCLUT165_BLUE_0      (0x1u<<0)

// BGCLUT166 Configuration

#define DMA2D_BGCLUT166_ALPHA       (0xFFu<<24)
#define DMA2D_BGCLUT166_ALPHA_0     (0x1u<<24)
#define DMA2D_BGCLUT166_RED         (0xFFu<<16)
#define DMA2D_BGCLUT166_RED_0       (0x1u<<16)
#define DMA2D_BGCLUT166_GREEN       (0xFFu<<8)
#define DMA2D_BGCLUT166_GREEN_0     (0x1u<<8)
#define DMA2D_BGCLUT166_BLUE        (0xFFu<<0)
#define DMA2D_BGCLUT166_BLUE_0      (0x1u<<0)

// BGCLUT167 Configuration

#define DMA2D_BGCLUT167_ALPHA       (0xFFu<<24)
#define DMA2D_BGCLUT167_ALPHA_0     (0x1u<<24)
#define DMA2D_BGCLUT167_RED         (0xFFu<<16)
#define DMA2D_BGCLUT167_RED_0       (0x1u<<16)
#define DMA2D_BGCLUT167_GREEN       (0xFFu<<8)
#define DMA2D_BGCLUT167_GREEN_0     (0x1u<<8)
#define DMA2D_BGCLUT167_BLUE        (0xFFu<<0)
#define DMA2D_BGCLUT167_BLUE_0      (0x1u<<0)

// BGCLUT168 Configuration

#define DMA2D_BGCLUT168_ALPHA       (0xFFu<<24)
#define DMA2D_BGCLUT168_ALPHA_0     (0x1u<<24)
#define DMA2D_BGCLUT168_RED         (0xFFu<<16)
#define DMA2D_BGCLUT168_RED_0       (0x1u<<16)
#define DMA2D_BGCLUT168_GREEN       (0xFFu<<8)
#define DMA2D_BGCLUT168_GREEN_0     (0x1u<<8)
#define DMA2D_BGCLUT168_BLUE        (0xFFu<<0)
#define DMA2D_BGCLUT168_BLUE_0      (0x1u<<0)

// BGCLUT169 Configuration

#define DMA2D_BGCLUT169_ALPHA       (0xFFu<<24)
#define DMA2D_BGCLUT169_ALPHA_0     (0x1u<<24)
#define DMA2D_BGCLUT169_RED         (0xFFu<<16)
#define DMA2D_BGCLUT169_RED_0       (0x1u<<16)
#define DMA2D_BGCLUT169_GREEN       (0xFFu<<8)
#define DMA2D_BGCLUT169_GREEN_0     (0x1u<<8)
#define DMA2D_BGCLUT169_BLUE        (0xFFu<<0)
#define DMA2D_BGCLUT169_BLUE_0      (0x1u<<0)

