Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_dma2d.h
// BGCLUT170 Configuration

#define DMA2D_BGCLUT170_ALPHA       (0xFFu<<24)
#define DMA2D_BGCLUT170_ALPHA_0     (0x1u<<24)
#define DMA2D_BGCLUT170_RED         (0xFFu<<16)
#define DMA2D_BGCLUT170_RED_0       (0x1u<<16)
#define DMA2D_BGCLUT170_GREEN       (0xFFu<<8)
#define DMA2D_BGCLUT170_GREEN_0     (0x1u<<8)
#define DMA2D_BGCLUT170_BLUE        (0xFFu<<0)
#define DMA2D_BGCLUT170_BLUE_0      (0x1u<<0)

// BGCLUT171 Configuration

#define DMA2D_BGCLUT171_ALPHA       (0xFFu<<24)
#define DMA2D_BGCLUT171_ALPHA_0     (0x1u<<24)
#define DMA2D_BGCLUT171_RED         (0xFFu<<16)
#define DMA2D_BGCLUT171_RED_0       (0x1u<<16)
#define DMA2D_BGCLUT171_GREEN       (0xFFu<<8)
#define DMA2D_BGCLUT171_GREEN_0     (0x1u<<8)
#define DMA2D_BGCLUT171_BLUE        (0xFFu<<0)
#define DMA2D_BGCLUT171_BLUE_0      (0x1u<<0)

// BGCLUT172 Configuration

#define DMA2D_BGCLUT172_ALPHA       (0xFFu<<24)
#define DMA2D_BGCLUT172_ALPHA_0     (0x1u<<24)
#define DMA2D_BGCLUT172_RED         (0xFFu<<16)
#define DMA2D_BGCLUT172_RED_0       (0x1u<<16)
#define DMA2D_BGCLUT172_GREEN       (0xFFu<<8)
#define DMA2D_BGCLUT172_GREEN_0     (0x1u<<8)
#define DMA2D_BGCLUT172_BLUE        (0xFFu<<0)
#define DMA2D_BGCLUT172_BLUE_0      (0x1u<<0)

// BGCLUT173 Configuration

#define DMA2D_BGCLUT173_ALPHA       (0xFFu<<24)
#define DMA2D_BGCLUT173_ALPHA_0     (0x1u<<24)
#define DMA2D_BGCLUT173_RED         (0xFFu<<16)
#define DMA2D_BGCLUT173_RED_0       (0x1u<<16)
#define DMA2D_BGCLUT173_GREEN       (0xFFu<<8)
#define DMA2D_BGCLUT173_GREEN_0     (0x1u<<8)
#define DMA2D_BGCLUT173_BLUE        (0xFFu<<0)
#define DMA2D_BGCLUT173_BLUE_0      (0x1u<<0)

// BGCLUT174 Configuration

#define DMA2D_BGCLUT174_ALPHA       (0xFFu<<24)
#define DMA2D_BGCLUT174_ALPHA_0     (0x1u<<24)
#define DMA2D_BGCLUT174_RED         (0xFFu<<16)
#define DMA2D_BGCLUT174_RED_0       (0x1u<<16)
#define DMA2D_BGCLUT174_GREEN       (0xFFu<<8)
#define DMA2D_BGCLUT174_GREEN_0     (0x1u<<8)
#define DMA2D_BGCLUT174_BLUE        (0xFFu<<0)
#define DMA2D_BGCLUT174_BLUE_0      (0x1u<<0)

// BGCLUT175 Configuration

#define DMA2D_BGCLUT175_ALPHA       (0xFFu<<24)
#define DMA2D_BGCLUT175_ALPHA_0     (0x1u<<24)
#define DMA2D_BGCLUT175_RED         (0xFFu<<16)
#define DMA2D_BGCLUT175_RED_0       (0x1u<<16)
#define DMA2D_BGCLUT175_GREEN       (0xFFu<<8)
#define DMA2D_BGCLUT175_GREEN_0     (0x1u<<8)
#define DMA2D_BGCLUT175_BLUE        (0xFFu<<0)
#define DMA2D_BGCLUT175_BLUE_0      (0x1u<<0)

// BGCLUT176 Configuration

#define DMA2D_BGCLUT176_ALPHA       (0xFFu<<24)
#define DMA2D_BGCLUT176_ALPHA_0     (0x1u<<24)
#define DMA2D_BGCLUT176_RED         (0xFFu<<16)
#define DMA2D_BGCLUT176_RED_0       (0x1u<<16)
#define DMA2D_BGCLUT176_GREEN       (0xFFu<<8)
#define DMA2D_BGCLUT176_GREEN_0     (0x1u<<8)
#define DMA2D_BGCLUT176_BLUE        (0xFFu<<0)
#define DMA2D_BGCLUT176_BLUE_0      (0x1u<<0)

// BGCLUT177 Configuration

#define DMA2D_BGCLUT177_ALPHA       (0xFFu<<24)
#define DMA2D_BGCLUT177_ALPHA_0     (0x1u<<24)
#define DMA2D_BGCLUT177_RED         (0xFFu<<16)
#define DMA2D_BGCLUT177_RED_0       (0x1u<<16)
#define DMA2D_BGCLUT177_GREEN       (0xFFu<<8)
#define DMA2D_BGCLUT177_GREEN_0     (0x1u<<8)
#define DMA2D_BGCLUT177_BLUE        (0xFFu<<0)
#define DMA2D_BGCLUT177_BLUE_0      (0x1u<<0)

// BGCLUT178 Configuration

#define DMA2D_BGCLUT178_ALPHA       (0xFFu<<24)
#define DMA2D_BGCLUT178_ALPHA_0     (0x1u<<24)
#define DMA2D_BGCLUT178_RED         (0xFFu<<16)
#define DMA2D_BGCLUT178_RED_0       (0x1u<<16)
#define DMA2D_BGCLUT178_GREEN       (0xFFu<<8)
#define DMA2D_BGCLUT178_GREEN_0     (0x1u<<8)
#define DMA2D_BGCLUT178_BLUE        (0xFFu<<0)
#define DMA2D_BGCLUT178_BLUE_0      (0x1u<<0)

// BGCLUT179 Configuration

#define DMA2D_BGCLUT179_ALPHA       (0xFFu<<24)
#define DMA2D_BGCLUT179_ALPHA_0     (0x1u<<24)
#define DMA2D_BGCLUT179_RED         (0xFFu<<16)
#define DMA2D_BGCLUT179_RED_0       (0x1u<<16)
#define DMA2D_BGCLUT179_GREEN       (0xFFu<<8)
#define DMA2D_BGCLUT179_GREEN_0     (0x1u<<8)
#define DMA2D_BGCLUT179_BLUE        (0xFFu<<0)
#define DMA2D_BGCLUT179_BLUE_0      (0x1u<<0)

// BGCLUT180 Configuration

#define DMA2D_BGCLUT180_ALPHA       (0xFFu<<24)
#define DMA2D_BGCLUT180_ALPHA_0     (0x1u<<24)
#define DMA2D_BGCLUT180_RED         (0xFFu<<16)
#define DMA2D_BGCLUT180_RED_0       (0x1u<<16)
#define DMA2D_BGCLUT180_GREEN       (0xFFu<<8)
#define DMA2D_BGCLUT180_GREEN_0     (0x1u<<8)
#define DMA2D_BGCLUT180_BLUE        (0xFFu<<0)
#define DMA2D_BGCLUT180_BLUE_0      (0x1u<<0)

// BGCLUT181 Configuration

#define DMA2D_BGCLUT181_ALPHA       (0xFFu<<24)
#define DMA2D_BGCLUT181_ALPHA_0     (0x1u<<24)
#define DMA2D_BGCLUT181_RED         (0xFFu<<16)
#define DMA2D_BGCLUT181_RED_0       (0x1u<<16)
#define DMA2D_BGCLUT181_GREEN       (0xFFu<<8)
#define DMA2D_BGCLUT181_GREEN_0     (0x1u<<8)
#define DMA2D_BGCLUT181_BLUE        (0xFFu<<0)
#define DMA2D_BGCLUT181_BLUE_0      (0x1u<<0)

// BGCLUT182 Configuration

#define DMA2D_BGCLUT182_ALPHA       (0xFFu<<24)
#define DMA2D_BGCLUT182_ALPHA_0     (0x1u<<24)
#define DMA2D_BGCLUT182_RED         (0xFFu<<16)
#define DMA2D_BGCLUT182_RED_0       (0x1u<<16)
#define DMA2D_BGCLUT182_GREEN       (0xFFu<<8)
#define DMA2D_BGCLUT182_GREEN_0     (0x1u<<8)
#define DMA2D_BGCLUT182_BLUE        (0xFFu<<0)
#define DMA2D_BGCLUT182_BLUE_0      (0x1u<<0)

// BGCLUT183 Configuration

#define DMA2D_BGCLUT183_ALPHA       (0xFFu<<24)
#define DMA2D_BGCLUT183_ALPHA_0     (0x1u<<24)
#define DMA2D_BGCLUT183_RED         (0xFFu<<16)
#define DMA2D_BGCLUT183_RED_0       (0x1u<<16)
#define DMA2D_BGCLUT183_GREEN       (0xFFu<<8)
#define DMA2D_BGCLUT183_GREEN_0     (0x1u<<8)
#define DMA2D_BGCLUT183_BLUE        (0xFFu<<0)
#define DMA2D_BGCLUT183_BLUE_0      (0x1u<<0)

// BGCLUT184 Configuration

#define DMA2D_BGCLUT184_ALPHA       (0xFFu<<24)
#define DMA2D_BGCLUT184_ALPHA_0     (0x1u<<24)
#define DMA2D_BGCLUT184_RED         (0xFFu<<16)
#define DMA2D_BGCLUT184_RED_0       (0x1u<<16)
#define DMA2D_BGCLUT184_GREEN       (0xFFu<<8)
#define DMA2D_BGCLUT184_GREEN_0     (0x1u<<8)
#define DMA2D_BGCLUT184_BLUE        (0xFFu<<0)
#define DMA2D_BGCLUT184_BLUE_0      (0x1u<<0)

// BGCLUT185 Configuration

