Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_dma2d.h
#define DMA2D_BGCLUT201_ALPHA       (0xFFu<<24)
#define DMA2D_BGCLUT201_ALPHA_0     (0x1u<<24)
#define DMA2D_BGCLUT201_RED         (0xFFu<<16)
#define DMA2D_BGCLUT201_RED_0       (0x1u<<16)
#define DMA2D_BGCLUT201_GREEN       (0xFFu<<8)
#define DMA2D_BGCLUT201_GREEN_0     (0x1u<<8)
#define DMA2D_BGCLUT201_BLUE        (0xFFu<<0)
#define DMA2D_BGCLUT201_BLUE_0      (0x1u<<0)

// BGCLUT202 Configuration

#define DMA2D_BGCLUT202_ALPHA       (0xFFu<<24)
#define DMA2D_BGCLUT202_ALPHA_0     (0x1u<<24)
#define DMA2D_BGCLUT202_RED         (0xFFu<<16)
#define DMA2D_BGCLUT202_RED_0       (0x1u<<16)
#define DMA2D_BGCLUT202_GREEN       (0xFFu<<8)
#define DMA2D_BGCLUT202_GREEN_0     (0x1u<<8)
#define DMA2D_BGCLUT202_BLUE        (0xFFu<<0)
#define DMA2D_BGCLUT202_BLUE_0      (0x1u<<0)

// BGCLUT203 Configuration

#define DMA2D_BGCLUT203_ALPHA       (0xFFu<<24)
#define DMA2D_BGCLUT203_ALPHA_0     (0x1u<<24)
#define DMA2D_BGCLUT203_RED         (0xFFu<<16)
#define DMA2D_BGCLUT203_RED_0       (0x1u<<16)
#define DMA2D_BGCLUT203_GREEN       (0xFFu<<8)
#define DMA2D_BGCLUT203_GREEN_0     (0x1u<<8)
#define DMA2D_BGCLUT203_BLUE        (0xFFu<<0)
#define DMA2D_BGCLUT203_BLUE_0      (0x1u<<0)

// BGCLUT204 Configuration

#define DMA2D_BGCLUT204_ALPHA       (0xFFu<<24)
#define DMA2D_BGCLUT204_ALPHA_0     (0x1u<<24)
#define DMA2D_BGCLUT204_RED         (0xFFu<<16)
#define DMA2D_BGCLUT204_RED_0       (0x1u<<16)
#define DMA2D_BGCLUT204_GREEN       (0xFFu<<8)
#define DMA2D_BGCLUT204_GREEN_0     (0x1u<<8)
#define DMA2D_BGCLUT204_BLUE        (0xFFu<<0)
#define DMA2D_BGCLUT204_BLUE_0      (0x1u<<0)

// BGCLUT205 Configuration

#define DMA2D_BGCLUT205_ALPHA       (0xFFu<<24)
#define DMA2D_BGCLUT205_ALPHA_0     (0x1u<<24)
#define DMA2D_BGCLUT205_RED         (0xFFu<<16)
#define DMA2D_BGCLUT205_RED_0       (0x1u<<16)
#define DMA2D_BGCLUT205_GREEN       (0xFFu<<8)
#define DMA2D_BGCLUT205_GREEN_0     (0x1u<<8)
#define DMA2D_BGCLUT205_BLUE        (0xFFu<<0)
#define DMA2D_BGCLUT205_BLUE_0      (0x1u<<0)

// BGCLUT206 Configuration

#define DMA2D_BGCLUT206_ALPHA       (0xFFu<<24)
#define DMA2D_BGCLUT206_ALPHA_0     (0x1u<<24)
#define DMA2D_BGCLUT206_RED         (0xFFu<<16)
#define DMA2D_BGCLUT206_RED_0       (0x1u<<16)
#define DMA2D_BGCLUT206_GREEN       (0xFFu<<8)
#define DMA2D_BGCLUT206_GREEN_0     (0x1u<<8)
#define DMA2D_BGCLUT206_BLUE        (0xFFu<<0)
#define DMA2D_BGCLUT206_BLUE_0      (0x1u<<0)

// BGCLUT207 Configuration

#define DMA2D_BGCLUT207_ALPHA       (0xFFu<<24)
#define DMA2D_BGCLUT207_ALPHA_0     (0x1u<<24)
#define DMA2D_BGCLUT207_RED         (0xFFu<<16)
#define DMA2D_BGCLUT207_RED_0       (0x1u<<16)
#define DMA2D_BGCLUT207_GREEN       (0xFFu<<8)
#define DMA2D_BGCLUT207_GREEN_0     (0x1u<<8)
#define DMA2D_BGCLUT207_BLUE        (0xFFu<<0)
#define DMA2D_BGCLUT207_BLUE_0      (0x1u<<0)

// BGCLUT208 Configuration

#define DMA2D_BGCLUT208_ALPHA       (0xFFu<<24)
#define DMA2D_BGCLUT208_ALPHA_0     (0x1u<<24)
#define DMA2D_BGCLUT208_RED         (0xFFu<<16)
#define DMA2D_BGCLUT208_RED_0       (0x1u<<16)
#define DMA2D_BGCLUT208_GREEN       (0xFFu<<8)
#define DMA2D_BGCLUT208_GREEN_0     (0x1u<<8)
#define DMA2D_BGCLUT208_BLUE        (0xFFu<<0)
#define DMA2D_BGCLUT208_BLUE_0      (0x1u<<0)

// BGCLUT209 Configuration

#define DMA2D_BGCLUT209_ALPHA       (0xFFu<<24)
#define DMA2D_BGCLUT209_ALPHA_0     (0x1u<<24)
#define DMA2D_BGCLUT209_RED         (0xFFu<<16)
#define DMA2D_BGCLUT209_RED_0       (0x1u<<16)
#define DMA2D_BGCLUT209_GREEN       (0xFFu<<8)
#define DMA2D_BGCLUT209_GREEN_0     (0x1u<<8)
#define DMA2D_BGCLUT209_BLUE        (0xFFu<<0)
#define DMA2D_BGCLUT209_BLUE_0      (0x1u<<0)

// BGCLUT210 Configuration

#define DMA2D_BGCLUT210_ALPHA       (0xFFu<<24)
#define DMA2D_BGCLUT210_ALPHA_0     (0x1u<<24)
#define DMA2D_BGCLUT210_RED         (0xFFu<<16)
#define DMA2D_BGCLUT210_RED_0       (0x1u<<16)
#define DMA2D_BGCLUT210_GREEN       (0xFFu<<8)
#define DMA2D_BGCLUT210_GREEN_0     (0x1u<<8)
#define DMA2D_BGCLUT210_BLUE        (0xFFu<<0)
#define DMA2D_BGCLUT210_BLUE_0      (0x1u<<0)

// BGCLUT211 Configuration

#define DMA2D_BGCLUT211_ALPHA       (0xFFu<<24)
#define DMA2D_BGCLUT211_ALPHA_0     (0x1u<<24)
#define DMA2D_BGCLUT211_RED         (0xFFu<<16)
#define DMA2D_BGCLUT211_RED_0       (0x1u<<16)
#define DMA2D_BGCLUT211_GREEN       (0xFFu<<8)
#define DMA2D_BGCLUT211_GREEN_0     (0x1u<<8)
#define DMA2D_BGCLUT211_BLUE        (0xFFu<<0)
#define DMA2D_BGCLUT211_BLUE_0      (0x1u<<0)

// BGCLUT212 Configuration

#define DMA2D_BGCLUT212_ALPHA       (0xFFu<<24)
#define DMA2D_BGCLUT212_ALPHA_0     (0x1u<<24)
#define DMA2D_BGCLUT212_RED         (0xFFu<<16)
#define DMA2D_BGCLUT212_RED_0       (0x1u<<16)
#define DMA2D_BGCLUT212_GREEN       (0xFFu<<8)
#define DMA2D_BGCLUT212_GREEN_0     (0x1u<<8)
#define DMA2D_BGCLUT212_BLUE        (0xFFu<<0)
#define DMA2D_BGCLUT212_BLUE_0      (0x1u<<0)

// BGCLUT213 Configuration

#define DMA2D_BGCLUT213_ALPHA       (0xFFu<<24)
#define DMA2D_BGCLUT213_ALPHA_0     (0x1u<<24)
#define DMA2D_BGCLUT213_RED         (0xFFu<<16)
#define DMA2D_BGCLUT213_RED_0       (0x1u<<16)
#define DMA2D_BGCLUT213_GREEN       (0xFFu<<8)
#define DMA2D_BGCLUT213_GREEN_0     (0x1u<<8)
#define DMA2D_BGCLUT213_BLUE        (0xFFu<<0)
#define DMA2D_BGCLUT213_BLUE_0      (0x1u<<0)

// BGCLUT214 Configuration

#define DMA2D_BGCLUT214_ALPHA       (0xFFu<<24)
#define DMA2D_BGCLUT214_ALPHA_0     (0x1u<<24)
#define DMA2D_BGCLUT214_RED         (0xFFu<<16)
#define DMA2D_BGCLUT214_RED_0       (0x1u<<16)
#define DMA2D_BGCLUT214_GREEN       (0xFFu<<8)
#define DMA2D_BGCLUT214_GREEN_0     (0x1u<<8)
#define DMA2D_BGCLUT214_BLUE        (0xFFu<<0)
#define DMA2D_BGCLUT214_BLUE_0      (0x1u<<0)

// BGCLUT215 Configuration

#define DMA2D_BGCLUT215_ALPHA       (0xFFu<<24)
#define DMA2D_BGCLUT215_ALPHA_0     (0x1u<<24)
#define DMA2D_BGCLUT215_RED         (0xFFu<<16)
#define DMA2D_BGCLUT215_RED_0       (0x1u<<16)
#define DMA2D_BGCLUT215_GREEN       (0xFFu<<8)
#define DMA2D_BGCLUT215_GREEN_0     (0x1u<<8)
#define DMA2D_BGCLUT215_BLUE        (0xFFu<<0)
#define DMA2D_BGCLUT215_BLUE_0      (0x1u<<0)

// BGCLUT216 Configuration

#define DMA2D_BGCLUT216_ALPHA       (0xFFu<<24)
#define DMA2D_BGCLUT216_ALPHA_0     (0x1u<<24)
#define DMA2D_BGCLUT216_RED         (0xFFu<<16)
#define DMA2D_BGCLUT216_RED_0       (0x1u<<16)
#define DMA2D_BGCLUT216_GREEN       (0xFFu<<8)
#define DMA2D_BGCLUT216_GREEN_0     (0x1u<<8)
#define DMA2D_BGCLUT216_BLUE        (0xFFu<<0)
#define DMA2D_BGCLUT216_BLUE_0      (0x1u<<0)

// BGCLUT217 Configuration

#define DMA2D_BGCLUT217_ALPHA       (0xFFu<<24)
#define DMA2D_BGCLUT217_ALPHA_0     (0x1u<<24)
#define DMA2D_BGCLUT217_RED         (0xFFu<<16)
#define DMA2D_BGCLUT217_RED_0       (0x1u<<16)
#define DMA2D_BGCLUT217_GREEN       (0xFFu<<8)
#define DMA2D_BGCLUT217_GREEN_0     (0x1u<<8)
#define DMA2D_BGCLUT217_BLUE        (0xFFu<<0)
#define DMA2D_BGCLUT217_BLUE_0      (0x1u<<0)

// BGCLUT218 Configuration

#define DMA2D_BGCLUT218_ALPHA       (0xFFu<<24)
#define DMA2D_BGCLUT218_ALPHA_0     (0x1u<<24)
#define DMA2D_BGCLUT218_RED         (0xFFu<<16)
#define DMA2D_BGCLUT218_RED_0       (0x1u<<16)
#define DMA2D_BGCLUT218_GREEN       (0xFFu<<8)
#define DMA2D_BGCLUT218_GREEN_0     (0x1u<<8)
#define DMA2D_BGCLUT218_BLUE        (0xFFu<<0)
#define DMA2D_BGCLUT218_BLUE_0      (0x1u<<0)

// BGCLUT219 Configuration

